#!/usr/bin/env ruby
#=========================================================================
=begin

 Copyright 2014, martin.vahi@softf1.com that has an
 Estonian personal identification code of 38108050020.
 All rights reserved.

 Redistribution and use in source and binary forms, with or
 without modification, are permitted provided that the following
 conditions are met:

 * Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.
 * Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer
   in the documentation and/or other materials provided with the
   distribution.
 * Neither the name of the Martin Vahi nor the names of its
   contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
 CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

=end
#=========================================================================

if !defined? KIBUVITS_HOME
   require 'pathname'
   ob_pth_0=Pathname.new(__FILE__).realpath
   ob_pth_1=ob_pth_0.parent.parent.parent.parent
   s_KIBUVITS_HOME_b_fs=ob_pth_1.to_s
   require(s_KIBUVITS_HOME_b_fs+"/src/include/kibuvits_boot.rb")
   ob_pth_0=nil; ob_pth_1=nil; s_KIBUVITS_HOME_b_fs=nil
end # if

require  KIBUVITS_HOME+"/src/include/kibuvits_str_concat_array_of_strings.rb"
require  KIBUVITS_HOME+"/src/include/security/kibuvits_rng.rb"
require  KIBUVITS_HOME+"/src/include/kibuvits_msgc.rb"

#==========================================================================

class Kibuvits_security_core

   def initialize
      @mx_ar_s_set_of_alphabets_t1_datainit=Mutex.new
   end # initialize

   # The s_mmmv_checksum_t1 is not a classical hash function, because
   # its goal is not to hide the string that its output has
   # been derived from. There does exist a goal to make it
   # difficult to construct colliding input pairs.
   #
   # The core of the algorithm is based on the idea that
   # it is computationally expensive to pack a fixed size bag
   # as tightly as possible by using a set of fixed size objects.
   #
   # http://longterm.softf1.com/2013/specification_drafts/checksum_idea_t2/
   #
   # The s_mmmv_checksum_t1 might be used as a weak hash function
   # in situations, where PHP hash function implementation
   # does not support Unicode. JavaScript side might include
   # a timestamp with a few minute deadline and a salt value
   # to shorten the time window, where collisions must be found.
   def s_mmmv_checksum_t1(s_in,i_number_of_columns,i_m,ar_of_ar_speedhack=nil)
      if KIBUVITS_b_DEBUG
         bn=binding()
         kibuvits_typecheck bn, String, s_in
         kibuvits_typecheck bn, Fixnum, i_number_of_columns
         kibuvits_assert_is_smaller_than_or_equal_to(bn,
         1, i_number_of_columns)
         if ar_of_ar_speedhack.class==Array
            kibuvits_assert_ar_elements_typecheck_if_is_array(bn,
            Array,ar_of_ar_speedhack)
            if ar_of_ar_speedhack.size!=i_number_of_columns
               msg="ar_of_ar_speedhack.size=="+ar_of_ar_speedhack.size.to_s+
               " != i_number_of_columns=="+i_number_of_columns.to_s
               "GUID='63750a36-24d6-4732-825b-60d01021ced7'"
               kibuvits_throw(msg)
            end # if
         end # if
      end # if
      #---------
      ar_columns=nil
      if ar_of_ar_speedhack.class==Array
         ar_columns=ar_of_ar_speedhack
      else
         ar_columns=Array.new
         i_number_of_columns.times {ar_columns<<Array.new}
      end # if
      #---------
      i_len=nil
      i_0=nil
      s_0=nil
      ar_column=nil
      #---------
      i_s_len=s_in.length
      return $kibuvits_lc_emptystring if i_s_len==0
      i_s_max=i_s_len-1
      i_ix_s=0
      i_ix_column=0
      b_end_of_string_reached=false
      b_end_of_row_reached=false
      ar_codepoints=s_in.codepoints
      while true
         ar_column=ar_columns[i_ix_column]
         ar_column<<ar_codepoints[i_ix_s]
         #----
         i_ix_s=i_ix_s+1
         if i_s_max<i_ix_s
            i_ix_s=0
            b_end_of_string_reached=true
            break if b_end_of_row_reached
         end # if
         i_ix_column=i_ix_column+1
         if i_number_of_columns<=i_ix_column
            i_ix_column=0
            b_end_of_row_reached=true
            break if b_end_of_string_reached
         end # if
         #----
      end # loop
      ar_codepoints.clear
      #---------
      ar_xi_s=Array.new(i_number_of_columns,$kibuvits_lc_emptystring)
      b_not_first=false
      i_number_of_columns.times do |i|
         ar_column=ar_columns[i]
         i_len=ar_column.size
         i_0=0
         i_len.times do |ii|
            i_0=i_0+ar_column[ii]
         end # loop
         if b_not_first
            ar_xi_s[i]=$kibuvits_lc_underscore+(i_0%i_m).to_s
         else
            ar_xi_s[i]=(i_0%i_m).to_s
            b_not_first=true
         end # if
         ar_column.clear # to reuse the array in the ar_of_ar_speedhack
      end # loop
      s_out=kibuvits_s_concat_array_of_strings(ar_xi_s)
      return s_out
   end # s_mmmv_checksum_t1


   def Kibuvits_security_core.s_mmmv_checksum_t1(s_in,i_number_of_columns,i_m,
      ar_of_ar_speedhack=nil)
      s_out=Kibuvits_security_core.instance.s_mmmv_checksum_t1(s_in,i_number_of_columns,i_m,
      ar_of_ar_speedhack)
      return s_out
   end # Kibuvits_security_core.s_decrypt_wearlevelling_t1

   #-----------------------------------------------------------------------

   # Returns a frozen array of characters that
   # originate from various alphabets.
   #
   # It is a vital part of the plaice_t1 hashing algorithm.
   # Any changes in the alphabet changes the plaice_t1
   # hashing algorithm and that may render passwords invalid,
   # users locked out of information systems, etc.
   def ar_s_set_of_alphabets_t1
      if defined? @ar_s_set_of_alphabets_t1_ar_chars
         ar_out=@ar_s_set_of_alphabets_t1_ar_chars
         return ar_out
      end # if
      @mx_ar_s_set_of_alphabets_t1_datainit.synchronize do
         # If this thread was waiting for some other
         # thread to unlock this code region, then
         # by the time this thread enters the code
         # region, the previous thread has completed
         # assembly of the @ar_s_set_of_alphabets_t1_ar_chars
         if defined? @ar_s_set_of_alphabets_t1_ar_chars
            s_out=@ar_s_set_of_alphabets_t1_ar_chars
            return s_out
         end # if
         rgx=/./
         ar_chars_raw=Array.new
         ar_s=Array.new
         #------------------------
         ar_s.clear
         ar_s<<".,:;|_~/\\+-*^%=÷"
         ar_s<<"@#ʻ`?!\"'«»„”″"
         ar_s<<"¤$€₳฿₵¢₡₢₠$₫৳₯ €ƒ₣₲₴₭ℳ ₥ ₦₧ ₱₰£₹₨ ₪ ₸₮₩ ¥៛"
         ar_s<<"⁂❧◊※"
         #
         # The next comment line makes the caracter at the next line visible.
         #
         ar_s<<(("⁀\n\t\r"+"℠™©®℗")+("‰°†‡"+"()<>[]{}"))
         s_0=kibuvits_s_concat_array_of_strings(ar_s).upcase
         s_1=s_0.downcase
         # The memory-wasting "+" operator is used in stead
         # of the arrayinstance.concat!(other_array)
         # to implement a workaround to a Ruby system flaw that once existed.
         ar_chars_raw=ar_chars_raw+(s_0+s_1).scan(rgx)
         #------------------------
         ar_s.clear
         ar_s<<"ąäáàǎâãåçčďęėéêěēģíìîīķļłņńñňóòôõöřúùüůūťšśžźżßýɤ̌ɤ̂ɤ́ɤ̀ɤɣ"
         ar_s<<"абвгдеёжзклмнопрстуфхцчшщъыьэюя"
         ar_s<<"àâæçéèêëîïôœùûÿ"
         ar_s<<"ʌɑɑ̃əə̃ɛʒʃʁd̥b̥ʰˀɡɡ̊ϥɔʋðøɐʉχɽŋkðɨɪʝçƆʕʔḥħḏẖçɟꜥⲙⲛⲡⲫϣϧⳉ"
         ar_s<<"ϩɥʐʂɕɻʊ̃ʊœ"
         ar_s<<"ⲧⲑϫϭⲕⲭⲇⲅⲃⲍ(ⲟ)ⲩⲗⲉⲓⲣ"
         ar_s<<"αβγδεζηθικλμνξοπρσςτυφχψω"
         ar_s<<"abcdefghijklmnoprstuvxyzw1234567890"
         s_0=kibuvits_s_concat_array_of_strings(ar_s).upcase
         s_1=s_0.downcase
         ar_chars_raw=ar_chars_raw+(s_0+s_1).scan(rgx)
         #------------------------
         ar_s.clear
         ar_s<<"∀∁∂∃∄∅∆∇∈∉∊∋∌∍∏∐∑−∓∔∕∖∗∘∙√∛∜∝∞∟∠∡∢∣∤∥∦∧∨∩∪∫∬∭∮∯"
         ar_s<<"∰∱∲∳∴∵∶∷∸∹∺∻∼∽∾∿≀≁≂≃≄≅≆≇≈≉≊≋≌≍≎≏≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟"
         ar_s<<"≠≡≢≣≤≥≦≧≨≩≪≫≬≭≮≯≰≱≲≳≴≵≶≷≸≹≺≻≼≽≾≿⊀⊁⊂⊃⊄⊅⊆⊇⊈⊉⊊⊋⊌⊍⊎⊏"
         ar_s<<"⊐⊑⊒⊓⊔⊕⊖⊗⊘⊙⊚⊛⊜⊝⊞⊟⊠⊡⊢⊣⊤⊥⊦⊧⊨⊩⊪⊫⊬⊭⊮⊯⊰⊱⊲⊳⊴⊵⊶⊷⊸⊹⊺⊻⊼⊽⊾⊿"
         ar_s<<"⋀⋁⋂⋃⋄⋅⋆⋇⋈⋉⋊⋋⋌⋍⋎⋏⋐⋑⋒⋓⋔⋕⋖⋗⋘⋙⋚⋛⋜⋝⋞⋟⋠⋡⋢⋣⋤⋥⋦⋧⋨⋩⋪⋫⋬⋭⋮⋯"
         ar_s<<"⋰⋱⋲⋳⋴⋵⋶⋷⋸⋹⋺⋻⋼⋽⋾⋿"
         ar_s<<"⨀⨁⨂⨃⨄⨅⨆⨇⨈⨉⨊⨋⨌⨍⨎⨏⨐⨑⨒⨓⨔⨕⨖⨗⨘⨙⨚⨛⨜⨝⨞⨟⨠⨡⨢⨣⨤⨥⨦⨧⨨⨩⨪⨫⨬⨭⨮⨯"
         ar_s<<"⨰⨱⨲⨳⨴⨵⨶⨷⨸⨹⨺⨻⨼⨽⨾⨿⩀⩁⩂⩃⩄⩅⩆⩇⩈⩉⩊⩋⩌⩍⩎⩏⩐⩑⩒⩓⩔⩕⩖⩗⩘⩙⩚⩛⩜⩝⩞⩟"
         ar_s<<"⩠⩡⩢⩣⩤⩥⩦⩧⩨⩩⩪⩫⩬⩭⩮⩯⩰⩱⩲⩳⩴⩵⩶⩷⩸⩹⩺⩻⩼⩽⩾⩿⪀⪁⪂⪃⪄⪅⪆⪇⪈⪉⪊⪋⪌⪍⪎⪏"
         ar_s<<"⪐⪑⪒⪓⪔⪕⪖⪗⪘⪙⪚⪛⪜⪝⪞⪟⪠⪡⪢⪣⪤⪥⪦⪧⪨⪩⪪⪫⪬⪭⪮⪯⪰⪱⪲⪳⪴⪵⪶⪷⪸⪹⪺⪻⪼⪽⪾⪿"
         ar_s<<"⫀⫁⫂⫃⫄⫅⫆⫇⫈⫉⫊⫋⫌⫍⫎⫏⫐⫑⫒⫓⫔⫕⫖⫗⫘⫙⫚⫛⫝̸⫝⫞⫟⫠⫡⫢⫣⫤⫥⫦⫧⫨⫩⫪⫫⫬⫭⫮⫯"
         ar_s<<"⫰⫱⫲⫳⫴⫵⫶⫷⫸⫹⫺⫻⫼⫽⫾⫿"
         ar_s<<"⟀⟁⟂⟃⟄⟅⟆⟇⟈⟉⟊⟋⟌⟍⟎⟏⟐⟑⟒⟓⟔⟕⟖⟗⟘⟙⟚⟛⟜⟝⟞⟟⟠⟡⟢⟣⟤⟥⟦⟧⟨⟩⟪⟫⟬⟭⟮⟯"
         ar_s<<"⦀⦁⦂⦃⦄⦅⦆⦇⦈⦉⦊⦋⦌⦍⦎⦏⦐⦑⦒⦓⦔⦕⦖⦗⦘⦙⦚⦛⦜⦝⦞⦟⦠⦡⦢⦣⦤⦥⦦⦧⦨⦩⦪⦫⦬⦭⦮⦯"
         ar_s<<"⦰⦱⦲⦳⦴⦵⦶⦷⦸⦹⦺⦻⦼⦽⦾⦿⧀⧁⧂⧃⧄⧅⧆⧇⧈⧉⧊⧋⧌⧍⧎⧏⧐⧑⧒⧓⧔⧕⧖⧗⧘⧙⧚⧛⧜⧝⧞⧟"
         ar_s<<"⧠⧡⧢⧣⧤⧥⧦⧧⧨⧩⧪⧫⧬⧭⧮⧯⧰⧱⧲⧳⧴⧵⧶⧷⧸⧹⧺⧻⧼⧽⧾⧿℀℁ℂ℃℄℅℆ℇ℈℉ℊℋℌℍℎℏ"
         ar_s<<"ℐℑℒℓ℔ℕ№℗℘ℙℚℛℜℝ℞℟℠℡™℣ℤ℥Ω℧ℨ℩KÅℬℭ℮ℯℰℱℲℳℴℵℶℷℸℹ℺℻ℼℽℾℿ"
         ar_s<<"⅀⅁⅂⅃⅄ⅅⅆⅇⅈⅉ⅊⅋⅌⅍ⅎ⅏■□▢▣▤▥▦▧▨▩▪▫▬▭▮▯▰▱▲△▴▵▶▷▸▹►▻▼▽▾▿"
         ar_s<<"◀◁◂◃◄◅◆◇◈◉◊○◌◍◎●◐◑◒◓◔◕◖◗◘◙◚◛◜◝◞◟◠◡◢◣◤◥◦◧◨◩◪◫◬◭◮◯"
         ar_s<<"◰◱◲◳◴◵◶◷◸◹◺◻◼◽◾◿⬀⬁⬂⬃⬄⬅⬆⬇⬈⬉⬊⬋⬌⬍⬎⬏⬐⬑⬒⬓⬔⬕⬖⬗⬘⬙⬚⬛⬜⬝⬞⬟"
         ar_s<<"⬠⬡⬢⬣⬤⬥⬦⬧⬨⬩⬪⬫⬬⬭⬮⬯⬰⬱⬲⬳⬴⬵⬶⬷⬸⬹⬺⬻⬼⬽⬾⬿𝟐𝟑𝟒𝟓𝟔𝟕𝟖𝟗𝟘𝟙𝟚𝟛𝟜𝟝𝟞𝟟"
         ar_s<<"𝟠𝟡𝟢𝟣𝟤𝟥𝟦𝟧𝟨𝟩𝟪𝟫𝟬𝟭𝟮𝟯𝟰𝟱𝟲𝟳𝟴𝟵𝟶𝟷𝟸𝟹𝟺𝟻𝟼𝟽𝟾𝟿𝚰𝚱𝚲𝚳𝚴𝚵𝚶𝚷𝚸𝚹𝚺𝚻𝚼𝚽𝚾𝚿"
         ar_s<<"𝛀𝛁𝛂𝛃𝛄𝛅𝛆𝛇𝛈𝛉𝛊𝛋𝛌𝛍𝛎𝛏𝛐𝛑𝛒𝛓𝛔𝛕𝛖𝛗𝛘𝛙𝛚𝛛𝛜𝛝𝛞𝛟𝛠𝛡𝛢𝛣𝛤𝛥𝛦𝛧𝛨𝛩𝛪𝛫𝛬𝛭𝛮𝛯"
         ar_s<<"𝛰𝛱𝛲𝛳𝛴𝛵𝛶𝛷𝛸𝛹𝛺𝛻𝛼𝛽𝛾𝛿𝜀𝜁𝜂𝜃𝜄𝜅𝜆𝜇𝜈𝜉𝜊𝜋𝜌𝜍𝜎𝜏𝜐𝜑𝜒𝜓𝜔𝜕𝜖𝜗𝜘𝜙𝜚𝜛𝜜𝜝𝜞𝜟"
         ar_s<<"𝜠𝜡𝜢𝜣𝜤𝜥𝜦𝜧𝜨𝜩𝜪𝜫𝜬𝜭𝜮𝜯𝜰𝜱𝜲𝜳𝜴𝜵𝜶𝜷𝜸𝜹𝜺𝜻𝜼𝜽𝜾𝜿𝝀𝝁𝝂𝝃𝝄𝝅𝝆𝝇𝝈𝝉𝝊𝝋𝝌𝝍𝝎𝝏"
         ar_s<<"𝝐𝝑𝝒𝝓𝝔𝝕𝝖𝝗𝝘𝝙𝝚𝝛𝝜𝝝𝝞𝝟𝝠𝝡𝝢𝝣𝝤𝝥𝝦𝝧𝝨𝝩𝝪𝝫𝝬𝝭𝝮𝝯𝝰𝝱𝝲𝝳𝝴𝝵𝝶𝝷𝝸𝝹𝝺𝝻𝝼𝝽𝝾𝝿"
         ar_s<<"𝞀𝞁𝞂𝞃𝞄𝞅𝞆𝞇𝞈𝞉𝞊𝞋𝞌𝞍𝞎𝞏𝞐𝞑𝞒𝞓𝞔𝞕𝞖𝞗𝞘𝞙𝞚𝞛𝞜𝞝𝞞𝞟𝞠𝞡𝞢𝞣𝞤𝞥𝞦𝞧𝞨𝞩𝞪𝞫𝞬𝞭𝞮𝞯"
         ar_s<<"𝞰𝞱𝞲𝞳𝞴𝞵𝞶𝞷𝞸𝞹𝞺𝞻𝞼𝞽𝞾𝞿𝕠𝕡𝕢𝕣𝕤𝕥𝕦𝕧𝕨𝕩𝕪𝕫𝕬𝕭𝕮𝕯𝕰𝕱𝕲𝕳𝕴𝕵𝕶𝕷𝕸𝕹𝕺𝕻𝕼𝕽𝕾𝕿"
         ar_s<<"𝖀𝖁𝖂𝖃𝖄𝖅𝖆𝖇𝖈𝖉𝖊𝖋𝖌𝖍𝖎𝖏"
         ar_s<<"⭀⭁⭂⭃⭄⭅⭆⭇⭈⭉⭊⭋⭌⭐⭑⭒⭓⭔⭕⭖⭗⭘⭙𝔀𝔁𝔂𝔃𝔄𝔅𝔇𝔈𝔉𝔊𝔍𝔎𝔏"
         ar_s<<"𝔐𝔑𝔒𝔓𝔔𝔖𝔗𝔘𝔙𝔚𝔛𝔜𝔞𝔟𝟀𝟁𝟂𝟃𝟄𝟅𝟆𝟇𝟈𝟉𝟊𝟋𝟎𝟏"
         s_0=kibuvits_s_concat_array_of_strings(ar_s).upcase
         s_1=s_0.downcase
         ar_chars_raw=ar_chars_raw+(s_0+s_1).scan(rgx)
         #------------------------
         ar_s.clear
         ar_s<<"𓀀𓀁𓀂𓀃𓀄𓀅𓀆𓀇𓀈𓀉𓀊𓀋𓀌𓀍𓀎𓀏𓀐𓀑𓀒𓀓𓀔𓀕𓀖𓀗𓀘𓀙𓀚𓀛𓀜𓀝𓀞𓀟𓀠𓀡𓀢𓀣𓀤𓀥𓀦𓀧𓀨𓀩𓀪𓀫𓀬𓀭𓀮𓀯"
         ar_s<<"𓀰𓀱𓀲𓀳𓀴𓀵𓀶𓀷𓀸𓀹𓀺𓀻𓀼𓀽𓀾𓀿𓁀𓁁𓁂𓁃𓁄𓁅𓁆𓁇𓁈𓁉𓁊𓁋𓁌𓁍𓁎𓁏𓁐𓁑𓁒𓁓𓁔𓁕𓁖𓁗𓁘𓁙𓁚𓁛𓁜𓁝𓁞𓁟"
         ar_s<<"𓁠𓁡𓁢𓁣𓁤𓁥𓁦𓁧𓁨𓁩𓁪𓁫𓁬𓁭𓁮𓁯𓁰𓁱𓁲𓁳𓁴𓁵𓁶𓁷𓁸𓁹𓁺𓁻𓁼𓁽𓁾𓁿𓂀𓂁𓂂𓂃𓂄𓂅𓂆𓂇𓂈𓂉𓂊𓂋𓂌𓂍𓂎𓂏"
         ar_s<<"𓂐𓂑𓂒𓂓𓂔𓂕𓂖𓂗𓂘𓂙𓂚𓂛𓂜𓂝𓂞𓂟𓂠𓂡𓂢𓂣𓂤𓂥𓂦𓂧𓂨𓂩𓂪𓂫𓂬𓂭𓂮𓂯𓂰𓂱𓂲𓂳𓂴𓂵𓂶𓂷𓂸𓂹𓂺𓂻𓂼𓂽𓂾𓂿"
         ar_s<<"𓃀𓃁𓃂𓃃𓃄𓃅𓃆𓃇𓃈𓃉𓃊𓃋𓃌𓃍𓃎𓃏𓃐𓃑𓃒𓃓𓃔𓃕𓃖𓃗𓃘𓃙𓃚𓃛𓃜𓃝𓃞𓃟𓃠𓃡𓃢𓃣𓃤𓃥𓃦𓃧𓃨𓃩𓃪𓃫𓃬𓃭𓃮𓃯"
         ar_s<<"𓃰𓃱𓃲𓃳𓃴𓃵𓃶𓃷𓃸𓃹𓃺𓃻𓃼𓃽𓃾𓃿𓄀𓄁𓄂𓄃𓄄𓄅𓄆𓄇𓄈𓄉𓄊𓄋𓄌𓄍𓄎𓄏𓄐𓄑𓄒𓄓𓄔𓄕𓄖𓄗𓄘𓄙𓄚𓄛𓄜𓄝𓄞𓄟"
         ar_s<<"𓄠𓄡𓄢𓄣𓄤𓄥𓄦𓄧𓄨𓄩𓄪𓄫𓄬𓄭𓄮𓄯𓄰𓄱𓄲𓄳𓄴𓄵𓄶𓄷𓄸𓄹𓄺𓄻𓄼𓄽𓄾𓄿𓅀𓅁𓅂𓅃𓅄𓅅𓅆𓅇𓅈𓅉𓅊𓅋𓅌𓅍𓅎𓅏"
         ar_s<<"𓅐𓅑𓅒𓅓𓅔𓅕𓅖𓅗𓅘𓅙𓅚𓅛𓅜𓅝𓅞𓅟𓅠𓅡𓅢𓅣𓅤𓅥𓅦𓅧𓅨𓅩𓅪𓅫𓅬𓅭𓅮𓅯𓅰𓅱𓅲𓅳𓅴𓅵𓅶𓅷𓅸𓅹𓅺𓅻𓅼𓅽𓅾𓅿"
         ar_s<<"𓆀𓆁𓆂𓆃𓆄𓆅𓆆𓆇𓆈𓆉𓆊𓆋𓆌𓆍𓆎𓆏𓆐𓆑𓆒𓆓𓆔𓆕𓆖𓆗𓆘𓆙𓆚𓆛𓆜𓆝𓆞𓆟𓆠𓆡𓆢𓆣𓆤𓆥𓆦𓆧𓆨𓆩𓆪𓆫𓆬𓆭𓆮𓆯"
         ar_s<<"𓆰𓆱𓆲𓆳𓆴𓆵𓆶𓆷𓆸𓆹𓆺𓆻𓆼𓆽𓆾𓆿𓇀𓇁𓇂𓇃𓇄𓇅𓇆𓇇𓇈𓇉𓇊𓇋𓇌𓇍𓇎𓇏𓇐𓇑𓇒𓇓𓇔𓇕𓇖𓇗𓇘𓇙𓇚𓇛𓇜𓇝𓇞𓇟"
         ar_s<<"𓇠𓇡𓇢𓇣𓇤𓇥𓇦𓇧𓇨𓇩𓇪𓇫𓇬𓇭𓇮𓇯𓇰𓇱𓇲𓇳𓇴𓇵𓇶𓇷𓇸𓇹𓇺𓇻𓇼𓇽𓇾𓇿𓈀𓈁𓈂𓈃𓈄𓈅𓈆𓈇𓈈𓈉𓈊𓈋𓈌𓈍𓈎𓈏"
         ar_s<<"𓈐𓈑𓈒𓈓𓈔𓈕𓈖𓈗𓈘𓈙𓈚𓈛𓈜𓈝𓈞𓈟𓈠𓈡𓈢𓈣𓈤𓈥𓈦𓈧𓈨𓈩𓈪𓈫𓈬𓈭𓈮𓈯𓈰𓈱𓈲𓈳𓈴𓈵𓈶𓈷𓈸𓈹𓈺𓈻𓈼𓈽𓈾𓈿"
         ar_s<<"𓉀𓉁𓉂𓉃𓉄𓉅𓉆𓉇𓉈𓉉𓉊𓉋𓉌𓉍𓉎𓉏𓉐𓉑𓉒𓉓𓉔𓉕𓉖𓉗𓉘𓉙𓉚𓉛𓉜𓉝𓉞𓉟𓉠𓉡𓉢𓉣𓉤𓉥𓉦𓉧𓉨𓉩𓉪𓉫𓉬𓉭𓉮𓉯"
         ar_s<<"𓉰𓉱𓉲𓉳𓉴𓉵𓉶𓉷𓉸𓉹𓉺𓉻𓉼𓉽𓉾𓉿𓊀𓊁𓊂𓊃𓊄𓊅𓊆𓊇𓊈𓊉𓊊𓊋𓊌𓊍𓊎𓊏𓊐𓊑𓊒𓊓𓊔𓊕𓊖𓊗𓊘𓊙𓊚𓊛𓊜𓊝𓊞𓊟"
         ar_s<<"𓊠𓊡𓊢𓊣𓊤𓊥𓊦𓊧𓊨𓊩𓊪𓊫𓊬𓊭𓊮𓊯𓊰𓊱𓊲𓊳𓊴𓊵𓊶𓊷𓊸𓊹𓊺𓊻𓊼𓊽𓊾𓊿𓋀𓋁𓋂𓋃𓋄𓋅𓋆𓋇𓋈𓋉𓋊𓋋𓋌𓋍𓋎𓋏"
         ar_s<<"𓋐𓋑𓋒𓋓𓋔𓋕𓋖𓋗𓋘𓋙𓋚𓋛𓋜𓋝𓋞𓋟𓋠𓋡𓋢𓋣𓋤𓋥𓋦𓋧𓋨𓋩𓋪𓋫𓋬𓋭𓋮𓋯𓋰𓋱𓋲𓋳𓋴𓋵𓋶𓋷𓋸𓋹𓋺𓋻𓋼𓋽𓋾𓋿"
         ar_s<<"𓌀𓌁𓌂𓌃𓌄𓌅𓌆𓌇𓌈𓌉𓌊𓌋𓌌𓌍𓌎𓌏𓌐𓌑𓌒𓌓𓌔𓌕𓌖𓌗𓌘𓌙𓌚𓌛𓌜𓌝𓌞𓌟𓌠𓌡𓌢𓌣𓌤𓌥𓌦𓌧𓌨𓌩𓌪𓌫𓌬𓌭𓌮𓌯"
         ar_s<<"𓌰𓌱𓌲𓌳𓌴𓌵𓌶𓌷𓌸𓌹𓌺𓌻𓌼𓌽𓌾𓌿𓍀𓍁𓍂𓍃𓍄𓍅𓍆𓍇𓍈𓍉𓍊𓍋𓍌𓍍𓍎𓍏𓍐𓍑𓍒𓍓𓍔𓍕𓍖𓍗𓍘𓍙𓍚𓍛𓍜𓍝𓍞𓍟"
         ar_s<<"𓍠𓍡𓍢𓍣𓍤𓍥𓍦𓍧𓍨𓍩𓍪𓍫𓍬𓍭𓍮𓍯𓍰𓍱𓍲𓍳𓍴𓍵𓍶𓍷𓍸𓍹𓍺𓍻𓍼𓍽𓍾𓍿𓎀𓎁𓎂𓎃𓎄𓎅𓎆𓎇𓎈𓎉𓎊𓎋𓎌𓎍𓎎𓎏"
         ar_s<<"𓎐𓎑𓎒𓎓𓎔𓎕𓎖𓎗𓎘𓎙𓎚𓎛𓎜𓎝𓎞𓎟𓎠𓎡𓎢𓎣𓎤𓎥𓎦𓎧𓎨𓎩𓎪𓎫𓎬𓎭𓎮𓎯𓎰𓎱𓎲𓎳𓎴𓎵𓎶𓎷𓎸𓎹𓎺𓎻𓎼𓎽𓎾𓎿"
         ar_s<<"𓏀𓏁𓏂𓏃𓏄𓏅𓏆𓏇𓏈𓏉𓏊𓏋𓏌𓏍𓏎𓏏𓏐𓏑𓏒𓏓𓏔𓏕𓏖𓏗𓏘𓏙𓏚𓏛𓏜𓏝𓏞𓏟𓏠𓏡𓏢𓏣𓏤𓏥𓏦𓏧𓏨𓏩𓏪𓏫𓏬𓏭𓏮𓏯"
         ar_s<<"𓏰𓏱𓏲𓏳𓏴𓏵𓏶𓏷𓏸𓏹𓏺𓏻𓏼𓏽𓏾𓏿𓐀𓐁𓐂𓐃𓐄𓐅𓐆𓐇𓐈𓐉𓐊𓐋𓐌𓐍𓐎𓐏𓐐𓐑𓐒𓐓𓐔𓐕𓐖𓐗𓐘𓐙𓐚𓐛𓐜𓐝𓐞𓐟"
         ar_s<<"𓐠 𓐡𓐢𓐣𓐤𓐥𓐦𓐧𓐨𓐩𓐪𓐫𓐬𓐭𓐮"
         s_0=kibuvits_s_concat_array_of_strings(ar_s).upcase
         s_1=s_0.downcase
         ar_chars_raw=ar_chars_raw+(s_0+s_1).scan(rgx)
         #------------------------
         ar_s.clear
         # The Hebrew alphabet is incomplete, because the Vim,
         # the text editor, was not able to display some of the characters.
         s_0="אבגדהוזחטיךכלםמןנסעףפץצקרשתװױײ׳״".downcase
         s_0=kibuvits_s_concat_array_of_strings(ar_s).upcase
         s_1=s_0.downcase
         ar_chars_raw=ar_chars_raw+(s_0+s_1).scan(rgx)
         #------------------------
         ar_s.clear
         # The Arabic alphabet is incomplete, because the Vim,
         # the text editor, was not able to display some of the characters.
         ar_s<<"ؠءآأؤإئابةتثجحخدذرزسشصضطظعغػؼؽؾؿ٠١٢٣٤٥٦٧٨٩٪٫٬٭ٮٯ"
         ar_s<<"ڀځڂڃڄڅچڇڈډڊڋڌڍڎڏڐڑڒړڔڕږڗژڙښڛڜڝڞڟڠڡڢڣڤڥڦڧڨکڪګڬڭڮگ"
         ar_s<<"ڰڱڲڳڴڵڶڷڸڹںڻڼڽھڿۀہۂۃۄۅۆۇۈۉۊۋیۍێۏ۰۱۲۳۴۵۶۷۸۹ۺۻۼ۽۾ۿ"
         ar_s<<"ݐݑݒݓݔݕݖݗݘݙݚݛݜݝݞݟݠݡݢݣݤݥݦݧݨݩݪݫݬݭݮݯݰݱݲݳݴݵݶݷݸݹݺݻݼݽݾݿ"
         ar_s<<"ﭐﭑﭒﭓﭔﭕﭖﭗﭘﭙﭚﭛﭜﭝﭞﭟﭠﭡﭢﭣﭤﭥﭦﭧﭨﭩﭪﭫﭬﭭﭮﭯﭰﭱﭲﭳﭴﭵﭶﭷﭸﭹﭺﭻﭼﭽﭾﭿ"
         ar_s<<"ﮀﮁﮂﮃﮄﮅﮆﮇﮈﮉﮊﮋﮌﮍﮎﮏﮐﮑﮒﮓﮔﮕﮖﮗﮘﮙﮚﮛﮜﮝﮞﮟﮠﮡﮢﮣﮤﮥﮦﮧﮨﮩﮪﮫﮬﮭﮮﮯ"
         ar_s<<"ﮰﮱ﮲﮳﮴﮵﮶﮷﮸﮹﮺﮻﮼﮽﮾﮿ﯠﯡﯢﯣﯤﯥﯦﯧﯨﯩﯪﯫﯬﯭﯮﯯﯰﯱﯲﯳﯴﯵﯶﯷﯸﯹﯺﯻﯼﯽﯾﯿ"
         ar_s<<"ﰀﰁﰂﰃﰄﰅﰆﰇﰈﰉﰊﰋﰌﰍﰎﰏﰐﰑﰒﰓﰔﰕﰖﰗﰘﰙﰚﰛﰜﰝﰞﰟﰠﰡﰢﰣﰤﰥﰦﰧﰨﰩﰪﰫﰬﰭﰮﰯ"
         ar_s<<"ﰰﰱﰲﰳﰴﰵﰶﰷﰸﰹﰺﰻﰼﰽﰾﰿﱀﱁﱂﱃﱄﱅﱆﱇﱈﱉﱊﱋﱌﱍﱎﱏﱐﱑﱒﱓﱔﱕﱖﱗﱘﱙﱚﱛﱜﱝﱞﱟ"
         ar_s<<"ﱠﱡﱢﱣﱤﱥﱦﱧﱨﱩﱪﱫﱬﱭﱮﱯﱰﱱﱲﱳﱴﱵﱶﱷﱸﱹﱺﱻﱼﱽﱾﱿﲀﲁﲂﲃﲄﲅﲆﲇﲈﲉﲊﲋﲌﲍﲎﲏ"
         ar_s<<"ﲐﲑﲒﲓﲔﲕﲖﲗﲘﲙﲚﲛﲜﲝﲞﲟﲠﲡﲢﲣﲤﲥﲦﲧﲨﲩﲪﲫﲬﲭﲮﲯﲰﲱﲲﲳﲴﲵﲶﲷﲸﲹﲺﲻﲼﲽﲾﲿ"
         ar_s<<"ﳀﳁﳂﳃﳄﳅﳆﳇﳈﳉﳊﳋﳌﳍﳎﳏﳐﳑﳒﳓﳔﳕﳖﳗﳘﳙﳚﳛﳜﳝﳞﳟﳠﳡﳢﳣﳤﳥﳦﳧﳨﳩﳪﳫﳬﳭﳮﳯ"
         ar_s<<"ﳰﳱﳲﳳﳴﳵﳶﳷﳸﳹﳺﳻﳼﳽﳾﳿﴀﴁﴂﴃﴄﴅﴆﴇﴈﴉﴊﴋﴌﴍﴎﴏﴐﴑﴒﴓﴔﴕﴖﴗﴘﴙﴚﴛﴜﴝﴞﴟ"
         ar_s<<"ﴠﴡﴢﴣﴤﴥﴦﴧﴨﴩﴪﴫﴬﴭﴮﴯﴰﴱﴲﴳﴴﴵﴶﴷﴸﴹﴺﴻﴼﴽ﴾﴿ﵐﵑﵒﵓﵔﵕﵖﵗﵘﵙﵚﵛﵜﵝﵞﵟ"
         ar_s<<"ﵠﵡﵢﵣﵤﵥﵦﵧﵨﵩﵪﵫﵬﵭﵮﵯﵰﵱﵲﵳﵴﵵﵶﵷﵸﵹﵺﵻﵼﵽﵾﵿﶀﶁﶂﶃﶄﶅﶆﶇﶈﶉﶊﶋﶌﶍﶎﶏ"
         ar_s<<"ﶠﶡﶢﶣﶤﶥﶦﶧﶨﶩﶪﶫﶬﶭﶮﶯﶰﶱﶲﶳﶴﶵﶶﶷﶸﶹﶺﶻﶼﶽﶾﶿ"
         ar_s<<"ـفقكلمنهوىيۥۦ۩ۮۯېۑےۓ۔ە؇؈؉؊؋،؍؎؏؛؞؟"
         ar_s<<"ٱٲٳٴٵٶٷٸٹٺٻټٽپٿ﯀﯁ﯓﯔﯕﯖﯗﯘﯙﯚﯛﯜﯝﯞﯟﶒﶓﶔﶕﶖﶗﶘﶙﶚﶛﶜﶝﶞﶟ"
         ar_s<<"ﷀﷁﷂﷃﷄﷅﷆﷰﷱﷲﷳﷴﷵﷶ ﷸ ﷺﷻ"
         s_0=kibuvits_s_concat_array_of_strings(ar_s).upcase
         s_1=s_0.downcase
         ar_chars_raw=ar_chars_raw+(s_0+s_1).scan(rgx)
         #------------------------
         ar_s.clear
         # Copy-pasted from
         # http://www.rikai.com/library/kanjitables/kanji_codes.unicode.shtml
         #
         # The Japanese alphabet is incomplete, because the Vim,
         # and the KomodoEdit were not able to display some of the characters.
         #
         ar_s<<"＆？｀|{}～｟｠｡｢｣､･ｦｧｨｩｪｫｬｭｮｯ"
         ar_s<<"ｰｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏ"
         ar_s<<"ﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜﾝﾞﾟﾡﾢﾣﾤﾥﾦﾧﾨﾩﾪﾫﾬﾭﾮﾯ"
         ar_s<<"ﾰﾱﾲﾳﾴﾵﾶﾷﾸﾹﾺﾻﾼﾽﾾￂￃￄￅￆￇￊￋￌￍￎￏ"
         ar_s<<"ￒￓￔￕￖￗￚￛￜ￠￡￢￣￤￥￦￨￩￪￫￬￭￮"
         #------------
         # The code that was used for semiautomatic formatting:
         # s_fp_in=ENV["HOME"]+"/tmp/andmed.txt"
         # s_fp_out=ENV["HOME"]+"/tmp/jama.txt"
         # s_orig=file2str(s_fp_in).downcase
         # s_0=s_orig.gsub(/[\s\r\n\t\dabcdef]/,"")
         # ar_chars=s_0.scan(/./).uniq
         # ar_s=Array.new
         # s_lc_row_start=" ar_s<<\""
         # s_lc_row_end="\"\n"
         # i_column_max=20-1
         # i_0=0
         # ar_chars.each do |s_char|
         #    ar_s<<s_lc_row_start if i_0==0
         #    ar_s<<s_char
         #    i_0=i_0+1
         #    if i_column_max<i_0
         #       i_0=0
         #       ar_s<<s_lc_row_end
         #    end # if
         # end # loop
         # ar_s<<s_lc_row_end if i_0!=0
         # s_out=kibuvits_s_concat_array_of_strings(ar_s)
         # str2file(s_out,s_fp_out)
         #-----semiautomatically--formatted-block--start
         ar_s<<"一丁丂七丄丅丆万丈三上下丌不与丏丐丑丒专"
         ar_s<<"且丕世丗丘丙业丛东丝丞丟丠両丢丣两严並丧"
         ar_s<<"丨丩个丫丬中丮丯丰丱串丳临丵丶丷丸丹为主"
         ar_s<<"丼丽举丿乀乁乂乃乄久乆乇么义乊之乌乍乎乏"
         ar_s<<"乐乑乒乓乔乕乖乗乘乙乚乛乜九乞也习乡乢乣"
         ar_s<<"乤乥书乧乨乩乪乫乬乭乮乯买乱乲乳乴乵乶乷"
         ar_s<<"乸乹乺乻乼乽乾乿亀亁亂亃亄亅了亇予争亊事"
         ar_s<<"二亍于亏亐云互亓五井亖亗亘亙亚些亜亝亞亟"
         ar_s<<"亠亡亢亣交亥亦产亨亩亪享京亭亮亯亰亱亲亳"
         ar_s<<"亴亵亶亷亸亹人亻亼亽亾亿什仁仂仃仄仅仆仇"
         ar_s<<"仈仉今介仌仍从仏仐仑仒仓仔仕他仗付仙仚仛"
         ar_s<<"仜仝仞仟仠仡仢代令以仦仧仨仩仪仫们仭仮仯"
         ar_s<<"仰仱仲仳仴仵件价仸仹仺任仼份仾仿伀企伂伃"
         ar_s<<"伄伅伆伇伈伉伊伋伌伍伎伏伐休伒伓伔伕伖众"
         ar_s<<"优伙会伛伜伝伞伟传伡伢伣伤伥伦伧伨伩伪伫"
         ar_s<<"伬伭伮伯估伱伲伳伴伵伶伷伸伹伺伻似伽伾伿"
         ar_s<<"佀佁佂佃佄佅但佇佈佉佊佋佌位低住佐佑佒体"
         ar_s<<"佔何佖佗佘余佚佛作佝佞佟你佡佢佣佤佥佦佧"
         ar_s<<"佨佩佪佫佬佭佮佯佰佱佲佳佴併佶佷佸佹佺佻"
         ar_s<<"佼佽佾使侀侁侂侃侄侅來侇侈侉侊例侌侍侎侏"
         ar_s<<"侐侑侒侓侔侕侖侗侘侙侚供侜依侞侟侠価侢侣"
         ar_s<<"侤侥侦侧侨侩侪侫侬侭侮侯侰侱侲侳侴侵侶侷"
         ar_s<<"侸侹侺侻侼侽侾便俀俁係促俄俅俆俇俈俉俊俋"
         ar_s<<"俌俍俎俏俐俑俒俓俔俕俖俗俘俙俚俛俜保俞俟"
         ar_s<<"俠信俢俣俤俥俦俧俨俩俪俫俬俭修俯俰俱俲俳"
         ar_s<<"俴俵俶俷俸俹俺俻俼俽俾俿倀倁倂倃倄倅倆倇"
         ar_s<<"倈倉倊個倌倍倎倏倐們倒倓倔倕倖倗倘候倚倛"
         ar_s<<"倜倝倞借倠倡倢倣値倥倦倧倨倩倪倫倬倭倮倯"
         ar_s<<"倰倱倲倳倴倵倶倷倸倹债倻值倽倾倿偀偁偂偃"
         ar_s<<"偄偅偆假偈偉偊偋偌偍偎偏偐偑偒偓偔偕偖偗"
         ar_s<<"偘偙做偛停偝偞偟偠偡偢偣偤健偦偧偨偩偪偫"
         ar_s<<"偬偭偮偯偰偱偲偳側偵偶偷偸偹偺偻偼偽偾偿"
         ar_s<<"傀傁傂傃傄傅傆傇傈傉傊傋傌傍傎傏傐傑傒傓"
         ar_s<<"傔傕傖傗傘備傚傛傜傝傞傟傠傡傢傣傤傥傦傧"
         ar_s<<"储傩傪傫催傭傮傯傰傱傲傳傴債傶傷傸傹傺傻"
         ar_s<<"傼傽傾傿僀僁僂僃僄僅僆僇僈僉僊僋僌働僎像"
         ar_s<<"僐僑僒僓僔僕僖僗僘僙僚僛僜僝僞僟僠僡僢僣"
         ar_s<<"僤僥僦僧僨僩僪僫僬僭僮僯僰僱僲僳僴僵僶僷"
         ar_s<<"僸價僺僻僼僽僾僿儀儁儂儃億儅儆儇儈儉儊儋"
         ar_s<<"儌儍儎儏儐儑儒儓儔儕儖儗儘儙儚儛儜儝儞償"
         ar_s<<"儠儡儢儣儤儥儦儧儨儩優儫儬儭儮儯儰儱儲儳"
         ar_s<<"儴儵儶儷儸儹儺儻儼儽儾儿兀允兂元兄充兆兇"
         ar_s<<"先光兊克兌免兎兏児兑兒兓兔兕兖兗兘兙党兛"
         ar_s<<"兜兝兞兟兠兡兢兣兤入兦內全兩兪八公六兮兯"
         ar_s<<"兰共兲关兴兵其具典兹兺养兼兽兾兿冀冁冂冃"
         ar_s<<"冄内円冇冈冉冊冋册再冎冏冐冑冒冓冔冕冖冗"
         ar_s<<"冘写冚军农冝冞冟冠冡冢冣冤冥冦冧冨冩冪冫"
         ar_s<<"冬冭冮冯冰冱冲决冴况冶冷冸冹冺冻冼冽冾冿"
         ar_s<<"净凁凂凃凄凅准凇凈凉凊凋凌凍凎减凐凑凒凓"
         ar_s<<"凔凕凖凗凘凙凚凛凜凝凞凟几凡凢凣凤凥処凧"
         ar_s<<"凨凩凪凫凬凭凮凯凰凱凲凳凴凵凶凷凸凹出击"
         ar_s<<"凼函凾凿刀刁刂刃刄刅分切刈刉刊刋刌刍刎刏"
         ar_s<<"刐刑划刓刔刕刖列刘则刚创刜初刞刟删刡刢刣"
         ar_s<<"判別刦刧刨利刪别刬刭刮刯到刱刲刳刴刵制刷"
         ar_s<<"券刹刺刻刼刽刾刿剀剁剂剃剄剅剆則剈剉削剋"
         ar_s<<"剌前剎剏剐剑剒剓剔剕剖剗剘剙剚剛剜剝剞剟"
         ar_s<<"剠剡剢剣剤剥剦剧剨剩剪剫剬剭剮副剰剱割剳"
         ar_s<<"剴創剶剷剸剹剺剻剼剽剾剿劀劁劂劃劄劅劆劇"
         ar_s<<"劈劉劊劋劌劍劎劏劐劑劒劓劔劕劖劗劘劙劚力"
         ar_s<<"劜劝办功加务劢劣劤劥劦劧动助努劫劬劭劮劯"
         ar_s<<"劰励劲劳労劵劶劷劸効劺劻劼劽劾势勀勁勂勃"
         ar_s<<"勄勅勆勇勈勉勊勋勌勍勎勏勐勑勒勓勔動勖勗"
         ar_s<<"勘務勚勛勜勝勞募勠勡勢勣勤勥勦勧勨勩勪勫"
         ar_s<<"勬勭勮勯勰勱勲勳勴勵勶勷勸勹勺勻勼勽勾勿"
         ar_s<<"匀匁匂匃匄包匆匇匈匉匊匋匌匍匎匏匐匑匒匓"
         ar_s<<"匔匕化北匘匙匚匛匜匝匞匟匠匡匢匣匤匥匦匧"
         ar_s<<"匨匩匪匫匬匭匮匯匰匱匲匳匴匵匶匷匸匹区医"
         ar_s<<"匼匽匾匿區十卂千卄卅卆升午卉半卋卌卍华协"
         ar_s<<"卐卑卒卓協单卖南単卙博卛卜卝卞卟占卡卢卣"
         ar_s<<"卤卥卦卧卨卩卪卫卬卭卮卯印危卲即却卵卶卷"
         ar_s<<"卸卹卺卻卼卽卾卿厀厁厂厃厄厅历厇厈厉厊压"
         ar_s<<"厌厍厎厏厐厑厒厓厔厕厖厗厘厙厚厛厜厝厞原"
         ar_s<<"厠厡厢厣厤厥厦厧厨厩厪厫厬厭厮厯厰厱厲厳"
         ar_s<<"厴厵厶厷厸厹厺去厼厽厾县叀叁参參叄叅叆叇"
         ar_s<<"又叉及友双反収叏叐发叒叓叔叕取受变叙叚叛"
         ar_s<<"叜叝叞叟叠叡叢口古句另叧叨叩只叫召叭叮可"
         ar_s<<"台叱史右叴叵叶号司叹叺叻叼叽叾叿吀吁吂吃"
         ar_s<<"各吅吆吇合吉吊吋同名后吏吐向吒吓吔吕吖吗"
         ar_s<<"吘吙吚君吜吝吞吟吠吡吢吣吤吥否吧吨吩吪含"
         ar_s<<"听吭吮启吰吱吲吳吴吵吶吷吸吹吺吻吼吽吾吿"
         ar_s<<"呀呁呂呃呄呅呆呇呈呉告呋呌呍呎呏呐呑呒呓"
         ar_s<<"呔呕呖呗员呙呚呛呜呝呞呟呠呡呢呣呤呥呦呧"
         ar_s<<"周呩呪呫呬呭呮呯呰呱呲味呴呵呶呷呸呹呺呻"
         ar_s<<"呼命呾呿咀咁咂咃咄咅咆咇咈咉咊咋和咍咎咏"
         ar_s<<"咐咑咒咓咔咕咖咗咘咙咚咛咜咝咞咟咠咡咢咣"
         ar_s<<"咤咥咦咧咨咩咪咫咬咭咮咯咰咱咲咳咴咵咶咷"
         ar_s<<"咸咹咺咻咼咽咾咿哀品哂哃哄哅哆哇哈哉哊哋"
         ar_s<<"哌响哎哏哐哑哒哓哔哕哖哗哘哙哚哛哜哝哞哟"
         ar_s<<"哠員哢哣哤哥哦哧哨哩哪哫哬哭哮哯哰哱哲哳"
         ar_s<<"哴哵哶哷哸哹哺哻哼哽哾哿唀唁唂唃唄唅唆唇"
         ar_s<<"唈唉唊唋唌唍唎唏唐唑唒唓唔唕唖唗唘唙唚唛"
         ar_s<<"唜唝唞唟唠唡唢唣唤唥唦唧唨唩唪唫唬唭售唯"
         ar_s<<"唰唱唲唳唴唵唶唷唸唹唺唻唼唽唾唿啀啁啂啃"
         ar_s<<"啄啅商啇啈啉啊啋啌啍啎問啐啑啒啓啔啕啖啗"
         ar_s<<"啘啙啚啛啜啝啞啟啠啡啢啣啤啥啦啧啨啩啪啫"
         ar_s<<"啬啭啮啯啰啱啲啳啴啵啶啷啸啹啺啻啼啽啾啿"
         ar_s<<"喀喁喂喃善喅喆喇喈喉喊喋喌喍喎喏喐喑喒喓"
         ar_s<<"喔喕喖喗喘喙喚喛喜喝喞喟喠喡喢喣喤喥喦喧"
         ar_s<<"喨喩喪喫喬喭單喯喰喱喲喳喴喵営喷喸喹喺喻"
         ar_s<<"喼喽喾喿嗀嗁嗂嗃嗄嗅嗆嗇嗈嗉嗊嗋嗌嗍嗎嗏"
         ar_s<<"嗐嗑嗒嗓嗔嗕嗖嗗嗘嗙嗚嗛嗜嗝嗞嗟嗠嗡嗢嗣"
         ar_s<<"嗤嗥嗦嗧嗨嗩嗪嗫嗬嗭嗮嗯嗰嗱嗲嗳嗴嗵嗶嗷"
         ar_s<<"嗸嗹嗺嗻嗼嗽嗾嗿嘀嘁嘂嘃嘄嘅嘆嘇嘈嘉嘊嘋"
         ar_s<<"嘌嘍嘎嘏嘐嘑嘒嘓嘔嘕嘖嘗嘘嘙嘚嘛嘜嘝嘞嘟"
         ar_s<<"嘠嘡嘢嘣嘤嘥嘦嘧嘨嘩嘪嘫嘬嘭嘮嘯嘰嘱嘲嘳"
         ar_s<<"嘴嘵嘶嘷嘸嘹嘺嘻嘼嘽嘾嘿噀噁噂噃噄噅噆噇"
         ar_s<<"噈噉噊噋噌噍噎噏噐噑噒噓噔噕噖噗噘噙噚噛"
         ar_s<<"噜噝噞噟噠噡噢噣噤噥噦噧器噩噪噫噬噭噮噯"
         ar_s<<"噰噱噲噳噴噵噶噷噸噹噺噻噼噽噾噿嚀嚁嚂嚃"
         ar_s<<"嚄嚅嚆嚇嚈嚉嚊嚋嚌嚍嚎嚏嚐嚑嚒嚓嚔嚕嚖嚗"
         ar_s<<"嚘嚙嚚嚛嚜嚝嚞嚟嚠嚡嚢嚣嚤嚥嚦嚧嚨嚩嚪嚫"
         ar_s<<"嚬嚭嚮嚯嚰嚱嚲嚳嚴嚵嚶嚷嚸嚹嚺嚻嚼嚽嚾嚿"
         ar_s<<"囀囁囂囃囄囅囆囇囈囉囊囋囌囍囎囏囐囑囒囓"
         ar_s<<"囔囕囖囗囘囙囚四囜囝回囟因囡团団囤囥囦囧"
         ar_s<<"囨囩囪囫囬园囮囯困囱囲図围囵囶囷囸囹固囻"
         ar_s<<"囼国图囿圀圁圂圃圄圅圆圇圈圉圊國圌圍圎圏"
         ar_s<<"圐圑園圓圔圕圖圗團圙圚圛圜圝圞土圠圡圢圣"
         ar_s<<"圤圥圦圧在圩圪圫圬圭圮圯地圱圲圳圴圵圶圷"
         ar_s<<"圸圹场圻圼圽圾圿址坁坂坃坄坅坆均坈坉坊坋"
         ar_s<<"坌坍坎坏坐坑坒坓坔坕坖块坘坙坚坛坜坝坞坟"
         ar_s<<"坠坡坢坣坤坥坦坧坨坩坪坫坬坭坮坯坰坱坲坳"
         ar_s<<"坴坵坶坷坸坹坺坻坼坽坾坿垀垁垂垃垄垅垆垇"
         ar_s<<"垈垉垊型垌垍垎垏垐垑垒垓垔垕垖垗垘垙垚垛"
         ar_s<<"垜垝垞垟垠垡垢垣垤垥垦垧垨垩垪垫垬垭垮垯"
         ar_s<<"垰垱垲垳垴垵垶垷垸垹垺垻垼垽垾垿埀埁埂埃"
         ar_s<<"埄埅埆埇埈埉埊埋埌埍城埏埐埑埒埓埔埕埖埗"
         ar_s<<"埘埙埚埛埜埝埞域埠埡埢埣埤埥埦埧埨埩埪埫"
         ar_s<<"埬埭埮埯埰埱埲埳埴埵埶執埸培基埻埼埽埾埿"
         ar_s<<"堀堁堂堃堄堅堆堇堈堉堊堋堌堍堎堏堐堑堒堓"
         ar_s<<"堔堕堖堗堘堙堚堛堜堝堞堟堠堡堢堣堤堥堦堧"
         ar_s<<"堨堩堪堫堬堭堮堯堰報堲堳場堵堶堷堸堹堺堻"
         ar_s<<"堼堽堾堿塀塁塂塃塄塅塆塇塈塉塊塋塌塍塎塏"
         ar_s<<"塐塑塒塓塔塕塖塗塘塙塚塛塜塝塞塟塠塡塢塣"
         ar_s<<"塤塥塦塧塨塩塪填塬塭塮塯塰塱塲塳塴塵塶塷"
         ar_s<<"塸塹塺塻塼塽塾塿墀墁墂境墄墅墆墇墈墉墊墋"
         ar_s<<"墌墍墎墏墐墑墒墓墔墕墖増墘墙墚墛墜墝增墟"
         ar_s<<"墠墡墢墣墤墥墦墧墨墩墪墫墬墭墮墯墰墱墲墳"
         ar_s<<"墴墵墶墷墸墹墺墻墼墽墾墿壀壁壂壃壄壅壆壇"
         ar_s<<"壈壉壊壋壌壍壎壏壐壑壒壓壔壕壖壗壘壙壚壛"
         ar_s<<"壜壝壞壟壠壡壢壣壤壥壦壧壨壩壪士壬壭壮壯"
         ar_s<<"声壱売壳壴壵壶壷壸壹壺壻壼壽壾壿夀夁夂夃"
         ar_s<<"处夅夆备夈変夊夋夌复夎夏夐夑夒夓夔夕外夗"
         ar_s<<"夘夙多夛夜夝夞够夠夡夢夣夤夥夦大夨天太夫"
         ar_s<<"夬夭央夯夰失夲夳头夵夶夷夸夹夺夻夼夽夾夿"
         ar_s<<"奀奁奂奃奄奅奆奇奈奉奊奋奌奍奎奏奐契奒奓"
         ar_s<<"奔奕奖套奘奙奚奛奜奝奞奟奠奡奢奣奤奥奦奧"
         ar_s<<"奨奩奪奫奬奭奮奯奰奱奲女奴奵奶奷奸她奺奻"
         ar_s<<"奼好奾奿妀妁如妃妄妅妆妇妈妉妊妋妌妍妎妏"
         ar_s<<"妐妑妒妓妔妕妖妗妘妙妚妛妜妝妞妟妠妡妢妣"
         ar_s<<"妤妥妦妧妨妩妪妫妬妭妮妯妰妱妲妳妴妵妶妷"
         ar_s<<"妸妹妺妻妼妽妾妿姀姁姂姃姄姅姆姇姈姉姊始"
         ar_s<<"姌姍姎姏姐姑姒姓委姕姖姗姘姙姚姛姜姝姞姟"
         ar_s<<"姠姡姢姣姤姥姦姧姨姩姪姫姬姭姮姯姰姱姲姳"
         ar_s<<"姴姵姶姷姸姹姺姻姼姽姾姿娀威娂娃娄娅娆娇"
         ar_s<<"娈娉娊娋娌娍娎娏娐娑娒娓娔娕娖娗娘娙娚娛"
         ar_s<<"娜娝娞娟娠娡娢娣娤娥娦娧娨娩娪娫娬娭娮娯"
         ar_s<<"娰娱娲娳娴娵娶娷娸娹娺娻娼娽娾娿婀婁婂婃"
         ar_s<<"婄婅婆婇婈婉婊婋婌婍婎婏婐婑婒婓婔婕婖婗"
         ar_s<<"婘婙婚婛婜婝婞婟婠婡婢婣婤婥婦婧婨婩婪婫"
         ar_s<<"婬婭婮婯婰婱婲婳婴婵婶婷婸婹婺婻婼婽婾婿"
         ar_s<<"媀媁媂媃媄媅媆媇媈媉媊媋媌媍媎媏媐媑媒媓"
         ar_s<<"媔媕媖媗媘媙媚媛媜媝媞媟媠媡媢媣媤媥媦媧"
         ar_s<<"媨媩媪媫媬媭媮媯媰媱媲媳媴媵媶媷媸媹媺媻"
         ar_s<<"媼媽媾媿嫀嫁嫂嫃嫄嫅嫆嫇嫈嫉嫊嫋嫌嫍嫎嫏"
         ar_s<<"嫐嫑嫒嫓嫔嫕嫖嫗嫘嫙嫚嫛嫜嫝嫞嫟嫠嫡嫢嫣"
         ar_s<<"嫤嫥嫦嫧嫨嫩嫪嫫嫬嫭嫮嫯嫰嫱嫲嫳嫴嫵嫶嫷"
         ar_s<<"嫸嫹嫺嫻嫼嫽嫾嫿嬀嬁嬂嬃嬄嬅嬆嬇嬈嬉嬊嬋"
         ar_s<<"嬌嬍嬎嬏嬐嬑嬒嬓嬔嬕嬖嬗嬘嬙嬚嬛嬜嬝嬞嬟"
         ar_s<<"嬠嬡嬢嬣嬤嬥嬦嬧嬨嬩嬪嬫嬬嬭嬮嬯嬰嬱嬲嬳"
         ar_s<<"嬴嬵嬶嬷嬸嬹嬺嬻嬼嬽嬾嬿孀孁孂孃孄孅孆孇"
         ar_s<<"孈孉孊孋孌孍孎孏子孑孒孓孔孕孖字存孙孚孛"
         ar_s<<"孜孝孞孟孠孡孢季孤孥学孧孨孩孪孫孬孭孮孯"
         ar_s<<"孰孱孲孳孴孵孶孷學孹孺孻孼孽孾孿宀宁宂它"
         ar_s<<"宄宅宆宇守安宊宋完宍宎宏宐宑宒宓宔宕宖宗"
         ar_s<<"官宙定宛宜宝实実宠审客宣室宥宦宧宨宩宪宫"
         ar_s<<"宬宭宮宯宰宱宲害宴宵家宷宸容宺宻宼宽宾宿"
         ar_s<<"寀寁寂寃寄寅密寇寈寉寊寋富寍寎寏寐寑寒寓"
         ar_s<<"寔寕寖寗寘寙寚寛寜寝寞察寠寡寢寣寤寥實寧"
         ar_s<<"寨審寪寫寬寭寮寯寰寱寲寳寴寵寶寷寸对寺寻"
         ar_s<<"导寽対寿尀封専尃射尅将將專尉尊尋尌對導小"
         ar_s<<"尐少尒尓尔尕尖尗尘尙尚尛尜尝尞尟尠尡尢尣"
         ar_s<<"尤尥尦尧尨尩尪尫尬尭尮尯尰就尲尳尴尵尶尷"
         ar_s<<"尸尹尺尻尼尽尾尿局屁层屃屄居屆屇屈屉届屋"
         ar_s<<"屌屍屎屏屐屑屒屓屔展屖屗屘屙屚屛屜屝属屟"
         ar_s<<"屠屡屢屣層履屦屧屨屩屪屫屬屭屮屯屰山屲屳"
         ar_s<<"屴屵屶屷屸屹屺屻屼屽屾屿岀岁岂岃岄岅岆岇"
         ar_s<<"岈岉岊岋岌岍岎岏岐岑岒岓岔岕岖岗岘岙岚岛"
         ar_s<<"岜岝岞岟岠岡岢岣岤岥岦岧岨岩岪岫岬岭岮岯"
         ar_s<<"岰岱岲岳岴岵岶岷岸岹岺岻岼岽岾岿峀峁峂峃"
         ar_s<<"峄峅峆峇峈峉峊峋峌峍峎峏峐峑峒峓峔峕峖峗"
         ar_s<<"峘峙峚峛峜峝峞峟峠峡峢峣峤峥峦峧峨峩峪峫"
         ar_s<<"峬峭峮峯峰峱峲峳峴峵島峷峸峹峺峻峼峽峾峿"
         ar_s<<"崀崁崂崃崄崅崆崇崈崉崊崋崌崍崎崏崐崑崒崓"
         ar_s<<"崔崕崖崗崘崙崚崛崜崝崞崟崠崡崢崣崤崥崦崧"
         ar_s<<"崨崩崪崫崬崭崮崯崰崱崲崳崴崵崶崷崸崹崺崻"
         ar_s<<"崼崽崾崿嵀嵁嵂嵃嵄嵅嵆嵇嵈嵉嵊嵋嵌嵍嵎嵏"
         ar_s<<"嵐嵑嵒嵓嵔嵕嵖嵗嵘嵙嵚嵛嵜嵝嵞嵟嵠嵡嵢嵣"
         ar_s<<"嵤嵥嵦嵧嵨嵩嵪嵫嵬嵭嵮嵯嵰嵱嵲嵳嵴嵵嵶嵷"
         ar_s<<"嵸嵹嵺嵻嵼嵽嵾嵿嶀嶁嶂嶃嶄嶅嶆嶇嶈嶉嶊嶋"
         ar_s<<"嶌嶍嶎嶏嶐嶑嶒嶓嶔嶕嶖嶗嶘嶙嶚嶛嶜嶝嶞嶟"
         ar_s<<"嶠嶡嶢嶣嶤嶥嶦嶧嶨嶩嶪嶫嶬嶭嶮嶯嶰嶱嶲嶳"
         ar_s<<"嶴嶵嶶嶷嶸嶹嶺嶻嶼嶽嶾嶿巀巁巂巃巄巅巆巇"
         ar_s<<"巈巉巊巋巌巍巎巏巐巑巒巓巔巕巖巗巘巙巚巛"
         ar_s<<"巜川州巟巠巡巢巣巤工左巧巨巩巪巫巬巭差巯"
         ar_s<<"巰己已巳巴巵巶巷巸巹巺巻巼巽巾巿帀币市布"
         ar_s<<"帄帅帆帇师帉帊帋希帍帎帏帐帑帒帓帔帕帖帗"
         ar_s<<"帘帙帚帛帜帝帞帟帠帡帢帣帤帥带帧帨帩帪師"
         ar_s<<"帬席帮帯帰帱帲帳帴帵帶帷常帹帺帻帼帽帾帿"
         ar_s<<"幀幁幂幃幄幅幆幇幈幉幊幋幌幍幎幏幐幑幒幓"
         ar_s<<"幔幕幖幗幘幙幚幛幜幝幞幟幠幡幢幣幤幥幦幧"
         ar_s<<"幨幩幪幫幬幭幮幯幰幱干平年幵并幷幸幹幺幻"
         ar_s<<"幼幽幾广庀庁庂広庄庅庆庇庈庉床庋庌庍庎序"
         ar_s<<"庐庑庒库应底庖店庘庙庚庛府庝庞废庠庡庢庣"
         ar_s<<"庤庥度座庨庩庪庫庬庭庮庯庰庱庲庳庴庵庶康"
         ar_s<<"庸庹庺庻庼庽庾庿廀廁廂廃廄廅廆廇廈廉廊廋"
         ar_s<<"廌廍廎廏廐廑廒廓廔廕廖廗廘廙廚廛廜廝廞廟"
         ar_s<<"廠廡廢廣廤廥廦廧廨廩廪廫廬廭廮廯廰廱廲廳"
         ar_s<<"廴廵延廷廸廹建廻廼廽廾廿开弁异弃弄弅弆弇"
         ar_s<<"弈弉弊弋弌弍弎式弐弑弒弓弔引弖弗弘弙弚弛"
         ar_s<<"弜弝弞弟张弡弢弣弤弥弦弧弨弩弪弫弬弭弮弯"
         ar_s<<"弰弱弲弳弴張弶強弸弹强弻弼弽弾弿彀彁彂彃"
         ar_s<<"彄彅彆彇彈彉彊彋彌彍彎彏彐彑归当彔录彖彗"
         ar_s<<"彘彙彚彛彜彝彞彟彠彡形彣彤彥彦彧彨彩彪彫"
         ar_s<<"彬彭彮彯彰影彲彳彴彵彶彷彸役彺彻彼彽彾彿"
         ar_s<<"往征徂徃径待徆徇很徉徊律後徍徎徏徐徑徒従"
         ar_s<<"徔徕徖得徘徙徚徛徜徝從徟徠御徢徣徤徥徦徧"
         ar_s<<"徨復循徫徬徭微徯徰徱徲徳徴徵徶德徸徹徺徻"
         ar_s<<"徼徽徾徿忀忁忂心忄必忆忇忈忉忊忋忌忍忎忏"
         ar_s<<"忐忑忒忓忔忕忖志忘忙忚忛応忝忞忟忠忡忢忣"
         ar_s<<"忤忥忦忧忨忩忪快忬忭忮忯忰忱忲忳忴念忶忷"
         ar_s<<"忸忹忺忻忼忽忾忿怀态怂怃怄怅怆怇怈怉怊怋"
         ar_s<<"怌怍怎怏怐怑怒怓怔怕怖怗怘怙怚怛怜思怞怟"
         ar_s<<"怠怡怢怣怤急怦性怨怩怪怫怬怭怮怯怰怱怲怳"
         ar_s<<"怴怵怶怷怸怹怺总怼怽怾怿恀恁恂恃恄恅恆恇"
         ar_s<<"恈恉恊恋恌恍恎恏恐恑恒恓恔恕恖恗恘恙恚恛"
         ar_s<<"恜恝恞恟恠恡恢恣恤恥恦恧恨恩恪恫恬恭恮息"
         ar_s<<"恰恱恲恳恴恵恶恷恸恹恺恻恼恽恾恿悀悁悂悃"
         ar_s<<"悄悅悆悇悈悉悊悋悌悍悎悏悐悑悒悓悔悕悖悗"
         ar_s<<"悘悙悚悛悜悝悞悟悠悡悢患悤悥悦悧您悩悪悫"
         ar_s<<"悬悭悮悯悰悱悲悳悴悵悶悷悸悹悺悻悼悽悾悿"
         ar_s<<"惀惁惂惃惄情惆惇惈惉惊惋惌惍惎惏惐惑惒惓"
         ar_s<<"惔惕惖惗惘惙惚惛惜惝惞惟惠惡惢惣惤惥惦惧"
         ar_s<<"惨惩惪惫惬惭惮惯惰惱惲想惴惵惶惷惸惹惺惻"
         ar_s<<"惼惽惾惿愀愁愂愃愄愅愆愇愈愉愊愋愌愍愎意"
         ar_s<<"愐愑愒愓愔愕愖愗愘愙愚愛愜愝愞感愠愡愢愣"
         ar_s<<"愤愥愦愧愨愩愪愫愬愭愮愯愰愱愲愳愴愵愶愷"
         ar_s<<"愸愹愺愻愼愽愾愿慀慁慂慃慄慅慆慇慈慉慊態"
         ar_s<<"慌慍慎慏慐慑慒慓慔慕慖慗慘慙慚慛慜慝慞慟"
         ar_s<<"慠慡慢慣慤慥慦慧慨慩慪慫慬慭慮慯慰慱慲慳"
         ar_s<<"慴慵慶慷慸慹慺慻慼慽慾慿憀憁憂憃憄憅憆憇"
         ar_s<<"憈憉憊憋憌憍憎憏憐憑憒憓憔憕憖憗憘憙憚憛"
         ar_s<<"憜憝憞憟憠憡憢憣憤憥憦憧憨憩憪憫憬憭憮憯"
         ar_s<<"憰憱憲憳憴憵憶憷憸憹憺憻憼憽憾憿懀懁懂懃"
         ar_s<<"懄懅懆懇懈應懊懋懌懍懎懏懐懑懒懓懔懕懖懗"
         ar_s<<"懘懙懚懛懜懝懞懟懠懡懢懣懤懥懦懧懨懩懪懫"
         ar_s<<"懬懭懮懯懰懱懲懳懴懵懶懷懸懹懺懻懼懽懾懿"
         ar_s<<"戀戁戂戃戄戅戆戇戈戉戊戋戌戍戎戏成我戒戓"
         ar_s<<"戔戕或戗战戙戚戛戜戝戞戟戠戡戢戣戤戥戦戧"
         ar_s<<"戨戩截戫戬戭戮戯戰戱戲戳戴戵戶户戸戹戺戻"
         ar_s<<"戼戽戾房所扁扂扃扄扅扆扇扈扉扊手扌才扎扏"
         ar_s<<"扐扑扒打扔払扖扗托扙扚扛扜扝扞扟扠扡扢扣"
         ar_s<<"扤扥扦执扨扩扪扫扬扭扮扯扰扱扲扳扴扵扶扷"
         ar_s<<"扸批扺扻扼扽找承技抁抂抃抄抅抆抇抈抉把抋"
         ar_s<<"抌抍抎抏抐抑抒抓抔投抖抗折抙抚抛抜抝択抟"
         ar_s<<"抠抡抢抣护报抦抧抨抩抪披抬抭抮抯抰抱抲抳"
         ar_s<<"抴抵抶抷抸抹抺抻押抽抾抿拀拁拂拃拄担拆拇"
         ar_s<<"拈拉拊拋拌拍拎拏拐拑拒拓拔拕拖拗拘拙拚招"
         ar_s<<"拜拝拞拟拠拡拢拣拤拥拦拧拨择拪拫括拭拮拯"
         ar_s<<"拰拱拲拳拴拵拶拷拸拹拺拻拼拽拾拿挀持挂挃"
         ar_s<<"挄挅挆指挈按挊挋挌挍挎挏挐挑挒挓挔挕挖挗"
         ar_s<<"挘挙挚挛挜挝挞挟挠挡挢挣挤挥挦挧挨挩挪挫"
         ar_s<<"挬挭挮振挰挱挲挳挴挵挶挷挸挹挺挻挼挽挾挿"
         ar_s<<"捀捁捂捃捄捅捆捇捈捉捊捋捌捍捎捏捐捑捒捓"
         ar_s<<"捔捕捖捗捘捙捚捛捜捝捞损捠捡换捣捤捥捦捧"
         ar_s<<"捨捩捪捫捬捭据捯捰捱捲捳捴捵捶捷捸捹捺捻"
         ar_s<<"捼捽捾捿掀掁掂掃掄掅掆掇授掉掊掋掌掍掎掏"
         ar_s<<"掐掑排掓掔掕掖掗掘掙掚掛掜掝掞掟掠採探掣"
         ar_s<<"掤接掦控推掩措掫掬掭掮掯掰掱掲掳掴掵掶掷"
         ar_s<<"掸掹掺掻掼掽掾掿揀揁揂揃揄揅揆揇揈揉揊揋"
         ar_s<<"揌揍揎描提揑插揓揔揕揖揗揘揙揚換揜揝揞揟"
         ar_s<<"揠握揢揣揤揥揦揧揨揩揪揫揬揭揮揯揰揱揲揳"
         ar_s<<"援揵揶揷揸揹揺揻揼揽揾揿搀搁搂搃搄搅搆搇"
         ar_s<<"搈搉搊搋搌損搎搏搐搑搒搓搔搕搖搗搘搙搚搛"
         ar_s<<"搜搝搞搟搠搡搢搣搤搥搦搧搨搩搪搫搬搭搮搯"
         ar_s<<"搰搱搲搳搴搵搶搷搸搹携搻搼搽搾搿摀摁摂摃"
         ar_s<<"摄摅摆摇摈摉摊摋摌摍摎摏摐摑摒摓摔摕摖摗"
         ar_s<<"摘摙摚摛摜摝摞摟摠摡摢摣摤摥摦摧摨摩摪摫"
         ar_s<<"摬摭摮摯摰摱摲摳摴摵摶摷摸摹摺摻摼摽摾摿"
         ar_s<<"撀撁撂撃撄撅撆撇撈撉撊撋撌撍撎撏撐撑撒撓"
         ar_s<<"撔撕撖撗撘撙撚撛撜撝撞撟撠撡撢撣撤撥撦撧"
         ar_s<<"撨撩撪撫撬播撮撯撰撱撲撳撴撵撶撷撸撹撺撻"
         ar_s<<"撼撽撾撿擀擁擂擃擄擅擆擇擈擉擊擋擌操擎擏"
         ar_s<<"擐擑擒擓擔擕擖擗擘擙據擛擜擝擞擟擠擡擢擣"
         ar_s<<"擤擥擦擧擨擩擪擫擬擭擮擯擰擱擲擳擴擵擶擷"
         ar_s<<"擸擹擺擻擼擽擾擿攀攁攂攃攄攅攆攇攈攉攊攋"
         ar_s<<"攌攍攎攏攐攑攒攓攔攕攖攗攘攙攚攛攜攝攞攟"
         ar_s<<"攠攡攢攣攤攥攦攧攨攩攪攫攬攭攮支攰攱攲攳"
         ar_s<<"攴攵收攷攸改攺攻攼攽放政敀敁敂敃敄故敆敇"
         ar_s<<"效敉敊敋敌敍敎敏敐救敒敓敔敕敖敗敘教敚敛"
         ar_s<<"敜敝敞敟敠敡敢散敤敥敦敧敨敩敪敫敬敭敮敯"
         ar_s<<"数敱敲敳整敵敶敷數敹敺敻敼敽敾敿斀斁斂斃"
         ar_s<<"斄斅斆文斈斉斊斋斌斍斎斏斐斑斒斓斔斕斖斗"
         ar_s<<"斘料斚斛斜斝斞斟斠斡斢斣斤斥斦斧斨斩斪斫"
         ar_s<<"斬断斮斯新斱斲斳斴斵斶斷斸方斺斻於施斾斿"
         ar_s<<"旀旁旂旃旄旅旆旇旈旉旊旋旌旍旎族旐旑旒旓"
         ar_s<<"旔旕旖旗旘旙旚旛旜旝旞旟无旡既旣旤日旦旧"
         ar_s<<"旨早旪旫旬旭旮旯旰旱旲旳旴旵时旷旸旹旺旻"
         ar_s<<"旼旽旾旿昀昁昂昃昄昅昆昇昈昉昊昋昌昍明昏"
         ar_s<<"昐昑昒易昔昕昖昗昘昙昚昛昜昝昞星映昡昢昣"
         ar_s<<"昤春昦昧昨昩昪昫昬昭昮是昰昱昲昳昴昵昶昷"
         ar_s<<"昸昹昺昻昼昽显昿晀晁時晃晄晅晆晇晈晉晊晋"
         ar_s<<"晌晍晎晏晐晑晒晓晔晕晖晗晘晙晚晛晜晝晞晟"
         ar_s<<"晠晡晢晣晤晥晦晧晨晩晪晫晬晭普景晰晱晲晳"
         ar_s<<"晴晵晶晷晸晹智晻晼晽晾晿暀暁暂暃暄暅暆暇"
         ar_s<<"暈暉暊暋暌暍暎暏暐暑暒暓暔暕暖暗暘暙暚暛"
         ar_s<<"暜暝暞暟暠暡暢暣暤暥暦暧暨暩暪暫暬暭暮暯"
         ar_s<<"暰暱暲暳暴暵暶暷暸暹暺暻暼暽暾暿曀曁曂曃"
         ar_s<<"曄曅曆曇曈曉曊曋曌曍曎曏曐曑曒曓曔曕曖曗"
         ar_s<<"曘曙曚曛曜曝曞曟曠曡曢曣曤曥曦曧曨曩曪曫"
         ar_s<<"曬曭曮曯曰曱曲曳更曵曶曷書曹曺曻曼曽曾替"
         ar_s<<"最朁朂會朄朅朆朇月有朊朋朌服朎朏朐朑朒朓"
         ar_s<<"朔朕朖朗朘朙朚望朜朝朞期朠朡朢朣朤朥朦朧"
         ar_s<<"木朩未末本札朮术朰朱朲朳朴朵朶朷朸朹机朻"
         ar_s<<"朼朽朾朿杀杁杂权杄杅杆杇杈杉杊杋杌杍李杏"
         ar_s<<"材村杒杓杔杕杖杗杘杙杚杛杜杝杞束杠条杢杣"
         ar_s<<"杤来杦杧杨杩杪杫杬杭杮杯杰東杲杳杴杵杶杷"
         ar_s<<"杸杹杺杻杼杽松板枀极枂枃构枅枆枇枈枉枊枋"
         ar_s<<"枌枍枎枏析枑枒枓枔枕枖林枘枙枚枛果枝枞枟"
         ar_s<<"枠枡枢枣枤枥枦枧枨枩枪枫枬枭枮枯枰枱枲枳"
         ar_s<<"枴枵架枷枸枹枺枻枼枽枾枿柀柁柂柃柄柅柆柇"
         ar_s<<"柈柉柊柋柌柍柎柏某柑柒染柔柕柖柗柘柙柚柛"
         ar_s<<"柜柝柞柟柠柡柢柣柤查柦柧柨柩柪柫柬柭柮柯"
         ar_s<<"柰柱柲柳柴柵柶柷柸柹柺査柼柽柾柿栀栁栂栃"
         ar_s<<"栄栅栆标栈栉栊栋栌栍栎栏栐树栒栓栔栕栖栗"
         ar_s<<"栘栙栚栛栜栝栞栟栠校栢栣栤栥栦栧栨栩株栫"
         ar_s<<"栬栭栮栯栰栱栲栳栴栵栶样核根栺栻格栽栾栿"
         ar_s<<"桀桁桂桃桄桅框桇案桉桊桋桌桍桎桏桐桑桒桓"
         ar_s<<"桔桕桖桗桘桙桚桛桜桝桞桟桠桡桢档桤桥桦桧"
         ar_s<<"桨桩桪桫桬桭桮桯桰桱桲桳桴桵桶桷桸桹桺桻"
         ar_s<<"桼桽桾桿梀梁梂梃梄梅梆梇梈梉梊梋梌梍梎梏"
         ar_s<<"梐梑梒梓梔梕梖梗梘梙梚梛梜條梞梟梠梡梢梣"
         ar_s<<"梤梥梦梧梨梩梪梫梬梭梮梯械梱梲梳梴梵梶梷"
         ar_s<<"梸梹梺梻梼梽梾梿检棁棂棃棄棅棆棇棈棉棊棋"
         ar_s<<"棌棍棎棏棐棑棒棓棔棕棖棗棘棙棚棛棜棝棞棟"
         ar_s<<"棠棡棢棣棤棥棦棧棨棩棪棫棬棭森棯棰棱棲棳"
         ar_s<<"棴棵棶棷棸棹棺棻棼棽棾棿椀椁椂椃椄椅椆椇"
         ar_s<<"椈椉椊椋椌植椎椏椐椑椒椓椔椕椖椗椘椙椚椛"
         ar_s<<"検椝椞椟椠椡椢椣椤椥椦椧椨椩椪椫椬椭椮椯"
         ar_s<<"椰椱椲椳椴椵椶椷椸椹椺椻椼椽椾椿楀楁楂楃"
         ar_s<<"楄楅楆楇楈楉楊楋楌楍楎楏楐楑楒楓楔楕楖楗"
         ar_s<<"楘楙楚楛楜楝楞楟楠楡楢楣楤楥楦楧楨楩楪楫"
         ar_s<<"楬業楮楯楰楱楲楳楴極楶楷楸楹楺楻楼楽楾楿"
         ar_s<<"榀榁概榃榄榅榆榇榈榉榊榋榌榍榎榏榐榑榒榓"
         ar_s<<"榔榕榖榗榘榙榚榛榜榝榞榟榠榡榢榣榤榥榦榧"
         ar_s<<"榨榩榪榫榬榭榮榯榰榱榲榳榴榵榶榷榸榹榺榻"
         ar_s<<"榼榽榾榿槀槁槂槃槄槅槆槇槈槉槊構槌槍槎槏"
         ar_s<<"槐槑槒槓槔槕槖槗様槙槚槛槜槝槞槟槠槡槢槣"
         ar_s<<"槤槥槦槧槨槩槪槫槬槭槮槯槰槱槲槳槴槵槶槷"
         ar_s<<"槸槹槺槻槼槽槾槿樀樁樂樃樄樅樆樇樈樉樊樋"
         ar_s<<"樌樍樎樏樐樑樒樓樔樕樖樗樘標樚樛樜樝樞樟"
         ar_s<<"樠模樢樣樤樥樦樧樨権横樫樬樭樮樯樰樱樲樳"
         ar_s<<"樴樵樶樷樸樹樺樻樼樽樾樿橀橁橂橃橄橅橆橇"
         ar_s<<"橈橉橊橋橌橍橎橏橐橑橒橓橔橕橖橗橘橙橚橛"
         ar_s<<"橜橝橞機橠橡橢橣橤橥橦橧橨橩橪橫橬橭橮橯"
         ar_s<<"橰橱橲橳橴橵橶橷橸橹橺橻橼橽橾橿檀檁檂檃"
         ar_s<<"檄檅檆檇檈檉檊檋檌檍檎檏檐檑檒檓檔檕檖檗"
         ar_s<<"檘檙檚檛檜檝檞檟檠檡檢檣檤檥檦檧檨檩檪檫"
         ar_s<<"檬檭檮檯檰檱檲檳檴檵檶檷檸檹檺檻檼檽檾檿"
         ar_s<<"櫀櫁櫂櫃櫄櫅櫆櫇櫈櫉櫊櫋櫌櫍櫎櫏櫐櫑櫒櫓"
         ar_s<<"櫔櫕櫖櫗櫘櫙櫚櫛櫜櫝櫞櫟櫠櫡櫢櫣櫤櫥櫦櫧"
         ar_s<<"櫨櫩櫪櫫櫬櫭櫮櫯櫰櫱櫲櫳櫴櫵櫶櫷櫸櫹櫺櫻"
         ar_s<<"櫼櫽櫾櫿欀欁欂欃欄欅欆欇欈欉權欋欌欍欎欏"
         ar_s<<"欐欑欒欓欔欕欖欗欘欙欚欛欜欝欞欟欠次欢欣"
         ar_s<<"欤欥欦欧欨欩欪欫欬欭欮欯欰欱欲欳欴欵欶欷"
         ar_s<<"欸欹欺欻欼欽款欿歀歁歂歃歄歅歆歇歈歉歊歋"
         ar_s<<"歌歍歎歏歐歑歒歓歔歕歖歗歘歙歚歛歜歝歞歟"
         ar_s<<"歠歡止正此步武歧歨歩歪歫歬歭歮歯歰歱歲歳"
         ar_s<<"歴歵歶歷歸歹歺死歼歽歾歿殀殁殂殃殄殅殆殇"
         ar_s<<"殈殉殊残殌殍殎殏殐殑殒殓殔殕殖殗殘殙殚殛"
         ar_s<<"殜殝殞殟殠殡殢殣殤殥殦殧殨殩殪殫殬殭殮殯"
         ar_s<<"殰殱殲殳殴段殶殷殸殹殺殻殼殽殾殿毀毁毂毃"
         ar_s<<"毄毅毆毇毈毉毊毋毌母毎每毐毑毒毓比毕毖毗"
         ar_s<<"毘毙毚毛毜毝毞毟毠毡毢毣毤毥毦毧毨毩毪毫"
         ar_s<<"毬毭毮毯毰毱毲毳毴毵毶毷毸毹毺毻毼毽毾毿"
         ar_s<<"氀氁氂氃氄氅氆氇氈氉氊氋氌氍氎氏氐民氒氓"
         ar_s<<"气氕氖気氘氙氚氛氜氝氞氟氠氡氢氣氤氥氦氧"
         ar_s<<"氨氩氪氫氬氭氮氯氰氱氲氳水氵氶氷永氹氺氻"
         ar_s<<"氼氽氾氿汀汁求汃汄汅汆汇汈汉汊汋汌汍汎汏"
         ar_s<<"汐汑汒汓汔汕汖汗汘汙汚汛汜汝汞江池污汢汣"
         ar_s<<"汤汥汦汧汨汩汪汫汬汭汮汯汰汱汲汳汴汵汶汷"
         ar_s<<"汸汹決汻汼汽汾汿沀沁沂沃沄沅沆沇沈沉沊沋"
         ar_s<<"沌沍沎沏沐沑沒沓沔沕沖沗沘沙沚沛沜沝沞沟"
         ar_s<<"沠没沢沣沤沥沦沧沨沩沪沫沬沭沮沯沰沱沲河"
         ar_s<<"沴沵沶沷沸油沺治沼沽沾沿泀況泂泃泄泅泆泇"
         ar_s<<"泈泉泊泋泌泍泎泏泐泑泒泓泔法泖泗泘泙泚泛"
         ar_s<<"泜泝泞泟泠泡波泣泤泥泦泧注泩泪泫泬泭泮泯"
         ar_s<<"泰泱泲泳泴泵泶泷泸泹泺泻泼泽泾泿洀洁洂洃"
         ar_s<<"洄洅洆洇洈洉洊洋洌洍洎洏洐洑洒洓洔洕洖洗"
         ar_s<<"洘洙洚洛洜洝洞洟洠洡洢洣洤津洦洧洨洩洪洫"
         ar_s<<"洬洭洮洯洰洱洲洳洴洵洶洷洸洹洺活洼洽派洿"
         ar_s<<"浀流浂浃浄浅浆浇浈浉浊测浌浍济浏浐浑浒浓"
         ar_s<<"浔浕浖浗浘浙浚浛浜浝浞浟浠浡浢浣浤浥浦浧"
         ar_s<<"浨浩浪浫浬浭浮浯浰浱浲浳浴浵浶海浸浹浺浻"
         ar_s<<"浼浽浾浿涀涁涂涃涄涅涆涇消涉涊涋涌涍涎涏"
         ar_s<<"涐涑涒涓涔涕涖涗涘涙涚涛涜涝涞涟涠涡涢涣"
         ar_s<<"涤涥润涧涨涩涪涫涬涭涮涯涰涱液涳涴涵涶涷"
         ar_s<<"涸涹涺涻涼涽涾涿淀淁淂淃淄淅淆淇淈淉淊淋"
         ar_s<<"淌淍淎淏淐淑淒淓淔淕淖淗淘淙淚淛淜淝淞淟"
         ar_s<<"淠淡淢淣淤淥淦淧淨淩淪淫淬淭淮淯淰深淲淳"
         ar_s<<"淴淵淶混淸淹淺添淼淽淾淿渀渁渂渃渄清渆渇"
         ar_s<<"済渉渊渋渌渍渎渏渐渑渒渓渔渕渖渗渘渙渚減"
         ar_s<<"渜渝渞渟渠渡渢渣渤渥渦渧渨温渪渫測渭渮港"
         ar_s<<"渰渱渲渳渴渵渶渷游渹渺渻渼渽渾渿湀湁湂湃"
         ar_s<<"湄湅湆湇湈湉湊湋湌湍湎湏湐湑湒湓湔湕湖湗"
         ar_s<<"湘湙湚湛湜湝湞湟湠湡湢湣湤湥湦湧湨湩湪湫"
         ar_s<<"湬湭湮湯湰湱湲湳湴湵湶湷湸湹湺湻湼湽湾湿"
         ar_s<<"満溁溂溃溄溅溆溇溈溉溊溋溌溍溎溏源溑溒溓"
         ar_s<<"溔溕準溗溘溙溚溛溜溝溞溟溠溡溢溣溤溥溦溧"
         ar_s<<"溨溩溪溫溬溭溮溯溰溱溲溳溴溵溶溷溸溹溺溻"
         ar_s<<"溼溽溾溿滀滁滂滃滄滅滆滇滈滉滊滋滌滍滎滏"
         ar_s<<"滐滑滒滓滔滕滖滗滘滙滚滛滜滝滞滟滠满滢滣"
         ar_s<<"滤滥滦滧滨滩滪滫滬滭滮滯滰滱滲滳滴滵滶滷"
         ar_s<<"滸滹滺滻滼滽滾滿漀漁漂漃漄漅漆漇漈漉漊漋"
         ar_s<<"漌漍漎漏漐漑漒漓演漕漖漗漘漙漚漛漜漝漞漟"
         ar_s<<"漠漡漢漣漤漥漦漧漨漩漪漫漬漭漮漯漰漱漲漳"
         ar_s<<"漴漵漶漷漸漹漺漻漼漽漾漿潀潁潂潃潄潅潆潇"
         ar_s<<"潈潉潊潋潌潍潎潏潐潑潒潓潔潕潖潗潘潙潚潛"
         ar_s<<"潜潝潞潟潠潡潢潣潤潥潦潧潨潩潪潫潬潭潮潯"
         ar_s<<"潰潱潲潳潴潵潶潷潸潹潺潻潼潽潾潿澀澁澂澃"
         ar_s<<"澄澅澆澇澈澉澊澋澌澍澎澏澐澑澒澓澔澕澖澗"
         ar_s<<"澘澙澚澛澜澝澞澟澠澡澢澣澤澥澦澧澨澩澪澫"
         ar_s<<"澬澭澮澯澰澱澲澳澴澵澶澷澸澹澺澻澼澽澾澿"
         ar_s<<"激濁濂濃濄濅濆濇濈濉濊濋濌濍濎濏濐濑濒濓"
         ar_s<<"濔濕濖濗濘濙濚濛濜濝濞濟濠濡濢濣濤濥濦濧"
         ar_s<<"濨濩濪濫濬濭濮濯濰濱濲濳濴濵濶濷濸濹濺濻"
         ar_s<<"濼濽濾濿瀀瀁瀂瀃瀄瀅瀆瀇瀈瀉瀊瀋瀌瀍瀎瀏"
         ar_s<<"瀐瀑瀒瀓瀔瀕瀖瀗瀘瀙瀚瀛瀜瀝瀞瀟瀠瀡瀢瀣"
         ar_s<<"瀤瀥瀦瀧瀨瀩瀪瀫瀬瀭瀮瀯瀰瀱瀲瀳瀴瀵瀶瀷"
         ar_s<<"瀸瀹瀺瀻瀼瀽瀾瀿灀灁灂灃灄灅灆灇灈灉灊灋"
         ar_s<<"灌灍灎灏灐灑灒灓灔灕灖灗灘灙灚灛灜灝灞灟"
         ar_s<<"灠灡灢灣灤灥灦灧灨灩灪火灬灭灮灯灰灱灲灳"
         ar_s<<"灴灵灶灷灸灹灺灻灼災灾灿炀炁炂炃炄炅炆炇"
         ar_s<<"炈炉炊炋炌炍炎炏炐炑炒炓炔炕炖炗炘炙炚炛"
         ar_s<<"炜炝炞炟炠炡炢炣炤炥炦炧炨炩炪炫炬炭炮炯"
         ar_s<<"炰炱炲炳炴炵炶炷炸点為炻炼炽炾炿烀烁烂烃"
         ar_s<<"烄烅烆烇烈烉烊烋烌烍烎烏烐烑烒烓烔烕烖烗"
         ar_s<<"烘烙烚烛烜烝烞烟烠烡烢烣烤烥烦烧烨烩烪烫"
         ar_s<<"烬热烮烯烰烱烲烳烴烵烶烷烸烹烺烻烼烽烾烿"
         ar_s<<"焀焁焂焃焄焅焆焇焈焉焊焋焌焍焎焏焐焑焒焓"
         ar_s<<"焔焕焖焗焘焙焚焛焜焝焞焟焠無焢焣焤焥焦焧"
         ar_s<<"焨焩焪焫焬焭焮焯焰焱焲焳焴焵然焷焸焹焺焻"
         ar_s<<"焼焽焾焿煀煁煂煃煄煅煆煇煈煉煊煋煌煍煎煏"
         ar_s<<"煐煑煒煓煔煕煖煗煘煙煚煛煜煝煞煟煠煡煢煣"
         ar_s<<"煤煥煦照煨煩煪煫煬煭煮煯煰煱煲煳煴煵煶煷"
         ar_s<<"煸煹煺煻煼煽煾煿熀熁熂熃熄熅熆熇熈熉熊熋"
         ar_s<<"熌熍熎熏熐熑熒熓熔熕熖熗熘熙熚熛熜熝熞熟"
         ar_s<<"熠熡熢熣熤熥熦熧熨熩熪熫熬熭熮熯熰熱熲熳"
         ar_s<<"熴熵熶熷熸熹熺熻熼熽熾熿燀燁燂燃燄燅燆燇"
         ar_s<<"燈燉燊燋燌燍燎燏燐燑燒燓燔燕燖燗燘燙燚燛"
         ar_s<<"燜燝燞營燠燡燢燣燤燥燦燧燨燩燪燫燬燭燮燯"
         ar_s<<"燰燱燲燳燴燵燶燷燸燹燺燻燼燽燾燿爀爁爂爃"
         ar_s<<"爄爅爆爇爈爉爊爋爌爍爎爏爐爑爒爓爔爕爖爗"
         ar_s<<"爘爙爚爛爜爝爞爟爠爡爢爣爤爥爦爧爨爩爪爫"
         ar_s<<"爬爭爮爯爰爱爲爳爴爵父爷爸爹爺爻爼爽爾爿"
         ar_s<<"牀牁牂牃牄牅牆片版牉牊牋牌牍牎牏牐牑牒牓"
         ar_s<<"牔牕牖牗牘牙牚牛牜牝牞牟牠牡牢牣牤牥牦牧"
         ar_s<<"牨物牪牫牬牭牮牯牰牱牲牳牴牵牶牷牸特牺牻"
         ar_s<<"牼牽牾牿犀犁犂犃犄犅犆犇犈犉犊犋犌犍犎犏"
         ar_s<<"犐犑犒犓犔犕犖犗犘犙犚犛犜犝犞犟犠犡犢犣"
         ar_s<<"犤犥犦犧犨犩犪犫犬犭犮犯犰犱犲犳犴犵状犷"
         ar_s<<"犸犹犺犻犼犽犾犿狀狁狂狃狄狅狆狇狈狉狊狋"
         ar_s<<"狌狍狎狏狐狑狒狓狔狕狖狗狘狙狚狛狜狝狞狟"
         ar_s<<"狠狡狢狣狤狥狦狧狨狩狪狫独狭狮狯狰狱狲狳"
         ar_s<<"狴狵狶狷狸狹狺狻狼狽狾狿猀猁猂猃猄猅猆猇"
         ar_s<<"猈猉猊猋猌猍猎猏猐猑猒猓猔猕猖猗猘猙猚猛"
         ar_s<<"猜猝猞猟猠猡猢猣猤猥猦猧猨猩猪猫猬猭献猯"
         ar_s<<"猰猱猲猳猴猵猶猷猸猹猺猻猼猽猾猿獀獁獂獃"
         ar_s<<"獄獅獆獇獈獉獊獋獌獍獎獏獐獑獒獓獔獕獖獗"
         ar_s<<"獘獙獚獛獜獝獞獟獠獡獢獣獤獥獦獧獨獩獪獫"
         ar_s<<"獬獭獮獯獰獱獲獳獴獵獶獷獸獹獺獻獼獽獾獿"
         ar_s<<"玀玁玂玃玄玅玆率玈玉玊王玌玍玎玏玐玑玒玓"
         ar_s<<"玔玕玖玗玘玙玚玛玜玝玞玟玠玡玢玣玤玥玦玧"
         ar_s<<"玨玩玪玫玬玭玮环现玱玲玳玴玵玶玷玸玹玺玻"
         ar_s<<"玼玽玾玿珀珁珂珃珄珅珆珇珈珉珊珋珌珍珎珏"
         ar_s<<"珐珑珒珓珔珕珖珗珘珙珚珛珜珝珞珟珠珡珢珣"
         ar_s<<"珤珥珦珧珨珩珪珫珬班珮珯珰珱珲珳珴珵珶珷"
         ar_s<<"珸珹珺珻珼珽現珿琀琁琂球琄琅理琇琈琉琊琋"
         ar_s<<"琌琍琎琏琐琑琒琓琔琕琖琗琘琙琚琛琜琝琞琟"
         ar_s<<"琠琡琢琣琤琥琦琧琨琩琪琫琬琭琮琯琰琱琲琳"
         ar_s<<"琴琵琶琷琸琹琺琻琼琽琾琿瑀瑁瑂瑃瑄瑅瑆瑇"
         ar_s<<"瑈瑉瑊瑋瑌瑍瑎瑏瑐瑑瑒瑓瑔瑕瑖瑗瑘瑙瑚瑛"
         ar_s<<"瑜瑝瑞瑟瑠瑡瑢瑣瑤瑥瑦瑧瑨瑩瑪瑫瑬瑭瑮瑯"
         ar_s<<"瑰瑱瑲瑳瑴瑵瑶瑷瑸瑹瑺瑻瑼瑽瑾瑿璀璁璂璃"
         ar_s<<"璄璅璆璇璈璉璊璋璌璍璎璏璐璑璒璓璔璕璖璗"
         ar_s<<"璘璙璚璛璜璝璞璟璠璡璢璣璤璥璦璧璨璩璪璫"
         ar_s<<"璬璭璮璯環璱璲璳璴璵璶璷璸璹璺璻璼璽璾璿"
         ar_s<<"瓀瓁瓂瓃瓄瓅瓆瓇瓈瓉瓊瓋瓌瓍瓎瓏瓐瓑瓒瓓"
         ar_s<<"瓔瓕瓖瓗瓘瓙瓚瓛瓜瓝瓞瓟瓠瓡瓢瓣瓤瓥瓦瓧"
         ar_s<<"瓨瓩瓪瓫瓬瓭瓮瓯瓰瓱瓲瓳瓴瓵瓶瓷瓸瓹瓺瓻"
         ar_s<<"瓼瓽瓾瓿甀甁甂甃甄甅甆甇甈甉甊甋甌甍甎甏"
         ar_s<<"甐甑甒甓甔甕甖甗甘甙甚甛甜甝甞生甠甡產産"
         ar_s<<"甤甥甦甧用甩甪甫甬甭甮甯田由甲申甴电甶男"
         ar_s<<"甸甹町画甼甽甾甿畀畁畂畃畄畅畆畇畈畉畊畋"
         ar_s<<"界畍畎畏畐畑畒畓畔畕畖畗畘留畚畛畜畝畞畟"
         ar_s<<"畠畡畢畣畤略畦畧畨畩番畫畬畭畮畯異畱畲畳"
         ar_s<<"畴畵當畷畸畹畺畻畼畽畾畿疀疁疂疃疄疅疆疇"
         ar_s<<"疈疉疊疋疌疍疎疏疐疑疒疓疔疕疖疗疘疙疚疛"
         ar_s<<"疜疝疞疟疠疡疢疣疤疥疦疧疨疩疪疫疬疭疮疯"
         ar_s<<"疰疱疲疳疴疵疶疷疸疹疺疻疼疽疾疿痀痁痂痃"
         ar_s<<"痄病痆症痈痉痊痋痌痍痎痏痐痑痒痓痔痕痖痗"
         ar_s<<"痘痙痚痛痜痝痞痟痠痡痢痣痤痥痦痧痨痩痪痫"
         ar_s<<"痬痭痮痯痰痱痲痳痴痵痶痷痸痹痺痻痼痽痾痿"
         ar_s<<"瘀瘁瘂瘃瘄瘅瘆瘇瘈瘉瘊瘋瘌瘍瘎瘏瘐瘑瘒瘓"
         ar_s<<"瘔瘕瘖瘗瘘瘙瘚瘛瘜瘝瘞瘟瘠瘡瘢瘣瘤瘥瘦瘧"
         ar_s<<"瘨瘩瘪瘫瘬瘭瘮瘯瘰瘱瘲瘳瘴瘵瘶瘷瘸瘹瘺瘻"
         ar_s<<"瘼瘽瘾瘿癀癁療癃癄癅癆癇癈癉癊癋癌癍癎癏"
         ar_s<<"癐癑癒癓癔癕癖癗癘癙癚癛癜癝癞癟癠癡癢癣"
         ar_s<<"癤癥癦癧癨癩癪癫癬癭癮癯癰癱癲癳癴癵癶癷"
         ar_s<<"癸癹発登發白百癿皀皁皂皃的皅皆皇皈皉皊皋"
         ar_s<<"皌皍皎皏皐皑皒皓皔皕皖皗皘皙皚皛皜皝皞皟"
         ar_s<<"皠皡皢皣皤皥皦皧皨皩皪皫皬皭皮皯皰皱皲皳"
         ar_s<<"皴皵皶皷皸皹皺皻皼皽皾皿盀盁盂盃盄盅盆盇"
         ar_s<<"盈盉益盋盌盍盎盏盐监盒盓盔盕盖盗盘盙盚盛"
         ar_s<<"盜盝盞盟盠盡盢監盤盥盦盧盨盩盪盫盬盭目盯"
         ar_s<<"盰盱盲盳直盵盶盷相盹盺盻盼盽盾盿眀省眂眃"
         ar_s<<"眄眅眆眇眈眉眊看県眍眎眏眐眑眒眓眔眕眖眗"
         ar_s<<"眘眙眚眛眜眝眞真眠眡眢眣眤眥眦眧眨眩眪眫"
         ar_s<<"眬眭眮眯眰眱眲眳眴眵眶眷眸眹眺眻眼眽眾眿"
         ar_s<<"着睁睂睃睄睅睆睇睈睉睊睋睌睍睎睏睐睑睒睓"
         ar_s<<"睔睕睖睗睘睙睚睛睜睝睞睟睠睡睢督睤睥睦睧"
         ar_s<<"睨睩睪睫睬睭睮睯睰睱睲睳睴睵睶睷睸睹睺睻"
         ar_s<<"睼睽睾睿瞀瞁瞂瞃瞄瞅瞆瞇瞈瞉瞊瞋瞌瞍瞎瞏"
         ar_s<<"瞐瞑瞒瞓瞔瞕瞖瞗瞘瞙瞚瞛瞜瞝瞞瞟瞠瞡瞢瞣"
         ar_s<<"瞤瞥瞦瞧瞨瞩瞪瞫瞬瞭瞮瞯瞰瞱瞲瞳瞴瞵瞶瞷"
         ar_s<<"瞸瞹瞺瞻瞼瞽瞾瞿矀矁矂矃矄矅矆矇矈矉矊矋"
         ar_s<<"矌矍矎矏矐矑矒矓矔矕矖矗矘矙矚矛矜矝矞矟"
         ar_s<<"矠矡矢矣矤知矦矧矨矩矪矫矬短矮矯矰矱矲石"
         ar_s<<"矴矵矶矷矸矹矺矻矼矽矾矿砀码砂砃砄砅砆砇"
         ar_s<<"砈砉砊砋砌砍砎砏砐砑砒砓研砕砖砗砘砙砚砛"
         ar_s<<"砜砝砞砟砠砡砢砣砤砥砦砧砨砩砪砫砬砭砮砯"
         ar_s<<"砰砱砲砳破砵砶砷砸砹砺砻砼砽砾砿础硁硂硃"
         ar_s<<"硄硅硆硇硈硉硊硋硌硍硎硏硐硑硒硓硔硕硖硗"
         ar_s<<"硘硙硚硛硜硝硞硟硠硡硢硣硤硥硦硧硨硩硪硫"
         ar_s<<"硬硭确硯硰硱硲硳硴硵硶硷硸硹硺硻硼硽硾硿"
         ar_s<<"碀碁碂碃碄碅碆碇碈碉碊碋碌碍碎碏碐碑碒碓"
         ar_s<<"碔碕碖碗碘碙碚碛碜碝碞碟碠碡碢碣碤碥碦碧"
         ar_s<<"碨碩碪碫碬碭碮碯碰碱碲碳碴碵碶碷碸碹確碻"
         ar_s<<"碼碽碾碿磀磁磂磃磄磅磆磇磈磉磊磋磌磍磎磏"
         ar_s<<"磐磑磒磓磔磕磖磗磘磙磚磛磜磝磞磟磠磡磢磣"
         ar_s<<"磤磥磦磧磨磩磪磫磬磭磮磯磰磱磲磳磴磵磶磷"
         ar_s<<"磸磹磺磻磼磽磾磿礀礁礂礃礄礅礆礇礈礉礊礋"
         ar_s<<"礌礍礎礏礐礑礒礓礔礕礖礗礘礙礚礛礜礝礞礟"
         ar_s<<"礠礡礢礣礤礥礦礧礨礩礪礫礬礭礮礯礰礱礲礳"
         ar_s<<"礴礵礶礷礸礹示礻礼礽社礿祀祁祂祃祄祅祆祇"
         ar_s<<"祈祉祊祋祌祍祎祏祐祑祒祓祔祕祖祗祘祙祚祛"
         ar_s<<"祜祝神祟祠祡祢祣祤祥祦祧票祩祪祫祬祭祮祯"
         ar_s<<"祰祱祲祳祴祵祶祷祸祹祺祻祼祽祾祿禀禁禂禃"
         ar_s<<"禄禅禆禇禈禉禊禋禌禍禎福禐禑禒禓禔禕禖禗"
         ar_s<<"禘禙禚禛禜禝禞禟禠禡禢禣禤禥禦禧禨禩禪禫"
         ar_s<<"禬禭禮禯禰禱禲禳禴禵禶禷禸禹禺离禼禽禾禿"
         ar_s<<"秀私秂秃秄秅秆秇秈秉秊秋秌种秎秏秐科秒秓"
         ar_s<<"秔秕秖秗秘秙秚秛秜秝秞租秠秡秢秣秤秥秦秧"
         ar_s<<"秨秩秪秫秬秭秮积称秱秲秳秴秵秶秷秸秹秺移"
         ar_s<<"秼秽秾秿稀稁稂稃稄稅稆稇稈稉稊程稌稍税稏"
         ar_s<<"稐稑稒稓稔稕稖稗稘稙稚稛稜稝稞稟稠稡稢稣"
         ar_s<<"稤稥稦稧稨稩稪稫稬稭種稯稰稱稲稳稴稵稶稷"
         ar_s<<"稸稹稺稻稼稽稾稿穀穁穂穃穄穅穆穇穈穉穊穋"
         ar_s<<"穌積穎穏穐穑穒穓穔穕穖穗穘穙穚穛穜穝穞穟"
         ar_s<<"穠穡穢穣穤穥穦穧穨穩穪穫穬穭穮穯穰穱穲穳"
         ar_s<<"穴穵究穷穸穹空穻穼穽穾穿窀突窂窃窄窅窆窇"
         ar_s<<"窈窉窊窋窌窍窎窏窐窑窒窓窔窕窖窗窘窙窚窛"
         ar_s<<"窜窝窞窟窠窡窢窣窤窥窦窧窨窩窪窫窬窭窮窯"
         ar_s<<"窰窱窲窳窴窵窶窷窸窹窺窻窼窽窾窿竀竁竂竃"
         ar_s<<"竄竅竆竇竈竉竊立竌竍竎竏竐竑竒竓竔竕竖竗"
         ar_s<<"竘站竚竛竜竝竞竟章竡竢竣竤童竦竧竨竩竪竫"
         ar_s<<"竬竭竮端竰竱竲竳竴竵競竷竸竹竺竻竼竽竾竿"
         ar_s<<"笀笁笂笃笄笅笆笇笈笉笊笋笌笍笎笏笐笑笒笓"
         ar_s<<"笔笕笖笗笘笙笚笛笜笝笞笟笠笡笢笣笤笥符笧"
         ar_s<<"笨笩笪笫第笭笮笯笰笱笲笳笴笵笶笷笸笹笺笻"
         ar_s<<"笼笽笾笿筀筁筂筃筄筅筆筇筈等筊筋筌筍筎筏"
         ar_s<<"筐筑筒筓答筕策筗筘筙筚筛筜筝筞筟筠筡筢筣"
         ar_s<<"筤筥筦筧筨筩筪筫筬筭筮筯筰筱筲筳筴筵筶筷"
         ar_s<<"筸筹筺筻筼筽签筿简箁箂箃箄箅箆箇箈箉箊箋"
         ar_s<<"箌箍箎箏箐箑箒箓箔箕箖算箘箙箚箛箜箝箞箟"
         ar_s<<"箠管箢箣箤箥箦箧箨箩箪箫箬箭箮箯箰箱箲箳"
         ar_s<<"箴箵箶箷箸箹箺箻箼箽箾箿節篁篂篃範篅篆篇"
         ar_s<<"篈築篊篋篌篍篎篏篐篑篒篓篔篕篖篗篘篙篚篛"
         ar_s<<"篜篝篞篟篠篡篢篣篤篥篦篧篨篩篪篫篬篭篮篯"
         ar_s<<"篰篱篲篳篴篵篶篷篸篹篺篻篼篽篾篿簀簁簂簃"
         ar_s<<"簄簅簆簇簈簉簊簋簌簍簎簏簐簑簒簓簔簕簖簗"
         ar_s<<"簘簙簚簛簜簝簞簟簠簡簢簣簤簥簦簧簨簩簪簫"
         ar_s<<"簬簭簮簯簰簱簲簳簴簵簶簷簸簹簺簻簼簽簾簿"
         ar_s<<"籀籁籂籃籄籅籆籇籈籉籊籋籌籍籎籏籐籑籒籓"
         ar_s<<"籔籕籖籗籘籙籚籛籜籝籞籟籠籡籢籣籤籥籦籧"
         ar_s<<"籨籩籪籫籬籭籮籯籰籱籲米籴籵籶籷籸籹籺类"
         ar_s<<"籼籽籾籿粀粁粂粃粄粅粆粇粈粉粊粋粌粍粎粏"
         ar_s<<"粐粑粒粓粔粕粖粗粘粙粚粛粜粝粞粟粠粡粢粣"
         ar_s<<"粤粥粦粧粨粩粪粫粬粭粮粯粰粱粲粳粴粵粶粷"
         ar_s<<"粸粹粺粻粼粽精粿糀糁糂糃糄糅糆糇糈糉糊糋"
         ar_s<<"糌糍糎糏糐糑糒糓糔糕糖糗糘糙糚糛糜糝糞糟"
         ar_s<<"糠糡糢糣糤糥糦糧糨糩糪糫糬糭糮糯糰糱糲糳"
         ar_s<<"糴糵糶糷糸糹糺系糼糽糾糿紀紁紂紃約紅紆紇"
         ar_s<<"紈紉紊紋紌納紎紏紐紑紒紓純紕紖紗紘紙級紛"
         ar_s<<"紜紝紞紟素紡索紣紤紥紦紧紨紩紪紫紬紭紮累"
         ar_s<<"細紱紲紳紴紵紶紷紸紹紺紻紼紽紾紿絀絁終絃"
         ar_s<<"組絅絆絇絈絉絊絋経絍絎絏結絑絒絓絔絕絖絗"
         ar_s<<"絘絙絚絛絜絝絞絟絠絡絢絣絤絥給絧絨絩絪絫"
         ar_s<<"絬絭絮絯絰統絲絳絴絵絶絷絸絹絺絻絼絽絾絿"
         ar_s<<"綀綁綂綃綄綅綆綇綈綉綊綋綌綍綎綏綐綑綒經"
         ar_s<<"綔綕綖綗綘継続綛綜綝綞綟綠綡綢綣綤綥綦綧"
         ar_s<<"綨綩綪綫綬維綮綯綰綱網綳綴綵綶綷綸綹綺綻"
         ar_s<<"綼綽綾綿緀緁緂緃緄緅緆緇緈緉緊緋緌緍緎総"
         ar_s<<"緐緑緒緓緔緕緖緗緘緙線緛緜緝緞緟締緡緢緣"
         ar_s<<"緤緥緦緧編緩緪緫緬緭緮緯緰緱緲緳練緵緶緷"
         ar_s<<"緸緹緺緻緼緽緾緿縀縁縂縃縄縅縆縇縈縉縊縋"
         ar_s<<"縌縍縎縏縐縑縒縓縔縕縖縗縘縙縚縛縜縝縞縟"
         ar_s<<"縠縡縢縣縤縥縦縧縨縩縪縫縬縭縮縯縰縱縲縳"
         ar_s<<"縴縵縶縷縸縹縺縻縼總績縿繀繁繂繃繄繅繆繇"
         ar_s<<"繈繉繊繋繌繍繎繏繐繑繒繓織繕繖繗繘繙繚繛"
         ar_s<<"繜繝繞繟繠繡繢繣繤繥繦繧繨繩繪繫繬繭繮繯"
         ar_s<<"繰繱繲繳繴繵繶繷繸繹繺繻繼繽繾繿纀纁纂纃"
         ar_s<<"纄纅纆纇纈纉纊纋續纍纎纏纐纑纒纓纔纕纖纗"
         ar_s<<"纘纙纚纛纜纝纞纟纠纡红纣纤纥约级纨纩纪纫"
         ar_s<<"纬纭纮纯纰纱纲纳纴纵纶纷纸纹纺纻纼纽纾线"
         ar_s<<"绀绁绂练组绅细织终绉绊绋绌绍绎经绐绑绒结"
         ar_s<<"绔绕绖绗绘给绚绛络绝绞统绠绡绢绣绤绥绦继"
         ar_s<<"绨绩绪绫绬续绮绯绰绱绲绳维绵绶绷绸绹绺绻"
         ar_s<<"综绽绾绿缀缁缂缃缄缅缆缇缈缉缊缋缌缍缎缏"
         ar_s<<"缐缑缒缓缔缕编缗缘缙缚缛缜缝缞缟缠缡缢缣"
         ar_s<<"缤缥缦缧缨缩缪缫缬缭缮缯缰缱缲缳缴缵缶缷"
         ar_s<<"缸缹缺缻缼缽缾缿罀罁罂罃罄罅罆罇罈罉罊罋"
         ar_s<<"罌罍罎罏罐网罒罓罔罕罖罗罘罙罚罛罜罝罞罟"
         ar_s<<"罠罡罢罣罤罥罦罧罨罩罪罫罬罭置罯罰罱署罳"
         ar_s<<"罴罵罶罷罸罹罺罻罼罽罾罿羀羁羂羃羄羅羆羇"
         ar_s<<"羈羉羊羋羌羍美羏羐羑羒羓羔羕羖羗羘羙羚羛"
         ar_s<<"羜羝羞羟羠羡羢羣群羥羦羧羨義羪羫羬羭羮羯"
         ar_s<<"羰羱羲羳羴羵羶羷羸羹羺羻羼羽羾羿翀翁翂翃"
         ar_s<<"翄翅翆翇翈翉翊翋翌翍翎翏翐翑習翓翔翕翖翗"
         ar_s<<"翘翙翚翛翜翝翞翟翠翡翢翣翤翥翦翧翨翩翪翫"
         ar_s<<"翬翭翮翯翰翱翲翳翴翵翶翷翸翹翺翻翼翽翾翿"
         ar_s<<"耀老耂考耄者耆耇耈耉耊耋而耍耎耏耐耑耒耓"
         ar_s<<"耔耕耖耗耘耙耚耛耜耝耞耟耠耡耢耣耤耥耦耧"
         ar_s<<"耨耩耪耫耬耭耮耯耰耱耲耳耴耵耶耷耸耹耺耻"
         ar_s<<"耼耽耾耿聀聁聂聃聄聅聆聇聈聉聊聋职聍聎聏"
         ar_s<<"聐聑聒聓联聕聖聗聘聙聚聛聜聝聞聟聠聡聢聣"
         ar_s<<"聤聥聦聧聨聩聪聫聬聭聮聯聰聱聲聳聴聵聶職"
         ar_s<<"聸聹聺聻聼聽聾聿肀肁肂肃肄肅肆肇肈肉肊肋"
         ar_s<<"肌肍肎肏肐肑肒肓肔肕肖肗肘肙肚肛肜肝肞肟"
         ar_s<<"肠股肢肣肤肥肦肧肨肩肪肫肬肭肮肯肰肱育肳"
         ar_s<<"肴肵肶肷肸肹肺肻肼肽肾肿胀胁胂胃胄胅胆胇"
         ar_s<<"胈胉胊胋背胍胎胏胐胑胒胓胔胕胖胗胘胙胚胛"
         ar_s<<"胜胝胞胟胠胡胢胣胤胥胦胧胨胩胪胫胬胭胮胯"
         ar_s<<"胰胱胲胳胴胵胶胷胸胹胺胻胼能胾胿脀脁脂脃"
         ar_s<<"脄脅脆脇脈脉脊脋脌脍脎脏脐脑脒脓脔脕脖脗"
         ar_s<<"脘脙脚脛脜脝脞脟脠脡脢脣脤脥脦脧脨脩脪脫"
         ar_s<<"脬脭脮脯脰脱脲脳脴脵脶脷脸脹脺脻脼脽脾脿"
         ar_s<<"腀腁腂腃腄腅腆腇腈腉腊腋腌腍腎腏腐腑腒腓"
         ar_s<<"腔腕腖腗腘腙腚腛腜腝腞腟腠腡腢腣腤腥腦腧"
         ar_s<<"腨腩腪腫腬腭腮腯腰腱腲腳腴腵腶腷腸腹腺腻"
         ar_s<<"腼腽腾腿膀膁膂膃膄膅膆膇膈膉膊膋膌膍膎膏"
         ar_s<<"膐膑膒膓膔膕膖膗膘膙膚膛膜膝膞膟膠膡膢膣"
         ar_s<<"膤膥膦膧膨膩膪膫膬膭膮膯膰膱膲膳膴膵膶膷"
         ar_s<<"膸膹膺膻膼膽膾膿臀臁臂臃臄臅臆臇臈臉臊臋"
         ar_s<<"臌臍臎臏臐臑臒臓臔臕臖臗臘臙臚臛臜臝臞臟"
         ar_s<<"臠臡臢臣臤臥臦臧臨臩自臫臬臭臮臯臰臱臲至"
         ar_s<<"致臵臶臷臸臹臺臻臼臽臾臿舀舁舂舃舄舅舆與"
         ar_s<<"興舉舊舋舌舍舎舏舐舑舒舓舔舕舖舗舘舙舚舛"
         ar_s<<"舜舝舞舟舠舡舢舣舤舥舦舧舨舩航舫般舭舮舯"
         ar_s<<"舰舱舲舳舴舵舶舷舸船舺舻舼舽舾舿艀艁艂艃"
         ar_s<<"艄艅艆艇艈艉艊艋艌艍艎艏艐艑艒艓艔艕艖艗"
         ar_s<<"艘艙艚艛艜艝艞艟艠艡艢艣艤艥艦艧艨艩艪艫"
         ar_s<<"艬艭艮良艰艱色艳艴艵艶艷艸艹艺艻艼艽艾艿"
         ar_s<<"芀芁节芃芄芅芆芇芈芉芊芋芌芍芎芏芐芑芒芓"
         ar_s<<"芔芕芖芗芘芙芚芛芜芝芞芟芠芡芢芣芤芥芦芧"
         ar_s<<"芨芩芪芫芬芭芮芯芰花芲芳芴芵芶芷芸芹芺芻"
         ar_s<<"芼芽芾芿苀苁苂苃苄苅苆苇苈苉苊苋苌苍苎苏"
         ar_s<<"苐苑苒苓苔苕苖苗苘苙苚苛苜苝苞苟苠苡苢苣"
         ar_s<<"苤若苦苧苨苩苪苫苬苭苮苯苰英苲苳苴苵苶苷"
         ar_s<<"苸苹苺苻苼苽苾苿茀茁茂范茄茅茆茇茈茉茊茋"
         ar_s<<"茌茍茎茏茐茑茒茓茔茕茖茗茘茙茚茛茜茝茞茟"
         ar_s<<"茠茡茢茣茤茥茦茧茨茩茪茫茬茭茮茯茰茱茲茳"
         ar_s<<"茴茵茶茷茸茹茺茻茼茽茾茿荀荁荂荃荄荅荆荇"
         ar_s<<"荈草荊荋荌荍荎荏荐荑荒荓荔荕荖荗荘荙荚荛"
         ar_s<<"荜荝荞荟荠荡荢荣荤荥荦荧荨荩荪荫荬荭荮药"
         ar_s<<"荰荱荲荳荴荵荶荷荸荹荺荻荼荽荾荿莀莁莂莃"
         ar_s<<"莄莅莆莇莈莉莊莋莌莍莎莏莐莑莒莓莔莕莖莗"
         ar_s<<"莘莙莚莛莜莝莞莟莠莡莢莣莤莥莦莧莨莩莪莫"
         ar_s<<"莬莭莮莯莰莱莲莳莴莵莶获莸莹莺莻莼莽莾莿"
         ar_s<<"菀菁菂菃菄菅菆菇菈菉菊菋菌菍菎菏菐菑菒菓"
         ar_s<<"菔菕菖菗菘菙菚菛菜菝菞菟菠菡菢菣菤菥菦菧"
         ar_s<<"菨菩菪菫菬菭菮華菰菱菲菳菴菵菶菷菸菹菺菻"
         ar_s<<"菼菽菾菿萀萁萂萃萄萅萆萇萈萉萊萋萌萍萎萏"
         ar_s<<"萐萑萒萓萔萕萖萗萘萙萚萛萜萝萞萟萠萡萢萣"
         ar_s<<"萤营萦萧萨萩萪萫萬萭萮萯萰萱萲萳萴萵萶萷"
         ar_s<<"萸萹萺萻萼落萾萿葀葁葂葃葄葅葆葇葈葉葊葋"
         ar_s<<"葌葍葎葏葐葑葒葓葔葕葖著葘葙葚葛葜葝葞葟"
         ar_s<<"葠葡葢董葤葥葦葧葨葩葪葫葬葭葮葯葰葱葲葳"
         ar_s<<"葴葵葶葷葸葹葺葻葼葽葾葿蒀蒁蒂蒃蒄蒅蒆蒇"
         ar_s<<"蒈蒉蒊蒋蒌蒍蒎蒏蒐蒑蒒蒓蒔蒕蒖蒗蒘蒙蒚蒛"
         ar_s<<"蒜蒝蒞蒟蒠蒡蒢蒣蒤蒥蒦蒧蒨蒩蒪蒫蒬蒭蒮蒯"
         ar_s<<"蒰蒱蒲蒳蒴蒵蒶蒷蒸蒹蒺蒻蒼蒽蒾蒿蓀蓁蓂蓃"
         ar_s<<"蓄蓅蓆蓇蓈蓉蓊蓋蓌蓍蓎蓏蓐蓑蓒蓓蓔蓕蓖蓗"
         ar_s<<"蓘蓙蓚蓛蓜蓝蓞蓟蓠蓡蓢蓣蓤蓥蓦蓧蓨蓩蓪蓫"
         ar_s<<"蓬蓭蓮蓯蓰蓱蓲蓳蓴蓵蓶蓷蓸蓹蓺蓻蓼蓽蓾蓿"
         ar_s<<"蔀蔁蔂蔃蔄蔅蔆蔇蔈蔉蔊蔋蔌蔍蔎蔏蔐蔑蔒蔓"
         ar_s<<"蔔蔕蔖蔗蔘蔙蔚蔛蔜蔝蔞蔟蔠蔡蔢蔣蔤蔥蔦蔧"
         ar_s<<"蔨蔩蔪蔫蔬蔭蔮蔯蔰蔱蔲蔳蔴蔵蔶蔷蔸蔹蔺蔻"
         ar_s<<"蔼蔽蔾蔿蕀蕁蕂蕃蕄蕅蕆蕇蕈蕉蕊蕋蕌蕍蕎蕏"
         ar_s<<"蕐蕑蕒蕓蕔蕕蕖蕗蕘蕙蕚蕛蕜蕝蕞蕟蕠蕡蕢蕣"
         ar_s<<"蕤蕥蕦蕧蕨蕩蕪蕫蕬蕭蕮蕯蕰蕱蕲蕳蕴蕵蕶蕷"
         ar_s<<"蕸蕹蕺蕻蕼蕽蕾蕿薀薁薂薃薄薅薆薇薈薉薊薋"
         ar_s<<"薌薍薎薏薐薑薒薓薔薕薖薗薘薙薚薛薜薝薞薟"
         ar_s<<"薠薡薢薣薤薥薦薧薨薩薪薫薬薭薮薯薰薱薲薳"
         ar_s<<"薴薵薶薷薸薹薺薻薼薽薾薿藀藁藂藃藄藅藆藇"
         ar_s<<"藈藉藊藋藌藍藎藏藐藑藒藓藔藕藖藗藘藙藚藛"
         ar_s<<"藜藝藞藟藠藡藢藣藤藥藦藧藨藩藪藫藬藭藮藯"
         ar_s<<"藰藱藲藳藴藵藶藷藸藹藺藻藼藽藾藿蘀蘁蘂蘃"
         ar_s<<"蘄蘅蘆蘇蘈蘉蘊蘋蘌蘍蘎蘏蘐蘑蘒蘓蘔蘕蘖蘗"
         ar_s<<"蘘蘙蘚蘛蘜蘝蘞蘟蘠蘡蘢蘣蘤蘥蘦蘧蘨蘩蘪蘫"
         ar_s<<"蘬蘭蘮蘯蘰蘱蘲蘳蘴蘵蘶蘷蘸蘹蘺蘻蘼蘽蘾蘿"
         ar_s<<"虀虁虂虃虄虅虆虇虈虉虊虋虌虍虎虏虐虑虒虓"
         ar_s<<"虔處虖虗虘虙虚虛虜虝虞號虠虡虢虣虤虥虦虧"
         ar_s<<"虨虩虪虫虬虭虮虯虰虱虲虳虴虵虶虷虸虹虺虻"
         ar_s<<"虼虽虾虿蚀蚁蚂蚃蚄蚅蚆蚇蚈蚉蚊蚋蚌蚍蚎蚏"
         ar_s<<"蚐蚑蚒蚓蚔蚕蚖蚗蚘蚙蚚蚛蚜蚝蚞蚟蚠蚡蚢蚣"
         ar_s<<"蚤蚥蚦蚧蚨蚩蚪蚫蚬蚭蚮蚯蚰蚱蚲蚳蚴蚵蚶蚷"
         ar_s<<"蚸蚹蚺蚻蚼蚽蚾蚿蛀蛁蛂蛃蛄蛅蛆蛇蛈蛉蛊蛋"
         ar_s<<"蛌蛍蛎蛏蛐蛑蛒蛓蛔蛕蛖蛗蛘蛙蛚蛛蛜蛝蛞蛟"
         ar_s<<"蛠蛡蛢蛣蛤蛥蛦蛧蛨蛩蛪蛫蛬蛭蛮蛯蛰蛱蛲蛳"
         ar_s<<"蛴蛵蛶蛷蛸蛹蛺蛻蛼蛽蛾蛿蜀蜁蜂蜃蜄蜅蜆蜇"
         ar_s<<"蜈蜉蜊蜋蜌蜍蜎蜏蜐蜑蜒蜓蜔蜕蜖蜗蜘蜙蜚蜛"
         ar_s<<"蜜蜝蜞蜟蜠蜡蜢蜣蜤蜥蜦蜧蜨蜩蜪蜫蜬蜭蜮蜯"
         ar_s<<"蜰蜱蜲蜳蜴蜵蜶蜷蜸蜹蜺蜻蜼蜽蜾蜿蝀蝁蝂蝃"
         ar_s<<"蝄蝅蝆蝇蝈蝉蝊蝋蝌蝍蝎蝏蝐蝑蝒蝓蝔蝕蝖蝗"
         ar_s<<"蝘蝙蝚蝛蝜蝝蝞蝟蝠蝡蝢蝣蝤蝥蝦蝧蝨蝩蝪蝫"
         ar_s<<"蝬蝭蝮蝯蝰蝱蝲蝳蝴蝵蝶蝷蝸蝹蝺蝻蝼蝽蝾蝿"
         ar_s<<"螀螁螂螃螄螅螆螇螈螉螊螋螌融螎螏螐螑螒螓"
         ar_s<<"螔螕螖螗螘螙螚螛螜螝螞螟螠螡螢螣螤螥螦螧"
         ar_s<<"螨螩螪螫螬螭螮螯螰螱螲螳螴螵螶螷螸螹螺螻"
         ar_s<<"螼螽螾螿蟀蟁蟂蟃蟄蟅蟆蟇蟈蟉蟊蟋蟌蟍蟎蟏"
         ar_s<<"蟐蟑蟒蟓蟔蟕蟖蟗蟘蟙蟚蟛蟜蟝蟞蟟蟠蟡蟢蟣"
         ar_s<<"蟤蟥蟦蟧蟨蟩蟪蟫蟬蟭蟮蟯蟰蟱蟲蟳蟴蟵蟶蟷"
         ar_s<<"蟸蟹蟺蟻蟼蟽蟾蟿蠀蠁蠂蠃蠄蠅蠆蠇蠈蠉蠊蠋"
         ar_s<<"蠌蠍蠎蠏蠐蠑蠒蠓蠔蠕蠖蠗蠘蠙蠚蠛蠜蠝蠞蠟"
         ar_s<<"蠠蠡蠢蠣蠤蠥蠦蠧蠨蠩蠪蠫蠬蠭蠮蠯蠰蠱蠲蠳"
         ar_s<<"蠴蠵蠶蠷蠸蠹蠺蠻蠼蠽蠾蠿血衁衂衃衄衅衆衇"
         ar_s<<"衈衉衊衋行衍衎衏衐衑衒術衔衕衖街衘衙衚衛"
         ar_s<<"衜衝衞衟衠衡衢衣衤补衦衧表衩衪衫衬衭衮衯"
         ar_s<<"衰衱衲衳衴衵衶衷衸衹衺衻衼衽衾衿袀袁袂袃"
         ar_s<<"袄袅袆袇袈袉袊袋袌袍袎袏袐袑袒袓袔袕袖袗"
         ar_s<<"袘袙袚袛袜袝袞袟袠袡袢袣袤袥袦袧袨袩袪被"
         ar_s<<"袬袭袮袯袰袱袲袳袴袵袶袷袸袹袺袻袼袽袾袿"
         ar_s<<"裀裁裂裃裄装裆裇裈裉裊裋裌裍裎裏裐裑裒裓"
         ar_s<<"裔裕裖裗裘裙裚裛補裝裞裟裠裡裢裣裤裥裦裧"
         ar_s<<"裨裩裪裫裬裭裮裯裰裱裲裳裴裵裶裷裸裹裺裻"
         ar_s<<"裼製裾裿褀褁褂褃褄褅褆複褈褉褊褋褌褍褎褏"
         ar_s<<"褐褑褒褓褔褕褖褗褘褙褚褛褜褝褞褟褠褡褢褣"
         ar_s<<"褤褥褦褧褨褩褪褫褬褭褮褯褰褱褲褳褴褵褶褷"
         ar_s<<"褸褹褺褻褼褽褾褿襀襁襂襃襄襅襆襇襈襉襊襋"
         ar_s<<"襌襍襎襏襐襑襒襓襔襕襖襗襘襙襚襛襜襝襞襟"
         ar_s<<"襠襡襢襣襤襥襦襧襨襩襪襫襬襭襮襯襰襱襲襳"
         ar_s<<"襴襵襶襷襸襹襺襻襼襽襾西覀要覂覃覄覅覆覇"
         ar_s<<"覈覉覊見覌覍覎規覐覑覒覓覔覕視覗覘覙覚覛"
         ar_s<<"覜覝覞覟覠覡覢覣覤覥覦覧覨覩親覫覬覭覮覯"
         ar_s<<"覰覱覲観覴覵覶覷覸覹覺覻覼覽覾覿觀见观觃"
         ar_s<<"规觅视觇览觉觊觋觌觍觎觏觐觑角觓觔觕觖觗"
         ar_s<<"觘觙觚觛觜觝觞觟觠觡觢解觤觥触觧觨觩觪觫"
         ar_s<<"觬觭觮觯觰觱觲觳觴觵觶觷觸觹觺觻觼觽觾觿"
         ar_s<<"言訁訂訃訄訅訆訇計訉訊訋訌訍討訏訐訑訒訓"
         ar_s<<"訔訕訖託記訙訚訛訜訝訞訟訠訡訢訣訤訥訦訧"
         ar_s<<"訨訩訪訫訬設訮訯訰許訲訳訴訵訶訷訸訹診註"
         ar_s<<"証訽訾訿詀詁詂詃詄詅詆詇詈詉詊詋詌詍詎詏"
         ar_s<<"詐詑詒詓詔評詖詗詘詙詚詛詜詝詞詟詠詡詢詣"
         ar_s<<"詤詥試詧詨詩詪詫詬詭詮詯詰話該詳詴詵詶詷"
         ar_s<<"詸詹詺詻詼詽詾詿誀誁誂誃誄誅誆誇誈誉誊誋"
         ar_s<<"誌認誎誏誐誑誒誓誔誕誖誗誘誙誚誛誜誝語誟"
         ar_s<<"誠誡誢誣誤誥誦誧誨誩說誫説読誮誯誰誱課誳"
         ar_s<<"誴誵誶誷誸誹誺誻誼誽誾調諀諁諂諃諄諅諆談"
         ar_s<<"諈諉諊請諌諍諎諏諐諑諒諓諔諕論諗諘諙諚諛"
         ar_s<<"諜諝諞諟諠諡諢諣諤諥諦諧諨諩諪諫諬諭諮諯"
         ar_s<<"諰諱諲諳諴諵諶諷諸諹諺諻諼諽諾諿謀謁謂謃"
         ar_s<<"謄謅謆謇謈謉謊謋謌謍謎謏謐謑謒謓謔謕謖謗"
         ar_s<<"謘謙謚講謜謝謞謟謠謡謢謣謤謥謦謧謨謩謪謫"
         ar_s<<"謬謭謮謯謰謱謲謳謴謵謶謷謸謹謺謻謼謽謾謿"
         ar_s<<"譀譁譂譃譄譅譆譇譈證譊譋譌譍譎譏譐譑譒譓"
         ar_s<<"譔譕譖譗識譙譚譛譜譝譞譟譠譡譢譣譤譥警譧"
         ar_s<<"譨譩譪譫譬譭譮譯議譱譲譳譴譵譶護譸譹譺譻"
         ar_s<<"譼譽譾譿讀讁讂讃讄讅讆讇讈讉變讋讌讍讎讏"
         ar_s<<"讐讑讒讓讔讕讖讗讘讙讚讛讜讝讞讟讠计订讣"
         ar_s<<"认讥讦讧讨让讪讫讬训议讯记讱讲讳讴讵讶讷"
         ar_s<<"许讹论讻讼讽设访诀证诂诃评诅识诇诈诉诊诋"
         ar_s<<"诌词诎诏诐译诒诓诔试诖诗诘诙诚诛诜话诞诟"
         ar_s<<"诠诡询诣诤该详诧诨诩诪诫诬语诮误诰诱诲诳"
         ar_s<<"说诵诶请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇"
         ar_s<<"谈谉谊谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛"
         ar_s<<"谜谝谞谟谠谡谢谣谤谥谦谧谨谩谪谫谬谭谮谯"
         ar_s<<"谰谱谲谳谴谵谶谷谸谹谺谻谼谽谾谿豀豁豂豃"
         ar_s<<"豄豅豆豇豈豉豊豋豌豍豎豏豐豑豒豓豔豕豖豗"
         ar_s<<"豘豙豚豛豜豝豞豟豠象豢豣豤豥豦豧豨豩豪豫"
         ar_s<<"豬豭豮豯豰豱豲豳豴豵豶豷豸豹豺豻豼豽豾豿"
         ar_s<<"貀貁貂貃貄貅貆貇貈貉貊貋貌貍貎貏貐貑貒貓"
         ar_s<<"貔貕貖貗貘貙貚貛貜貝貞貟負財貢貣貤貥貦貧"
         ar_s<<"貨販貪貫責貭貮貯貰貱貲貳貴貵貶買貸貹貺費"
         ar_s<<"貼貽貾貿賀賁賂賃賄賅賆資賈賉賊賋賌賍賎賏"
         ar_s<<"賐賑賒賓賔賕賖賗賘賙賚賛賜賝賞賟賠賡賢賣"
         ar_s<<"賤賥賦賧賨賩質賫賬賭賮賯賰賱賲賳賴賵賶賷"
         ar_s<<"賸賹賺賻購賽賾賿贀贁贂贃贄贅贆贇贈贉贊贋"
         ar_s<<"贌贍贎贏贐贑贒贓贔贕贖贗贘贙贚贛贜贝贞负"
         ar_s<<"贠贡财责贤败账货质贩贪贫贬购贮贯贰贱贲贳"
         ar_s<<"贴贵贶贷贸费贺贻贼贽贾贿赀赁赂赃资赅赆赇"
         ar_s<<"赈赉赊赋赌赍赎赏赐赑赒赓赔赕赖赗赘赙赚赛"
         ar_s<<"赜赝赞赟赠赡赢赣赤赥赦赧赨赩赪赫赬赭赮赯"
         ar_s<<"走赱赲赳赴赵赶起赸赹赺赻赼赽赾赿趀趁趂趃"
         ar_s<<"趄超趆趇趈趉越趋趌趍趎趏趐趑趒趓趔趕趖趗"
         ar_s<<"趘趙趚趛趜趝趞趟趠趡趢趣趤趥趦趧趨趩趪趫"
         ar_s<<"趬趭趮趯趰趱趲足趴趵趶趷趸趹趺趻趼趽趾趿"
         ar_s<<"跀跁跂跃跄跅跆跇跈跉跊跋跌跍跎跏跐跑跒跓"
         ar_s<<"跔跕跖跗跘跙跚跛跜距跞跟跠跡跢跣跤跥跦跧"
         ar_s<<"跨跩跪跫跬跭跮路跰跱跲跳跴践跶跷跸跹跺跻"
         ar_s<<"跼跽跾跿踀踁踂踃踄踅踆踇踈踉踊踋踌踍踎踏"
         ar_s<<"踐踑踒踓踔踕踖踗踘踙踚踛踜踝踞踟踠踡踢踣"
         ar_s<<"踤踥踦踧踨踩踪踫踬踭踮踯踰踱踲踳踴踵踶踷"
         ar_s<<"踸踹踺踻踼踽踾踿蹀蹁蹂蹃蹄蹅蹆蹇蹈蹉蹊蹋"
         ar_s<<"蹌蹍蹎蹏蹐蹑蹒蹓蹔蹕蹖蹗蹘蹙蹚蹛蹜蹝蹞蹟"
         ar_s<<"蹠蹡蹢蹣蹤蹥蹦蹧蹨蹩蹪蹫蹬蹭蹮蹯蹰蹱蹲蹳"
         ar_s<<"蹴蹵蹶蹷蹸蹹蹺蹻蹼蹽蹾蹿躀躁躂躃躄躅躆躇"
         ar_s<<"躈躉躊躋躌躍躎躏躐躑躒躓躔躕躖躗躘躙躚躛"
         ar_s<<"躜躝躞躟躠躡躢躣躤躥躦躧躨躩躪身躬躭躮躯"
         ar_s<<"躰躱躲躳躴躵躶躷躸躹躺躻躼躽躾躿軀軁軂軃"
         ar_s<<"軄軅軆軇軈軉車軋軌軍軎軏軐軑軒軓軔軕軖軗"
         ar_s<<"軘軙軚軛軜軝軞軟軠軡転軣軤軥軦軧軨軩軪軫"
         ar_s<<"軬軭軮軯軰軱軲軳軴軵軶軷軸軹軺軻軼軽軾軿"
         ar_s<<"輀輁輂較輄輅輆輇輈載輊輋輌輍輎輏輐輑輒輓"
         ar_s<<"輔輕輖輗輘輙輚輛輜輝輞輟輠輡輢輣輤輥輦輧"
         ar_s<<"輨輩輪輫輬輭輮輯輰輱輲輳輴輵輶輷輸輹輺輻"
         ar_s<<"輼輽輾輿轀轁轂轃轄轅轆轇轈轉轊轋轌轍轎轏"
         ar_s<<"轐轑轒轓轔轕轖轗轘轙轚轛轜轝轞轟轠轡轢轣"
         ar_s<<"轤轥车轧轨轩轪轫转轭轮软轰轱轲轳轴轵轶轷"
         ar_s<<"轸轹轺轻轼载轾轿辀辁辂较辄辅辆辇辈辉辊辋"
         ar_s<<"辌辍辎辏辐辑辒输辔辕辖辗辘辙辚辛辜辝辞辟"
         ar_s<<"辠辡辢辣辤辥辦辧辨辩辪辫辬辭辮辯辰辱農辳"
         ar_s<<"辴辵辶辷辸边辺辻込辽达辿迀迁迂迃迄迅迆过"
         ar_s<<"迈迉迊迋迌迍迎迏运近迒迓返迕迖迗还这迚进"
         ar_s<<"远违连迟迠迡迢迣迤迥迦迧迨迩迪迫迬迭迮迯"
         ar_s<<"述迱迲迳迴迵迶迷迸迹迺迻迼追迾迿退送适逃"
         ar_s<<"逄逅逆逇逈选逊逋逌逍逎透逐逑递逓途逕逖逗"
         ar_s<<"逘這通逛逜逝逞速造逡逢連逤逥逦逧逨逩逪逫"
         ar_s<<"逬逭逮逯逰週進逳逴逵逶逷逸逹逺逻逼逽逾逿"
         ar_s<<"遀遁遂遃遄遅遆遇遈遉遊運遌遍過遏遐遑遒道"
         ar_s<<"達違遖遗遘遙遚遛遜遝遞遟遠遡遢遣遤遥遦遧"
         ar_s<<"遨適遪遫遬遭遮遯遰遱遲遳遴遵遶遷選遹遺遻"
         ar_s<<"遼遽遾避邀邁邂邃還邅邆邇邈邉邊邋邌邍邎邏"
         ar_s<<"邐邑邒邓邔邕邖邗邘邙邚邛邜邝邞邟邠邡邢那"
         ar_s<<"邤邥邦邧邨邩邪邫邬邭邮邯邰邱邲邳邴邵邶邷"
         ar_s<<"邸邹邺邻邼邽邾邿郀郁郂郃郄郅郆郇郈郉郊郋"
         ar_s<<"郌郍郎郏郐郑郒郓郔郕郖郗郘郙郚郛郜郝郞郟"
         ar_s<<"郠郡郢郣郤郥郦郧部郩郪郫郬郭郮郯郰郱郲郳"
         ar_s<<"郴郵郶郷郸郹郺郻郼都郾郿鄀鄁鄂鄃鄄鄅鄆鄇"
         ar_s<<"鄈鄉鄊鄋鄌鄍鄎鄏鄐鄑鄒鄓鄔鄕鄖鄗鄘鄙鄚鄛"
         ar_s<<"鄜鄝鄞鄟鄠鄡鄢鄣鄤鄥鄦鄧鄨鄩鄪鄫鄬鄭鄮鄯"
         ar_s<<"鄰鄱鄲鄳鄴鄵鄶鄷鄸鄹鄺鄻鄼鄽鄾鄿酀酁酂酃"
         ar_s<<"酄酅酆酇酈酉酊酋酌配酎酏酐酑酒酓酔酕酖酗"
         ar_s<<"酘酙酚酛酜酝酞酟酠酡酢酣酤酥酦酧酨酩酪酫"
         ar_s<<"酬酭酮酯酰酱酲酳酴酵酶酷酸酹酺酻酼酽酾酿"
         ar_s<<"醀醁醂醃醄醅醆醇醈醉醊醋醌醍醎醏醐醑醒醓"
         ar_s<<"醔醕醖醗醘醙醚醛醜醝醞醟醠醡醢醣醤醥醦醧"
         ar_s<<"醨醩醪醫醬醭醮醯醰醱醲醳醴醵醶醷醸醹醺醻"
         ar_s<<"醼醽醾醿釀釁釂釃釄釅釆采釈釉释釋里重野量"
         ar_s<<"釐金釒釓釔釕釖釗釘釙釚釛釜針釞釟釠釡釢釣"
         ar_s<<"釤釥釦釧釨釩釪釫釬釭釮釯釰釱釲釳釴釵釶釷"
         ar_s<<"釸釹釺釻釼釽釾釿鈀鈁鈂鈃鈄鈅鈆鈇鈈鈉鈊鈋"
         ar_s<<"鈌鈍鈎鈏鈐鈑鈒鈓鈔鈕鈖鈗鈘鈙鈚鈛鈜鈝鈞鈟"
         ar_s<<"鈠鈡鈢鈣鈤鈥鈦鈧鈨鈩鈪鈫鈬鈭鈮鈯鈰鈱鈲鈳"
         ar_s<<"鈴鈵鈶鈷鈸鈹鈺鈻鈼鈽鈾鈿鉀鉁鉂鉃鉄鉅鉆鉇"
         ar_s<<"鉈鉉鉊鉋鉌鉍鉎鉏鉐鉑鉒鉓鉔鉕鉖鉗鉘鉙鉚鉛"
         ar_s<<"鉜鉝鉞鉟鉠鉡鉢鉣鉤鉥鉦鉧鉨鉩鉪鉫鉬鉭鉮鉯"
         ar_s<<"鉰鉱鉲鉳鉴鉵鉶鉷鉸鉹鉺鉻鉼鉽鉾鉿銀銁銂銃"
         ar_s<<"銄銅銆銇銈銉銊銋銌銍銎銏銐銑銒銓銔銕銖銗"
         ar_s<<"銘銙銚銛銜銝銞銟銠銡銢銣銤銥銦銧銨銩銪銫"
         ar_s<<"銬銭銮銯銰銱銲銳銴銵銶銷銸銹銺銻銼銽銾銿"
         ar_s<<"鋀鋁鋂鋃鋄鋅鋆鋇鋈鋉鋊鋋鋌鋍鋎鋏鋐鋑鋒鋓"
         ar_s<<"鋔鋕鋖鋗鋘鋙鋚鋛鋜鋝鋞鋟鋠鋡鋢鋣鋤鋥鋦鋧"
         ar_s<<"鋨鋩鋪鋫鋬鋭鋮鋯鋰鋱鋲鋳鋴鋵鋶鋷鋸鋹鋺鋻"
         ar_s<<"鋼鋽鋾鋿錀錁錂錃錄錅錆錇錈錉錊錋錌錍錎錏"
         ar_s<<"錐錑錒錓錔錕錖錗錘錙錚錛錜錝錞錟錠錡錢錣"
         ar_s<<"錤錥錦錧錨錩錪錫錬錭錮錯錰錱録錳錴錵錶錷"
         ar_s<<"錸錹錺錻錼錽錾錿鍀鍁鍂鍃鍄鍅鍆鍇鍈鍉鍊鍋"
         ar_s<<"鍌鍍鍎鍏鍐鍑鍒鍓鍔鍕鍖鍗鍘鍙鍚鍛鍜鍝鍞鍟"
         ar_s<<"鍠鍡鍢鍣鍤鍥鍦鍧鍨鍩鍪鍫鍬鍭鍮鍯鍰鍱鍲鍳"
         ar_s<<"鍴鍵鍶鍷鍸鍹鍺鍻鍼鍽鍾鍿鎀鎁鎂鎃鎄鎅鎆鎇"
         ar_s<<"鎈鎉鎊鎋鎌鎍鎎鎏鎐鎑鎒鎓鎔鎕鎖鎗鎘鎙鎚鎛"
         ar_s<<"鎜鎝鎞鎟鎠鎡鎢鎣鎤鎥鎦鎧鎨鎩鎪鎫鎬鎭鎮鎯"
         ar_s<<"鎰鎱鎲鎳鎴鎵鎶鎷鎸鎹鎺鎻鎼鎽鎾鎿鏀鏁鏂鏃"
         ar_s<<"鏄鏅鏆鏇鏈鏉鏊鏋鏌鏍鏎鏏鏐鏑鏒鏓鏔鏕鏖鏗"
         ar_s<<"鏘鏙鏚鏛鏜鏝鏞鏟鏠鏡鏢鏣鏤鏥鏦鏧鏨鏩鏪鏫"
         ar_s<<"鏬鏭鏮鏯鏰鏱鏲鏳鏴鏵鏶鏷鏸鏹鏺鏻鏼鏽鏾鏿"
         ar_s<<"鐀鐁鐂鐃鐄鐅鐆鐇鐈鐉鐊鐋鐌鐍鐎鐏鐐鐑鐒鐓"
         ar_s<<"鐔鐕鐖鐗鐘鐙鐚鐛鐜鐝鐞鐟鐠鐡鐢鐣鐤鐥鐦鐧"
         ar_s<<"鐨鐩鐪鐫鐬鐭鐮鐯鐰鐱鐲鐳鐴鐵鐶鐷鐸鐹鐺鐻"
         ar_s<<"鐼鐽鐾鐿鑀鑁鑂鑃鑄鑅鑆鑇鑈鑉鑊鑋鑌鑍鑎鑏"
         ar_s<<"鑐鑑鑒鑓鑔鑕鑖鑗鑘鑙鑚鑛鑜鑝鑞鑟鑠鑡鑢鑣"
         ar_s<<"鑤鑥鑦鑧鑨鑩鑪鑫鑬鑭鑮鑯鑰鑱鑲鑳鑴鑵鑶鑷"
         ar_s<<"鑸鑹鑺鑻鑼鑽鑾鑿钀钁钂钃钄钅钆钇针钉钊钋"
         ar_s<<"钌钍钎钏钐钑钒钓钔钕钖钗钘钙钚钛钜钝钞钟"
         ar_s<<"钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯钰钱钲钳"
         ar_s<<"钴钵钶钷钸钹钺钻钼钽钾钿铀铁铂铃铄铅铆铇"
         ar_s<<"铈铉铊铋铌铍铎铏铐铑铒铓铔铕铖铗铘铙铚铛"
         ar_s<<"铜铝铞铟铠铡铢铣铤铥铦铧铨铩铪铫铬铭铮铯"
         ar_s<<"铰铱铲铳铴铵银铷铸铹铺铻铼铽链铿销锁锂锃"
         ar_s<<"锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕锖锗"
         ar_s<<"锘错锚锛锜锝锞锟锠锡锢锣锤锥锦锧锨锩锪锫"
         ar_s<<"锬锭键锯锰锱锲锳锴锵锶锷锸锹锺锻锼锽锾锿"
         ar_s<<"镀镁镂镃镄镅镆镇镈镉镊镋镌镍镎镏镐镑镒镓"
         ar_s<<"镔镕镖镗镘镙镚镛镜镝镞镟镠镡镢镣镤镥镦镧"
         ar_s<<"镨镩镪镫镬镭镮镯镰镱镲镳镴镵镶長镸镹镺镻"
         ar_s<<"镼镽镾长門閁閂閃閄閅閆閇閈閉閊開閌閍閎閏"
         ar_s<<"閐閑閒間閔閕閖閗閘閙閚閛閜閝閞閟閠閡関閣"
         ar_s<<"閤閥閦閧閨閩閪閫閬閭閮閯閰閱閲閳閴閵閶閷"
         ar_s<<"閸閹閺閻閼閽閾閿闀闁闂闃闄闅闆闇闈闉闊闋"
         ar_s<<"闌闍闎闏闐闑闒闓闔闕闖闗闘闙闚闛關闝闞闟"
         ar_s<<"闠闡闢闣闤闥闦闧门闩闪闫闬闭问闯闰闱闲闳"
         ar_s<<"间闵闶闷闸闹闺闻闼闽闾闿阀阁阂阃阄阅阆阇"
         ar_s<<"阈阉阊阋阌阍阎阏阐阑阒阓阔阕阖阗阘阙阚阛"
         ar_s<<"阜阝阞队阠阡阢阣阤阥阦阧阨阩阪阫阬阭阮阯"
         ar_s<<"阰阱防阳阴阵阶阷阸阹阺阻阼阽阾阿陀陁陂陃"
         ar_s<<"附际陆陇陈陉陊陋陌降陎陏限陑陒陓陔陕陖陗"
         ar_s<<"陘陙陚陛陜陝陞陟陠陡院陣除陥陦陧陨险陪陫"
         ar_s<<"陬陭陮陯陰陱陲陳陴陵陶陷陸陹険陻陼陽陾陿"
         ar_s<<"隀隁隂隃隄隅隆隇隈隉隊隋隌隍階随隐隑隒隓"
         ar_s<<"隔隕隖隗隘隙隚際障隝隞隟隠隡隢隣隤隥隦隧"
         ar_s<<"隨隩險隫隬隭隮隯隰隱隲隳隴隵隶隷隸隹隺隻"
         ar_s<<"隼隽难隿雀雁雂雃雄雅集雇雈雉雊雋雌雍雎雏"
         ar_s<<"雐雑雒雓雔雕雖雗雘雙雚雛雜雝雞雟雠雡離難"
         ar_s<<"雤雥雦雧雨雩雪雫雬雭雮雯雰雱雲雳雴雵零雷"
         ar_s<<"雸雹雺電雼雽雾雿需霁霂霃霄霅霆震霈霉霊霋"
         ar_s<<"霌霍霎霏霐霑霒霓霔霕霖霗霘霙霚霛霜霝霞霟"
         ar_s<<"霠霡霢霣霤霥霦霧霨霩霪霫霬霭霮霯霰霱露霳"
         ar_s<<"霴霵霶霷霸霹霺霻霼霽霾霿靀靁靂靃靄靅靆靇"
         ar_s<<"靈靉靊靋靌靍靎靏靐靑青靓靔靕靖靗靘静靚靛"
         ar_s<<"靜靝非靟靠靡面靣靤靥靦靧靨革靪靫靬靭靮靯"
         ar_s<<"靰靱靲靳靴靵靶靷靸靹靺靻靼靽靾靿鞀鞁鞂鞃"
         ar_s<<"鞄鞅鞆鞇鞈鞉鞊鞋鞌鞍鞎鞏鞐鞑鞒鞓鞔鞕鞖鞗"
         ar_s<<"鞘鞙鞚鞛鞜鞝鞞鞟鞠鞡鞢鞣鞤鞥鞦鞧鞨鞩鞪鞫"
         ar_s<<"鞬鞭鞮鞯鞰鞱鞲鞳鞴鞵鞶鞷鞸鞹鞺鞻鞼鞽鞾鞿"
         ar_s<<"韀韁韂韃韄韅韆韇韈韉韊韋韌韍韎韏韐韑韒韓"
         ar_s<<"韔韕韖韗韘韙韚韛韜韝韞韟韠韡韢韣韤韥韦韧"
         ar_s<<"韨韩韪韫韬韭韮韯韰韱韲音韴韵韶韷韸韹韺韻"
         ar_s<<"韼韽韾響頀頁頂頃頄項順頇須頉頊頋頌頍頎頏"
         ar_s<<"預頑頒頓頔頕頖頗領頙頚頛頜頝頞頟頠頡頢頣"
         ar_s<<"頤頥頦頧頨頩頪頫頬頭頮頯頰頱頲頳頴頵頶頷"
         ar_s<<"頸頹頺頻頼頽頾頿顀顁顂顃顄顅顆顇顈顉顊顋"
         ar_s<<"題額顎顏顐顑顒顓顔顕顖顗願顙顚顛顜顝類顟"
         ar_s<<"顠顡顢顣顤顥顦顧顨顩顪顫顬顭顮顯顰顱顲顳"
         ar_s<<"顴页顶顷顸项顺须顼顽顾顿颀颁颂颃预颅领颇"
         ar_s<<"颈颉颊颋颌颍颎颏颐频颒颓颔颕颖颗题颙颚颛"
         ar_s<<"颜额颞颟颠颡颢颣颤颥颦颧風颩颪颫颬颭颮颯"
         ar_s<<"颰颱颲颳颴颵颶颷颸颹颺颻颼颽颾颿飀飁飂飃"
         ar_s<<"飄飅飆飇飈飉飊飋飌飍风飏飐飑飒飓飔飕飖飗"
         ar_s<<"飘飙飚飛飜飝飞食飠飡飢飣飤飥飦飧飨飩飪飫"
         ar_s<<"飬飭飮飯飰飱飲飳飴飵飶飷飸飹飺飻飼飽飾飿"
         ar_s<<"餀餁餂餃餄餅餆餇餈餉養餋餌餍餎餏餐餑餒餓"
         ar_s<<"餔餕餖餗餘餙餚餛餜餝餞餟餠餡餢餣餤餥餦餧"
         ar_s<<"館餩餪餫餬餭餮餯餰餱餲餳餴餵餶餷餸餹餺餻"
         ar_s<<"餼餽餾餿饀饁饂饃饄饅饆饇饈饉饊饋饌饍饎饏"
         ar_s<<"饐饑饒饓饔饕饖饗饘饙饚饛饜饝饞饟饠饡饢饣"
         ar_s<<"饤饥饦饧饨饩饪饫饬饭饮饯饰饱饲饳饴饵饶饷"
         ar_s<<"饸饹饺饻饼饽饾饿馀馁馂馃馄馅馆馇馈馉馊馋"
         ar_s<<"馌馍馎馏馐馑馒馓馔馕首馗馘香馚馛馜馝馞馟"
         ar_s<<"馠馡馢馣馤馥馦馧馨馩馪馫馬馭馮馯馰馱馲馳"
         ar_s<<"馴馵馶馷馸馹馺馻馼馽馾馿駀駁駂駃駄駅駆駇"
         ar_s<<"駈駉駊駋駌駍駎駏駐駑駒駓駔駕駖駗駘駙駚駛"
         ar_s<<"駜駝駞駟駠駡駢駣駤駥駦駧駨駩駪駫駬駭駮駯"
         ar_s<<"駰駱駲駳駴駵駶駷駸駹駺駻駼駽駾駿騀騁騂騃"
         ar_s<<"騄騅騆騇騈騉騊騋騌騍騎騏騐騑騒験騔騕騖騗"
         ar_s<<"騘騙騚騛騜騝騞騟騠騡騢騣騤騥騦騧騨騩騪騫"
         ar_s<<"騬騭騮騯騰騱騲騳騴騵騶騷騸騹騺騻騼騽騾騿"
         ar_s<<"驀驁驂驃驄驅驆驇驈驉驊驋驌驍驎驏驐驑驒驓"
         ar_s<<"驔驕驖驗驘驙驚驛驜驝驞驟驠驡驢驣驤驥驦驧"
         ar_s<<"驨驩驪驫马驭驮驯驰驱驲驳驴驵驶驷驸驹驺驻"
         ar_s<<"驼驽驾驿骀骁骂骃骄骅骆骇骈骉骊骋验骍骎骏"
         ar_s<<"骐骑骒骓骔骕骖骗骘骙骚骛骜骝骞骟骠骡骢骣"
         ar_s<<"骤骥骦骧骨骩骪骫骬骭骮骯骰骱骲骳骴骵骶骷"
         ar_s<<"骸骹骺骻骼骽骾骿髀髁髂髃髄髅髆髇髈髉髊髋"
         ar_s<<"髌髍髎髏髐髑髒髓體髕髖髗高髙髚髛髜髝髞髟"
         ar_s<<"髠髡髢髣髤髥髦髧髨髩髪髫髬髭髮髯髰髱髲髳"
         ar_s<<"髴髵髶髷髸髹髺髻髼髽髾髿鬀鬁鬂鬃鬄鬅鬆鬇"
         ar_s<<"鬈鬉鬊鬋鬌鬍鬎鬏鬐鬑鬒鬓鬔鬕鬖鬗鬘鬙鬚鬛"
         ar_s<<"鬜鬝鬞鬟鬠鬡鬢鬣鬤鬥鬦鬧鬨鬩鬪鬫鬬鬭鬮鬯"
         ar_s<<"鬰鬱鬲鬳鬴鬵鬶鬷鬸鬹鬺鬻鬼鬽鬾鬿魀魁魂魃"
         ar_s<<"魄魅魆魇魈魉魊魋魌魍魎魏魐魑魒魓魔魕魖魗"
         ar_s<<"魘魙魚魛魜魝魞魟魠魡魢魣魤魥魦魧魨魩魪魫"
         ar_s<<"魬魭魮魯魰魱魲魳魴魵魶魷魸魹魺魻魼魽魾魿"
         ar_s<<"鮀鮁鮂鮃鮄鮅鮆鮇鮈鮉鮊鮋鮌鮍鮎鮏鮐鮑鮒鮓"
         ar_s<<"鮔鮕鮖鮗鮘鮙鮚鮛鮜鮝鮞鮟鮠鮡鮢鮣鮤鮥鮦鮧"
         ar_s<<"鮨鮩鮪鮫鮬鮭鮮鮯鮰鮱鮲鮳鮴鮵鮶鮷鮸鮹鮺鮻"
         ar_s<<"鮼鮽鮾鮿鯀鯁鯂鯃鯄鯅鯆鯇鯈鯉鯊鯋鯌鯍鯎鯏"
         ar_s<<"鯐鯑鯒鯓鯔鯕鯖鯗鯘鯙鯚鯛鯜鯝鯞鯟鯠鯡鯢鯣"
         ar_s<<"鯤鯥鯦鯧鯨鯩鯪鯫鯬鯭鯮鯯鯰鯱鯲鯳鯴鯵鯶鯷"
         ar_s<<"鯸鯹鯺鯻鯼鯽鯾鯿鰀鰁鰂鰃鰄鰅鰆鰇鰈鰉鰊鰋"
         ar_s<<"鰌鰍鰎鰏鰐鰑鰒鰓鰔鰕鰖鰗鰘鰙鰚鰛鰜鰝鰞鰟"
         ar_s<<"鰠鰡鰢鰣鰤鰥鰦鰧鰨鰩鰪鰫鰬鰭鰮鰯鰰鰱鰲鰳"
         ar_s<<"鰴鰵鰶鰷鰸鰹鰺鰻鰼鰽鰾鰿鱀鱁鱂鱃鱄鱅鱆鱇"
         ar_s<<"鱈鱉鱊鱋鱌鱍鱎鱏鱐鱑鱒鱓鱔鱕鱖鱗鱘鱙鱚鱛"
         ar_s<<"鱜鱝鱞鱟鱠鱡鱢鱣鱤鱥鱦鱧鱨鱩鱪鱫鱬鱭鱮鱯"
         ar_s<<"鱰鱱鱲鱳鱴鱵鱶鱷鱸鱹鱺鱻鱼鱽鱾鱿鲀鲁鲂鲃"
         ar_s<<"鲄鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎鲏鲐鲑鲒鲓鲔鲕鲖鲗"
         ar_s<<"鲘鲙鲚鲛鲜鲝鲞鲟鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲪鲫"
         ar_s<<"鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲶鲷鲸鲹鲺鲻鲼鲽鲾鲿"
         ar_s<<"鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊鳋鳌鳍鳎鳏鳐鳑鳒鳓"
         ar_s<<"鳔鳕鳖鳗鳘鳙鳚鳛鳜鳝鳞鳟鳠鳡鳢鳣鳤鳥鳦鳧"
         ar_s<<"鳨鳩鳪鳫鳬鳭鳮鳯鳰鳱鳲鳳鳴鳵鳶鳷鳸鳹鳺鳻"
         ar_s<<"鳼鳽鳾鳿鴀鴁鴂鴃鴄鴅鴆鴇鴈鴉鴊鴋鴌鴍鴎鴏"
         ar_s<<"鴐鴑鴒鴓鴔鴕鴖鴗鴘鴙鴚鴛鴜鴝鴞鴟鴠鴡鴢鴣"
         ar_s<<"鴤鴥鴦鴧鴨鴩鴪鴫鴬鴭鴮鴯鴰鴱鴲鴳鴴鴵鴶鴷"
         ar_s<<"鴸鴹鴺鴻鴼鴽鴾鴿鵀鵁鵂鵃鵄鵅鵆鵇鵈鵉鵊鵋"
         ar_s<<"鵌鵍鵎鵏鵐鵑鵒鵓鵔鵕鵖鵗鵘鵙鵚鵛鵜鵝鵞鵟"
         ar_s<<"鵠鵡鵢鵣鵤鵥鵦鵧鵨鵩鵪鵫鵬鵭鵮鵯鵰鵱鵲鵳"
         ar_s<<"鵴鵵鵶鵷鵸鵹鵺鵻鵼鵽鵾鵿鶀鶁鶂鶃鶄鶅鶆鶇"
         ar_s<<"鶈鶉鶊鶋鶌鶍鶎鶏鶐鶑鶒鶓鶔鶕鶖鶗鶘鶙鶚鶛"
         ar_s<<"鶜鶝鶞鶟鶠鶡鶢鶣鶤鶥鶦鶧鶨鶩鶪鶫鶬鶭鶮鶯"
         ar_s<<"鶰鶱鶲鶳鶴鶵鶶鶷鶸鶹鶺鶻鶼鶽鶾鶿鷀鷁鷂鷃"
         ar_s<<"鷄鷅鷆鷇鷈鷉鷊鷋鷌鷍鷎鷏鷐鷑鷒鷓鷔鷕鷖鷗"
         ar_s<<"鷘鷙鷚鷛鷜鷝鷞鷟鷠鷡鷢鷣鷤鷥鷦鷧鷨鷩鷪鷫"
         ar_s<<"鷬鷭鷮鷯鷰鷱鷲鷳鷴鷵鷶鷷鷸鷹鷺鷻鷼鷽鷾鷿"
         ar_s<<"鸀鸁鸂鸃鸄鸅鸆鸇鸈鸉鸊鸋鸌鸍鸎鸏鸐鸑鸒鸓"
         ar_s<<"鸔鸕鸖鸗鸘鸙鸚鸛鸜鸝鸞鸟鸠鸡鸢鸣鸤鸥鸦鸧"
         ar_s<<"鸨鸩鸪鸫鸬鸭鸮鸯鸰鸱鸲鸳鸴鸵鸶鸷鸸鸹鸺鸻"
         ar_s<<"鸼鸽鸾鸿鹀鹁鹂鹃鹄鹅鹆鹇鹈鹉鹊鹋鹌鹍鹎鹏"
         ar_s<<"鹐鹑鹒鹓鹔鹕鹖鹗鹘鹙鹚鹛鹜鹝鹞鹟鹠鹡鹢鹣"
         ar_s<<"鹤鹥鹦鹧鹨鹩鹪鹫鹬鹭鹮鹯鹰鹱鹲鹳鹴鹵鹶鹷"
         ar_s<<"鹸鹹鹺鹻鹼鹽鹾鹿麀麁麂麃麄麅麆麇麈麉麊麋"
         ar_s<<"麌麍麎麏麐麑麒麓麔麕麖麗麘麙麚麛麜麝麞麟"
         ar_s<<"麠麡麢麣麤麥麦麧麨麩麪麫麬麭麮麯麰麱麲麳"
         ar_s<<"麴麵麶麷麸麹麺麻麼麽麾麿黀黁黂黃黄黅黆黇"
         ar_s<<"黈黉黊黋黌黍黎黏黐黑黒黓黔黕黖黗默黙黚黛"
         ar_s<<"黜黝點黟黠黡黢黣黤黥黦黧黨黩黪黫黬黭黮黯"
         ar_s<<"黰黱黲黳黴黵黶黷黸黹黺黻黼黽黾黿鼀鼁鼂鼃"
         ar_s<<"鼄鼅鼆鼇鼈鼉鼊鼋鼌鼍鼎鼏鼐鼑鼒鼓鼔鼕鼖鼗"
         ar_s<<"鼘鼙鼚鼛鼜鼝鼞鼟鼠鼡鼢鼣鼤鼥鼦鼧鼨鼩鼪鼫"
         ar_s<<"鼬鼭鼮鼯鼰鼱鼲鼳鼴鼵鼶鼷鼸鼹鼺鼻鼼鼽鼾鼿"
         ar_s<<"齀齁齂齃齄齅齆齇齈齉齊齋齌齍齎齏齐齑齒齓"
         ar_s<<"齔齕齖齗齘齙齚齛齜齝齞齟齠齡齢齣齤齥齦齧"
         ar_s<<"齨齩齪齫齬齭齮齯齰齱齲齳齴齵齶齷齸齹齺齻"
         ar_s<<"齼齽齾齿龀龁龂龃龄龅龆龇龈龉龊龋龌龍龎龏"
         ar_s<<"龐龑龒龓龔龕龖龗龘龙龚龛龜龝龞龟龠龡龢龣"
         ar_s<<"龤龥龦龧龨龩龪龫龬龭龮龯㐀㐁㐂㐃㐄㐅㐆㐇"
         ar_s<<"㐈㐉㐊㐋㐌㐍㐎㐏㐐㐑㐒㐓㐔㐕㐖㐗㐘㐙㐚㐛"
         ar_s<<"㐜㐝㐞㐟㐠㐡㐢㐣㐤㐥㐦㐧㐨㐩㐪㐫㐬㐭㐮㐯"
         ar_s<<"㐰㐱㐲㐳㐴㐵㐶㐷㐸㐹㐺㐻㐼㐽㐾㐿㑀㑁㑂㑃"
         ar_s<<"㑄㑅㑆㑇㑈㑉㑊㑋㑌㑍㑎㑏㑐㑑㑒㑓㑔㑕㑖㑗"
         ar_s<<"㑘㑙㑚㑛㑜㑝㑞㑟㑠㑡㑢㑣㑤㑥㑦㑧㑨㑩㑪㑫"
         ar_s<<"㑬㑭㑮㑯㑰㑱㑲㑳㑴㑵㑶㑷㑸㑹㑺㑻㑼㑽㑾㑿"
         ar_s<<"㒀㒁㒂㒃㒄㒅㒆㒇㒈㒉㒊㒋㒌㒍㒎㒏㒐㒑㒒㒓"
         ar_s<<"㒔㒕㒖㒗㒘㒙㒚㒛㒜㒝㒞㒟㒠㒡㒢㒣㒤㒥㒦㒧"
         ar_s<<"㒨㒩㒪㒫㒬㒭㒮㒯㒰㒱㒲㒳㒴㒵㒶㒷㒸㒹㒺㒻"
         ar_s<<"㒼㒽㒾㒿㓀㓁㓂㓃㓄㓅㓆㓇㓈㓉㓊㓋㓌㓍㓎㓏"
         ar_s<<"㓐㓑㓒㓓㓔㓕㓖㓗㓘㓙㓚㓛㓜㓝㓞㓟㓠㓡㓢㓣"
         ar_s<<"㓤㓥㓦㓧㓨㓩㓪㓫㓬㓭㓮㓯㓰㓱㓲㓳㓴㓵㓶㓷"
         ar_s<<"㓸㓹㓺㓻㓼㓽㓾㓿㔀㔁㔂㔃㔄㔅㔆㔇㔈㔉㔊㔋"
         ar_s<<"㔌㔍㔎㔏㔐㔑㔒㔓㔔㔕㔖㔗㔘㔙㔚㔛㔜㔝㔞㔟"
         ar_s<<"㔠㔡㔢㔣㔤㔥㔦㔧㔨㔩㔪㔫㔬㔭㔮㔯㔰㔱㔲㔳"
         ar_s<<"㔴㔵㔶㔷㔸㔹㔺㔻㔼㔽㔾㔿㕀㕁㕂㕃㕄㕅㕆㕇"
         ar_s<<"㕈㕉㕊㕋㕌㕍㕎㕏㕐㕑㕒㕓㕔㕕㕖㕗㕘㕙㕚㕛"
         ar_s<<"㕜㕝㕞㕟㕠㕡㕢㕣㕤㕥㕦㕧㕨㕩㕪㕫㕬㕭㕮㕯"
         ar_s<<"㕰㕱㕲㕳㕴㕵㕶㕷㕸㕹㕺㕻㕼㕽㕾㕿㖀㖁㖂㖃"
         ar_s<<"㖄㖅㖆㖇㖈㖉㖊㖋㖌㖍㖎㖏㖐㖑㖒㖓㖔㖕㖖㖗"
         ar_s<<"㖘㖙㖚㖛㖜㖝㖞㖟㖠㖡㖢㖣㖤㖥㖦㖧㖨㖩㖪㖫"
         ar_s<<"㖬㖭㖮㖯㖰㖱㖲㖳㖴㖵㖶㖷㖸㖹㖺㖻㖼㖽㖾㖿"
         ar_s<<"㗀㗁㗂㗃㗄㗅㗆㗇㗈㗉㗊㗋㗌㗍㗎㗏㗐㗑㗒㗓"
         ar_s<<"㗔㗕㗖㗗㗘㗙㗚㗛㗜㗝㗞㗟㗠㗡㗢㗣㗤㗥㗦㗧"
         ar_s<<"㗨㗩㗪㗫㗬㗭㗮㗯㗰㗱㗲㗳㗴㗵㗶㗷㗸㗹㗺㗻"
         ar_s<<"㗼㗽㗾㗿㘀㘁㘂㘃㘄㘅㘆㘇㘈㘉㘊㘋㘌㘍㘎㘏"
         ar_s<<"㘐㘑㘒㘓㘔㘕㘖㘗㘘㘙㘚㘛㘜㘝㘞㘟㘠㘡㘢㘣"
         ar_s<<"㘤㘥㘦㘧㘨㘩㘪㘫㘬㘭㘮㘯㘰㘱㘲㘳㘴㘵㘶㘷"
         ar_s<<"㘸㘹㘺㘻㘼㘽㘾㘿㙀㙁㙂㙃㙄㙅㙆㙇㙈㙉㙊㙋"
         ar_s<<"㙌㙍㙎㙏㙐㙑㙒㙓㙔㙕㙖㙗㙘㙙㙚㙛㙜㙝㙞㙟"
         ar_s<<"㙠㙡㙢㙣㙤㙥㙦㙧㙨㙩㙪㙫㙬㙭㙮㙯㙰㙱㙲㙳"
         ar_s<<"㙴㙵㙶㙷㙸㙹㙺㙻㙼㙽㙾㙿㚀㚁㚂㚃㚄㚅㚆㚇"
         ar_s<<"㚈㚉㚊㚋㚌㚍㚎㚏㚐㚑㚒㚓㚔㚕㚖㚗㚘㚙㚚㚛"
         ar_s<<"㚜㚝㚞㚟㚠㚡㚢㚣㚤㚥㚦㚧㚨㚩㚪㚫㚬㚭㚮㚯"
         ar_s<<"㚰㚱㚲㚳㚴㚵㚶㚷㚸㚹㚺㚻㚼㚽㚾㚿㛀㛁㛂㛃"
         ar_s<<"㛄㛅㛆㛇㛈㛉㛊㛋㛌㛍㛎㛏㛐㛑㛒㛓㛔㛕㛖㛗"
         ar_s<<"㛘㛙㛚㛛㛜㛝㛞㛟㛠㛡㛢㛣㛤㛥㛦㛧㛨㛩㛪㛫"
         ar_s<<"㛬㛭㛮㛯㛰㛱㛲㛳㛴㛵㛶㛷㛸㛹㛺㛻㛼㛽㛾㛿"
         ar_s<<"㜀㜁㜂㜃㜄㜅㜆㜇㜈㜉㜊㜋㜌㜍㜎㜏㜐㜑㜒㜓"
         ar_s<<"㜔㜕㜖㜗㜘㜙㜚㜛㜜㜝㜞㜟㜠㜡㜢㜣㜤㜥㜦㜧"
         ar_s<<"㜨㜩㜪㜫㜬㜭㜮㜯㜰㜱㜲㜳㜴㜵㜶㜷㜸㜹㜺㜻"
         ar_s<<"㜼㜽㜾㜿㝀㝁㝂㝃㝄㝅㝆㝇㝈㝉㝊㝋㝌㝍㝎㝏"
         ar_s<<"㝐㝑㝒㝓㝔㝕㝖㝗㝘㝙㝚㝛㝜㝝㝞㝟㝠㝡㝢㝣"
         ar_s<<"㝤㝥㝦㝧㝨㝩㝪㝫㝬㝭㝮㝯㝰㝱㝲㝳㝴㝵㝶㝷"
         ar_s<<"㝸㝹㝺㝻㝼㝽㝾㝿㞀㞁㞂㞃㞄㞅㞆㞇㞈㞉㞊㞋"
         ar_s<<"㞌㞍㞎㞏㞐㞑㞒㞓㞔㞕㞖㞗㞘㞙㞚㞛㞜㞝㞞㞟"
         ar_s<<"㞠㞡㞢㞣㞤㞥㞦㞧㞨㞩㞪㞫㞬㞭㞮㞯㞰㞱㞲㞳"
         ar_s<<"㞴㞵㞶㞷㞸㞹㞺㞻㞼㞽㞾㞿㟀㟁㟂㟃㟄㟅㟆㟇"
         ar_s<<"㟈㟉㟊㟋㟌㟍㟎㟏㟐㟑㟒㟓㟔㟕㟖㟗㟘㟙㟚㟛"
         ar_s<<"㟜㟝㟞㟟㟠㟡㟢㟣㟤㟥㟦㟧㟨㟩㟪㟫㟬㟭㟮㟯"
         ar_s<<"㟰㟱㟲㟳㟴㟵㟶㟷㟸㟹㟺㟻㟼㟽㟾㟿㠀㠁㠂㠃"
         ar_s<<"㠄㠅㠆㠇㠈㠉㠊㠋㠌㠍㠎㠏㠐㠑㠒㠓㠔㠕㠖㠗"
         ar_s<<"㠘㠙㠚㠛㠜㠝㠞㠟㠠㠡㠢㠣㠤㠥㠦㠧㠨㠩㠪㠫"
         ar_s<<"㠬㠭㠮㠯㠰㠱㠲㠳㠴㠵㠶㠷㠸㠹㠺㠻㠼㠽㠾㠿"
         ar_s<<"㡀㡁㡂㡃㡄㡅㡆㡇㡈㡉㡊㡋㡌㡍㡎㡏㡐㡑㡒㡓"
         ar_s<<"㡔㡕㡖㡗㡘㡙㡚㡛㡜㡝㡞㡟㡠㡡㡢㡣㡤㡥㡦㡧"
         ar_s<<"㡨㡩㡪㡫㡬㡭㡮㡯㡰㡱㡲㡳㡴㡵㡶㡷㡸㡹㡺㡻"
         ar_s<<"㡼㡽㡾㡿㢀㢁㢂㢃㢄㢅㢆㢇㢈㢉㢊㢋㢌㢍㢎㢏"
         ar_s<<"㢐㢑㢒㢓㢔㢕㢖㢗㢘㢙㢚㢛㢜㢝㢞㢟㢠㢡㢢㢣"
         ar_s<<"㢤㢥㢦㢧㢨㢩㢪㢫㢬㢭㢮㢯㢰㢱㢲㢳㢴㢵㢶㢷"
         ar_s<<"㢸㢹㢺㢻㢼㢽㢾㢿㣀㣁㣂㣃㣄㣅㣆㣇㣈㣉㣊㣋"
         ar_s<<"㣌㣍㣎㣏㣐㣑㣒㣓㣔㣕㣖㣗㣘㣙㣚㣛㣜㣝㣞㣟"
         ar_s<<"㣠㣡㣢㣣㣤㣥㣦㣧㣨㣩㣪㣫㣬㣭㣮㣯㣰㣱㣲㣳"
         ar_s<<"㣴㣵㣶㣷㣸㣹㣺㣻㣼㣽㣾㣿㤀㤁㤂㤃㤄㤅㤆㤇"
         ar_s<<"㤈㤉㤊㤋㤌㤍㤎㤏㤐㤑㤒㤓㤔㤕㤖㤗㤘㤙㤚㤛"
         ar_s<<"㤜㤝㤞㤟㤠㤡㤢㤣㤤㤥㤦㤧㤨㤩㤪㤫㤬㤭㤮㤯"
         ar_s<<"㤰㤱㤲㤳㤴㤵㤶㤷㤸㤹㤺㤻㤼㤽㤾㤿㥀㥁㥂㥃"
         ar_s<<"㥄㥅㥆㥇㥈㥉㥊㥋㥌㥍㥎㥏㥐㥑㥒㥓㥔㥕㥖㥗"
         ar_s<<"㥘㥙㥚㥛㥜㥝㥞㥟㥠㥡㥢㥣㥤㥥㥦㥧㥨㥩㥪㥫"
         ar_s<<"㥬㥭㥮㥯㥰㥱㥲㥳㥴㥵㥶㥷㥸㥹㥺㥻㥼㥽㥾㥿"
         ar_s<<"㦀㦁㦂㦃㦄㦅㦆㦇㦈㦉㦊㦋㦌㦍㦎㦏㦐㦑㦒㦓"
         ar_s<<"㦔㦕㦖㦗㦘㦙㦚㦛㦜㦝㦞㦟㦠㦡㦢㦣㦤㦥㦦㦧"
         ar_s<<"㦨㦩㦪㦫㦬㦭㦮㦯㦰㦱㦲㦳㦴㦵㦶㦷㦸㦹㦺㦻"
         ar_s<<"㦼㦽㦾㦿㧀㧁㧂㧃㧄㧅㧆㧇㧈㧉㧊㧋㧌㧍㧎㧏"
         ar_s<<"㧐㧑㧒㧓㧔㧕㧖㧗㧘㧙㧚㧛㧜㧝㧞㧟㧠㧡㧢㧣"
         ar_s<<"㧤㧥㧦㧧㧨㧩㧪㧫㧬㧭㧮㧯㧰㧱㧲㧳㧴㧵㧶㧷"
         ar_s<<"㧸㧹㧺㧻㧼㧽㧾㧿㨀㨁㨂㨃㨄㨅㨆㨇㨈㨉㨊㨋"
         ar_s<<"㨌㨍㨎㨏㨐㨑㨒㨓㨔㨕㨖㨗㨘㨙㨚㨛㨜㨝㨞㨟"
         ar_s<<"㨠㨡㨢㨣㨤㨥㨦㨧㨨㨩㨪㨫㨬㨭㨮㨯㨰㨱㨲㨳"
         ar_s<<"㨴㨵㨶㨷㨸㨹㨺㨻㨼㨽㨾㨿㩀㩁㩂㩃㩄㩅㩆㩇"
         ar_s<<"㩈㩉㩊㩋㩌㩍㩎㩏㩐㩑㩒㩓㩔㩕㩖㩗㩘㩙㩚㩛"
         ar_s<<"㩜㩝㩞㩟㩠㩡㩢㩣㩤㩥㩦㩧㩨㩩㩪㩫㩬㩭㩮㩯"
         ar_s<<"㩰㩱㩲㩳㩴㩵㩶㩷㩸㩹㩺㩻㩼㩽㩾㩿㪀㪁㪂㪃"
         ar_s<<"㪄㪅㪆㪇㪈㪉㪊㪋㪌㪍㪎㪏㪐㪑㪒㪓㪔㪕㪖㪗"
         ar_s<<"㪘㪙㪚㪛㪜㪝㪞㪟㪠㪡㪢㪣㪤㪥㪦㪧㪨㪩㪪㪫"
         ar_s<<"㪬㪭㪮㪯㪰㪱㪲㪳㪴㪵㪶㪷㪸㪹㪺㪻㪼㪽㪾㪿"
         ar_s<<"㫀㫁㫂㫃㫄㫅㫆㫇㫈㫉㫊㫋㫌㫍㫎㫏㫐㫑㫒㫓"
         ar_s<<"㫔㫕㫖㫗㫘㫙㫚㫛㫜㫝㫞㫟㫠㫡㫢㫣㫤㫥㫦㫧"
         ar_s<<"㫨㫩㫪㫫㫬㫭㫮㫯㫰㫱㫲㫳㫴㫵㫶㫷㫸㫹㫺㫻"
         ar_s<<"㫼㫽㫾㫿㬀㬁㬂㬃㬄㬅㬆㬇㬈㬉㬊㬋㬌㬍㬎㬏"
         ar_s<<"㬐㬑㬒㬓㬔㬕㬖㬗㬘㬙㬚㬛㬜㬝㬞㬟㬠㬡㬢㬣"
         ar_s<<"㬤㬥㬦㬧㬨㬩㬪㬫㬬㬭㬮㬯㬰㬱㬲㬳㬴㬵㬶㬷"
         ar_s<<"㬸㬹㬺㬻㬼㬽㬾㬿㭀㭁㭂㭃㭄㭅㭆㭇㭈㭉㭊㭋"
         ar_s<<"㭌㭍㭎㭏㭐㭑㭒㭓㭔㭕㭖㭗㭘㭙㭚㭛㭜㭝㭞㭟"
         ar_s<<"㭠㭡㭢㭣㭤㭥㭦㭧㭨㭩㭪㭫㭬㭭㭮㭯㭰㭱㭲㭳"
         ar_s<<"㭴㭵㭶㭷㭸㭹㭺㭻㭼㭽㭾㭿㮀㮁㮂㮃㮄㮅㮆㮇"
         ar_s<<"㮈㮉㮊㮋㮌㮍㮎㮏㮐㮑㮒㮓㮔㮕㮖㮗㮘㮙㮚㮛"
         ar_s<<"㮜㮝㮞㮟㮠㮡㮢㮣㮤㮥㮦㮧㮨㮩㮪㮫㮬㮭㮮㮯"
         ar_s<<"㮰㮱㮲㮳㮴㮵㮶㮷㮸㮹㮺㮻㮼㮽㮾㮿㯀㯁㯂㯃"
         ar_s<<"㯄㯅㯆㯇㯈㯉㯊㯋㯌㯍㯎㯏㯐㯑㯒㯓㯔㯕㯖㯗"
         ar_s<<"㯘㯙㯚㯛㯜㯝㯞㯟㯠㯡㯢㯣㯤㯥㯦㯧㯨㯩㯪㯫"
         ar_s<<"㯬㯭㯮㯯㯰㯱㯲㯳㯴㯵㯶㯷㯸㯹㯺㯻㯼㯽㯾㯿"
         ar_s<<"㰀㰁㰂㰃㰄㰅㰆㰇㰈㰉㰊㰋㰌㰍㰎㰏㰐㰑㰒㰓"
         ar_s<<"㰔㰕㰖㰗㰘㰙㰚㰛㰜㰝㰞㰟㰠㰡㰢㰣㰤㰥㰦㰧"
         ar_s<<"㰨㰩㰪㰫㰬㰭㰮㰯㰰㰱㰲㰳㰴㰵㰶㰷㰸㰹㰺㰻"
         ar_s<<"㰼㰽㰾㰿㱀㱁㱂㱃㱄㱅㱆㱇㱈㱉㱊㱋㱌㱍㱎㱏"
         ar_s<<"㱐㱑㱒㱓㱔㱕㱖㱗㱘㱙㱚㱛㱜㱝㱞㱟㱠㱡㱢㱣"
         ar_s<<"㱤㱥㱦㱧㱨㱩㱪㱫㱬㱭㱮㱯㱰㱱㱲㱳㱴㱵㱶㱷"
         ar_s<<"㱸㱹㱺㱻㱼㱽㱾㱿㲀㲁㲂㲃㲄㲅㲆㲇㲈㲉㲊㲋"
         ar_s<<"㲌㲍㲎㲏㲐㲑㲒㲓㲔㲕㲖㲗㲘㲙㲚㲛㲜㲝㲞㲟"
         ar_s<<"㲠㲡㲢㲣㲤㲥㲦㲧㲨㲩㲪㲫㲬㲭㲮㲯㲰㲱㲲㲳"
         ar_s<<"㲴㲵㲶㲷㲸㲹㲺㲻㲼㲽㲾㲿㳀㳁㳂㳃㳄㳅㳆㳇"
         ar_s<<"㳈㳉㳊㳋㳌㳍㳎㳏㳐㳑㳒㳓㳔㳕㳖㳗㳘㳙㳚㳛"
         ar_s<<"㳜㳝㳞㳟㳠㳡㳢㳣㳤㳥㳦㳧㳨㳩㳪㳫㳬㳭㳮㳯"
         ar_s<<"㳰㳱㳲㳳㳴㳵㳶㳷㳸㳹㳺㳻㳼㳽㳾㳿㴀㴁㴂㴃"
         ar_s<<"㴄㴅㴆㴇㴈㴉㴊㴋㴌㴍㴎㴏㴐㴑㴒㴓㴔㴕㴖㴗"
         ar_s<<"㴘㴙㴚㴛㴜㴝㴞㴟㴠㴡㴢㴣㴤㴥㴦㴧㴨㴩㴪㴫"
         ar_s<<"㴬㴭㴮㴯㴰㴱㴲㴳㴴㴵㴶㴷㴸㴹㴺㴻㴼㴽㴾㴿"
         ar_s<<"㵀㵁㵂㵃㵄㵅㵆㵇㵈㵉㵊㵋㵌㵍㵎㵏㵐㵑㵒㵓"
         ar_s<<"㵔㵕㵖㵗㵘㵙㵚㵛㵜㵝㵞㵟㵠㵡㵢㵣㵤㵥㵦㵧"
         ar_s<<"㵨㵩㵪㵫㵬㵭㵮㵯㵰㵱㵲㵳㵴㵵㵶㵷㵸㵹㵺㵻"
         ar_s<<"㵼㵽㵾㵿㶀㶁㶂㶃㶄㶅㶆㶇㶈㶉㶊㶋㶌㶍㶎㶏"
         ar_s<<"㶐㶑㶒㶓㶔㶕㶖㶗㶘㶙㶚㶛㶜㶝㶞㶟㶠㶡㶢㶣"
         ar_s<<"㶤㶥㶦㶧㶨㶩㶪㶫㶬㶭㶮㶯㶰㶱㶲㶳㶴㶵㶶㶷"
         ar_s<<"㶸㶹㶺㶻㶼㶽㶾㶿㷀㷁㷂㷃㷄㷅㷆㷇㷈㷉㷊㷋"
         ar_s<<"㷌㷍㷎㷏㷐㷑㷒㷓㷔㷕㷖㷗㷘㷙㷚㷛㷜㷝㷞㷟"
         ar_s<<"㷠㷡㷢㷣㷤㷥㷦㷧㷨㷩㷪㷫㷬㷭㷮㷯㷰㷱㷲㷳"
         ar_s<<"㷴㷵㷶㷷㷸㷹㷺㷻㷼㷽㷾㷿㸀㸁㸂㸃㸄㸅㸆㸇"
         ar_s<<"㸈㸉㸊㸋㸌㸍㸎㸏㸐㸑㸒㸓㸔㸕㸖㸗㸘㸙㸚㸛"
         ar_s<<"㸜㸝㸞㸟㸠㸡㸢㸣㸤㸥㸦㸧㸨㸩㸪㸫㸬㸭㸮㸯"
         ar_s<<"㸰㸱㸲㸳㸴㸵㸶㸷㸸㸹㸺㸻㸼㸽㸾㸿㹀㹁㹂㹃"
         ar_s<<"㹄㹅㹆㹇㹈㹉㹊㹋㹌㹍㹎㹏㹐㹑㹒㹓㹔㹕㹖㹗"
         ar_s<<"㹘㹙㹚㹛㹜㹝㹞㹟㹠㹡㹢㹣㹤㹥㹦㹧㹨㹩㹪㹫"
         ar_s<<"㹬㹭㹮㹯㹰㹱㹲㹳㹴㹵㹶㹷㹸㹹㹺㹻㹼㹽㹾㹿"
         ar_s<<"㺀㺁㺂㺃㺄㺅㺆㺇㺈㺉㺊㺋㺌㺍㺎㺏㺐㺑㺒㺓"
         ar_s<<"㺔㺕㺖㺗㺘㺙㺚㺛㺜㺝㺞㺟㺠㺡㺢㺣㺤㺥㺦㺧"
         ar_s<<"㺨㺩㺪㺫㺬㺭㺮㺯㺰㺱㺲㺳㺴㺵㺶㺷㺸㺹㺺㺻"
         ar_s<<"㺼㺽㺾㺿㻀㻁㻂㻃㻄㻅㻆㻇㻈㻉㻊㻋㻌㻍㻎㻏"
         ar_s<<"㻐㻑㻒㻓㻔㻕㻖㻗㻘㻙㻚㻛㻜㻝㻞㻟㻠㻡㻢㻣"
         ar_s<<"㻤㻥㻦㻧㻨㻩㻪㻫㻬㻭㻮㻯㻰㻱㻲㻳㻴㻵㻶㻷"
         ar_s<<"㻸㻹㻺㻻㻼㻽㻾㻿㼀㼁㼂㼃㼄㼅㼆㼇㼈㼉㼊㼋"
         ar_s<<"㼌㼍㼎㼏㼐㼑㼒㼓㼔㼕㼖㼗㼘㼙㼚㼛㼜㼝㼞㼟"
         ar_s<<"㼠㼡㼢㼣㼤㼥㼦㼧㼨㼩㼪㼫㼬㼭㼮㼯㼰㼱㼲㼳"
         ar_s<<"㼴㼵㼶㼷㼸㼹㼺㼻㼼㼽㼾㼿㽀㽁㽂㽃㽄㽅㽆㽇"
         ar_s<<"㽈㽉㽊㽋㽌㽍㽎㽏㽐㽑㽒㽓㽔㽕㽖㽗㽘㽙㽚㽛"
         ar_s<<"㽜㽝㽞㽟㽠㽡㽢㽣㽤㽥㽦㽧㽨㽩㽪㽫㽬㽭㽮㽯"
         ar_s<<"㽰㽱㽲㽳㽴㽵㽶㽷㽸㽹㽺㽻㽼㽽㽾㽿㾀㾁㾂㾃"
         ar_s<<"㾄㾅㾆㾇㾈㾉㾊㾋㾌㾍㾎㾏㾐㾑㾒㾓㾔㾕㾖㾗"
         ar_s<<"㾘㾙㾚㾛㾜㾝㾞㾟㾠㾡㾢㾣㾤㾥㾦㾧㾨㾩㾪㾫"
         ar_s<<"㾬㾭㾮㾯㾰㾱㾲㾳㾴㾵㾶㾷㾸㾹㾺㾻㾼㾽㾾㾿"
         ar_s<<"㿀㿁㿂㿃㿄㿅㿆㿇㿈㿉㿊㿋㿌㿍㿎㿏㿐㿑㿒㿓"
         ar_s<<"㿔㿕㿖㿗㿘㿙㿚㿛㿜㿝㿞㿟㿠㿡㿢㿣㿤㿥㿦㿧"
         ar_s<<"㿨㿩㿪㿫㿬㿭㿮㿯㿰㿱㿲㿳㿴㿵㿶㿷㿸㿹㿺㿻"
         ar_s<<"㿼㿽㿾㿿䀀䀁䀂䀃䀄䀅䀆䀇䀈䀉䀊䀋䀌䀍䀎䀏"
         ar_s<<"䀐䀑䀒䀓䀔䀕䀖䀗䀘䀙䀚䀛䀜䀝䀞䀟䀠䀡䀢䀣"
         ar_s<<"䀤䀥䀦䀧䀨䀩䀪䀫䀬䀭䀮䀯䀰䀱䀲䀳䀴䀵䀶䀷"
         ar_s<<"䀸䀹䀺䀻䀼䀽䀾䀿䁀䁁䁂䁃䁄䁅䁆䁇䁈䁉䁊䁋"
         ar_s<<"䁌䁍䁎䁏䁐䁑䁒䁓䁔䁕䁖䁗䁘䁙䁚䁛䁜䁝䁞䁟"
         ar_s<<"䁠䁡䁢䁣䁤䁥䁦䁧䁨䁩䁪䁫䁬䁭䁮䁯䁰䁱䁲䁳"
         ar_s<<"䁴䁵䁶䁷䁸䁹䁺䁻䁼䁽䁾䁿䂀䂁䂂䂃䂄䂅䂆䂇"
         ar_s<<"䂈䂉䂊䂋䂌䂍䂎䂏䂐䂑䂒䂓䂔䂕䂖䂗䂘䂙䂚䂛"
         ar_s<<"䂜䂝䂞䂟䂠䂡䂢䂣䂤䂥䂦䂧䂨䂩䂪䂫䂬䂭䂮䂯"
         ar_s<<"䂰䂱䂲䂳䂴䂵䂶䂷䂸䂹䂺䂻䂼䂽䂾䂿䃀䃁䃂䃃"
         ar_s<<"䃄䃅䃆䃇䃈䃉䃊䃋䃌䃍䃎䃏䃐䃑䃒䃓䃔䃕䃖䃗"
         ar_s<<"䃘䃙䃚䃛䃜䃝䃞䃟䃠䃡䃢䃣䃤䃥䃦䃧䃨䃩䃪䃫"
         ar_s<<"䃬䃭䃮䃯䃰䃱䃲䃳䃴䃵䃶䃷䃸䃹䃺䃻䃼䃽䃾䃿"
         ar_s<<"䄀䄁䄂䄃䄄䄅䄆䄇䄈䄉䄊䄋䄌䄍䄎䄏䄐䄑䄒䄓"
         ar_s<<"䄔䄕䄖䄗䄘䄙䄚䄛䄜䄝䄞䄟䄠䄡䄢䄣䄤䄥䄦䄧"
         ar_s<<"䄨䄩䄪䄫䄬䄭䄮䄯䄰䄱䄲䄳䄴䄵䄶䄷䄸䄹䄺䄻"
         ar_s<<"䄼䄽䄾䄿䅀䅁䅂䅃䅄䅅䅆䅇䅈䅉䅊䅋䅌䅍䅎䅏"
         ar_s<<"䅐䅑䅒䅓䅔䅕䅖䅗䅘䅙䅚䅛䅜䅝䅞䅟䅠䅡䅢䅣"
         ar_s<<"䅤䅥䅦䅧䅨䅩䅪䅫䅬䅭䅮䅯䅰䅱䅲䅳䅴䅵䅶䅷"
         ar_s<<"䅸䅹䅺䅻䅼䅽䅾䅿䆀䆁䆂䆃䆄䆅䆆䆇䆈䆉䆊䆋"
         ar_s<<"䆌䆍䆎䆏䆐䆑䆒䆓䆔䆕䆖䆗䆘䆙䆚䆛䆜䆝䆞䆟"
         ar_s<<"䆠䆡䆢䆣䆤䆥䆦䆧䆨䆩䆪䆫䆬䆭䆮䆯䆰䆱䆲䆳"
         ar_s<<"䆴䆵䆶䆷䆸䆹䆺䆻䆼䆽䆾䆿䇀䇁䇂䇃䇄䇅䇆䇇"
         ar_s<<"䇈䇉䇊䇋䇌䇍䇎䇏䇐䇑䇒䇓䇔䇕䇖䇗䇘䇙䇚䇛"
         ar_s<<"䇜䇝䇞䇟䇠䇡䇢䇣䇤䇥䇦䇧䇨䇩䇪䇫䇬䇭䇮䇯"
         ar_s<<"䇰䇱䇲䇳䇴䇵䇶䇷䇸䇹䇺䇻䇼䇽䇾䇿䈀䈁䈂䈃"
         ar_s<<"䈄䈅䈆䈇䈈䈉䈊䈋䈌䈍䈎䈏䈐䈑䈒䈓䈔䈕䈖䈗"
         ar_s<<"䈘䈙䈚䈛䈜䈝䈞䈟䈠䈡䈢䈣䈤䈥䈦䈧䈨䈩䈪䈫"
         ar_s<<"䈬䈭䈮䈯䈰䈱䈲䈳䈴䈵䈶䈷䈸䈹䈺䈻䈼䈽䈾䈿"
         ar_s<<"䉀䉁䉂䉃䉄䉅䉆䉇䉈䉉䉊䉋䉌䉍䉎䉏䉐䉑䉒䉓"
         ar_s<<"䉔䉕䉖䉗䉘䉙䉚䉛䉜䉝䉞䉟䉠䉡䉢䉣䉤䉥䉦䉧"
         ar_s<<"䉨䉩䉪䉫䉬䉭䉮䉯䉰䉱䉲䉳䉴䉵䉶䉷䉸䉹䉺䉻"
         ar_s<<"䉼䉽䉾䉿䊀䊁䊂䊃䊄䊅䊆䊇䊈䊉䊊䊋䊌䊍䊎䊏"
         ar_s<<"䊐䊑䊒䊓䊔䊕䊖䊗䊘䊙䊚䊛䊜䊝䊞䊟䊠䊡䊢䊣"
         ar_s<<"䊤䊥䊦䊧䊨䊩䊪䊫䊬䊭䊮䊯䊰䊱䊲䊳䊴䊵䊶䊷"
         ar_s<<"䊸䊹䊺䊻䊼䊽䊾䊿䋀䋁䋂䋃䋄䋅䋆䋇䋈䋉䋊䋋"
         ar_s<<"䋌䋍䋎䋏䋐䋑䋒䋓䋔䋕䋖䋗䋘䋙䋚䋛䋜䋝䋞䋟"
         ar_s<<"䋠䋡䋢䋣䋤䋥䋦䋧䋨䋩䋪䋫䋬䋭䋮䋯䋰䋱䋲䋳"
         ar_s<<"䋴䋵䋶䋷䋸䋹䋺䋻䋼䋽䋾䋿䌀䌁䌂䌃䌄䌅䌆䌇"
         ar_s<<"䌈䌉䌊䌋䌌䌍䌎䌏䌐䌑䌒䌓䌔䌕䌖䌗䌘䌙䌚䌛"
         ar_s<<"䌜䌝䌞䌟䌠䌡䌢䌣䌤䌥䌦䌧䌨䌩䌪䌫䌬䌭䌮䌯"
         ar_s<<"䌰䌱䌲䌳䌴䌵䌶䌷䌸䌹䌺䌻䌼䌽䌾䌿䍀䍁䍂䍃"
         ar_s<<"䍄䍅䍆䍇䍈䍉䍊䍋䍌䍍䍎䍏䍐䍑䍒䍓䍔䍕䍖䍗"
         ar_s<<"䍘䍙䍚䍛䍜䍝䍞䍟䍠䍡䍢䍣䍤䍥䍦䍧䍨䍩䍪䍫"
         ar_s<<"䍬䍭䍮䍯䍰䍱䍲䍳䍴䍵䍶䍷䍸䍹䍺䍻䍼䍽䍾䍿"
         ar_s<<"䎀䎁䎂䎃䎄䎅䎆䎇䎈䎉䎊䎋䎌䎍䎎䎏䎐䎑䎒䎓"
         ar_s<<"䎔䎕䎖䎗䎘䎙䎚䎛䎜䎝䎞䎟䎠䎡䎢䎣䎤䎥䎦䎧"
         ar_s<<"䎨䎩䎪䎫䎬䎭䎮䎯䎰䎱䎲䎳䎴䎵䎶䎷䎸䎹䎺䎻"
         ar_s<<"䎼䎽䎾䎿䏀䏁䏂䏃䏄䏅䏆䏇䏈䏉䏊䏋䏌䏍䏎䏏"
         ar_s<<"䏐䏑䏒䏓䏔䏕䏖䏗䏘䏙䏚䏛䏜䏝䏞䏟䏠䏡䏢䏣"
         ar_s<<"䏤䏥䏦䏧䏨䏩䏪䏫䏬䏭䏮䏯䏰䏱䏲䏳䏴䏵䏶䏷"
         ar_s<<"䏸䏹䏺䏻䏼䏽䏾䏿䐀䐁䐂䐃䐄䐅䐆䐇䐈䐉䐊䐋"
         ar_s<<"䐌䐍䐎䐏䐐䐑䐒䐓䐔䐕䐖䐗䐘䐙䐚䐛䐜䐝䐞䐟"
         ar_s<<"䐠䐡䐢䐣䐤䐥䐦䐧䐨䐩䐪䐫䐬䐭䐮䐯䐰䐱䐲䐳"
         ar_s<<"䐴䐵䐶䐷䐸䐹䐺䐻䐼䐽䐾䐿䑀䑁䑂䑃䑄䑅䑆䑇"
         ar_s<<"䑈䑉䑊䑋䑌䑍䑎䑏䑐䑑䑒䑓䑔䑕䑖䑗䑘䑙䑚䑛"
         ar_s<<"䑜䑝䑞䑟䑠䑡䑢䑣䑤䑥䑦䑧䑨䑩䑪䑫䑬䑭䑮䑯"
         ar_s<<"䑰䑱䑲䑳䑴䑵䑶䑷䑸䑹䑺䑻䑼䑽䑾䑿䒀䒁䒂䒃"
         ar_s<<"䒄䒅䒆䒇䒈䒉䒊䒋䒌䒍䒎䒏䒐䒑䒒䒓䒔䒕䒖䒗"
         ar_s<<"䒘䒙䒚䒛䒜䒝䒞䒟䒠䒡䒢䒣䒤䒥䒦䒧䒨䒩䒪䒫"
         ar_s<<"䒬䒭䒮䒯䒰䒱䒲䒳䒴䒵䒶䒷䒸䒹䒺䒻䒼䒽䒾䒿"
         ar_s<<"䓀䓁䓂䓃䓄䓅䓆䓇䓈䓉䓊䓋䓌䓍䓎䓏䓐䓑䓒䓓"
         ar_s<<"䓔䓕䓖䓗䓘䓙䓚䓛䓜䓝䓞䓟䓠䓡䓢䓣䓤䓥䓦䓧"
         ar_s<<"䓨䓩䓪䓫䓬䓭䓮䓯䓰䓱䓲䓳䓴䓵䓶䓷䓸䓹䓺䓻"
         ar_s<<"䓼䓽䓾䓿䔀䔁䔂䔃䔄䔅䔆䔇䔈䔉䔊䔋䔌䔍䔎䔏"
         ar_s<<"䔐䔑䔒䔓䔔䔕䔖䔗䔘䔙䔚䔛䔜䔝䔞䔟䔠䔡䔢䔣"
         ar_s<<"䔤䔥䔦䔧䔨䔩䔪䔫䔬䔭䔮䔯䔰䔱䔲䔳䔴䔵䔶䔷"
         ar_s<<"䔸䔹䔺䔻䔼䔽䔾䔿䕀䕁䕂䕃䕄䕅䕆䕇䕈䕉䕊䕋"
         ar_s<<"䕌䕍䕎䕏䕐䕑䕒䕓䕔䕕䕖䕗䕘䕙䕚䕛䕜䕝䕞䕟"
         ar_s<<"䕠䕡䕢䕣䕤䕥䕦䕧䕨䕩䕪䕫䕬䕭䕮䕯䕰䕱䕲䕳"
         ar_s<<"䕴䕵䕶䕷䕸䕹䕺䕻䕼䕽䕾䕿䖀䖁䖂䖃䖄䖅䖆䖇"
         ar_s<<"䖈䖉䖊䖋䖌䖍䖎䖏䖐䖑䖒䖓䖔䖕䖖䖗䖘䖙䖚䖛"
         ar_s<<"䖜䖝䖞䖟䖠䖡䖢䖣䖤䖥䖦䖧䖨䖩䖪䖫䖬䖭䖮䖯"
         ar_s<<"䖰䖱䖲䖳䖴䖵䖶䖷䖸䖹䖺䖻䖼䖽䖾䖿䗀䗁䗂䗃"
         ar_s<<"䗄䗅䗆䗇䗈䗉䗊䗋䗌䗍䗎䗏䗐䗑䗒䗓䗔䗕䗖䗗"
         ar_s<<"䗘䗙䗚䗛䗜䗝䗞䗟䗠䗡䗢䗣䗤䗥䗦䗧䗨䗩䗪䗫"
         ar_s<<"䗬䗭䗮䗯䗰䗱䗲䗳䗴䗵䗶䗷䗸䗹䗺䗻䗼䗽䗾䗿"
         ar_s<<"䘀䘁䘂䘃䘄䘅䘆䘇䘈䘉䘊䘋䘌䘍䘎䘏䘐䘑䘒䘓"
         ar_s<<"䘔䘕䘖䘗䘘䘙䘚䘛䘜䘝䘞䘟䘠䘡䘢䘣䘤䘥䘦䘧"
         ar_s<<"䘨䘩䘪䘫䘬䘭䘮䘯䘰䘱䘲䘳䘴䘵䘶䘷䘸䘹䘺䘻"
         ar_s<<"䘼䘽䘾䘿䙀䙁䙂䙃䙄䙅䙆䙇䙈䙉䙊䙋䙌䙍䙎䙏"
         ar_s<<"䙐䙑䙒䙓䙔䙕䙖䙗䙘䙙䙚䙛䙜䙝䙞䙟䙠䙡䙢䙣"
         ar_s<<"䙤䙥䙦䙧䙨䙩䙪䙫䙬䙭䙮䙯䙰䙱䙲䙳䙴䙵䙶䙷"
         ar_s<<"䙸䙹䙺䙻䙼䙽䙾䙿䚀䚁䚂䚃䚄䚅䚆䚇䚈䚉䚊䚋"
         ar_s<<"䚌䚍䚎䚏䚐䚑䚒䚓䚔䚕䚖䚗䚘䚙䚚䚛䚜䚝䚞䚟"
         ar_s<<"䚠䚡䚢䚣䚤䚥䚦䚧䚨䚩䚪䚫䚬䚭䚮䚯䚰䚱䚲䚳"
         ar_s<<"䚴䚵䚶䚷䚸䚹䚺䚻䚼䚽䚾䚿䛀䛁䛂䛃䛄䛅䛆䛇"
         ar_s<<"䛈䛉䛊䛋䛌䛍䛎䛏䛐䛑䛒䛓䛔䛕䛖䛗䛘䛙䛚䛛"
         ar_s<<"䛜䛝䛞䛟䛠䛡䛢䛣䛤䛥䛦䛧䛨䛩䛪䛫䛬䛭䛮䛯"
         ar_s<<"䛰䛱䛲䛳䛴䛵䛶䛷䛸䛹䛺䛻䛼䛽䛾䛿䜀䜁䜂䜃"
         ar_s<<"䜄䜅䜆䜇䜈䜉䜊䜋䜌䜍䜎䜏䜐䜑䜒䜓䜔䜕䜖䜗"
         ar_s<<"䜘䜙䜚䜛䜜䜝䜞䜟䜠䜡䜢䜣䜤䜥䜦䜧䜨䜩䜪䜫"
         ar_s<<"䜬䜭䜮䜯䜰䜱䜲䜳䜴䜵䜶䜷䜸䜹䜺䜻䜼䜽䜾䜿"
         ar_s<<"䝀䝁䝂䝃䝄䝅䝆䝇䝈䝉䝊䝋䝌䝍䝎䝏䝐䝑䝒䝓"
         ar_s<<"䝔䝕䝖䝗䝘䝙䝚䝛䝜䝝䝞䝟䝠䝡䝢䝣䝤䝥䝦䝧"
         ar_s<<"䝨䝩䝪䝫䝬䝭䝮䝯䝰䝱䝲䝳䝴䝵䝶䝷䝸䝹䝺䝻"
         ar_s<<"䝼䝽䝾䝿䞀䞁䞂䞃䞄䞅䞆䞇䞈䞉䞊䞋䞌䞍䞎䞏"
         ar_s<<"䞐䞑䞒䞓䞔䞕䞖䞗䞘䞙䞚䞛䞜䞝䞞䞟䞠䞡䞢䞣"
         ar_s<<"䞤䞥䞦䞧䞨䞩䞪䞫䞬䞭䞮䞯䞰䞱䞲䞳䞴䞵䞶䞷"
         ar_s<<"䞸䞹䞺䞻䞼䞽䞾䞿䟀䟁䟂䟃䟄䟅䟆䟇䟈䟉䟊䟋"
         ar_s<<"䟌䟍䟎䟏䟐䟑䟒䟓䟔䟕䟖䟗䟘䟙䟚䟛䟜䟝䟞䟟"
         ar_s<<"䟠䟡䟢䟣䟤䟥䟦䟧䟨䟩䟪䟫䟬䟭䟮䟯䟰䟱䟲䟳"
         ar_s<<"䟴䟵䟶䟷䟸䟹䟺䟻䟼䟽䟾䟿䠀䠁䠂䠃䠄䠅䠆䠇"
         ar_s<<"䠈䠉䠊䠋䠌䠍䠎䠏䠐䠑䠒䠓䠔䠕䠖䠗䠘䠙䠚䠛"
         ar_s<<"䠜䠝䠞䠟䠠䠡䠢䠣䠤䠥䠦䠧䠨䠩䠪䠫䠬䠭䠮䠯"
         ar_s<<"䠰䠱䠲䠳䠴䠵䠶䠷䠸䠹䠺䠻䠼䠽䠾䠿䡀䡁䡂䡃"
         ar_s<<"䡄䡅䡆䡇䡈䡉䡊䡋䡌䡍䡎䡏䡐䡑䡒䡓䡔䡕䡖䡗"
         ar_s<<"䡘䡙䡚䡛䡜䡝䡞䡟䡠䡡䡢䡣䡤䡥䡦䡧䡨䡩䡪䡫"
         ar_s<<"䡬䡭䡮䡯䡰䡱䡲䡳䡴䡵䡶䡷䡸䡹䡺䡻䡼䡽䡾䡿"
         ar_s<<"䢀䢁䢂䢃䢄䢅䢆䢇䢈䢉䢊䢋䢌䢍䢎䢏䢐䢑䢒䢓"
         ar_s<<"䢔䢕䢖䢗䢘䢙䢚䢛䢜䢝䢞䢟䢠䢡䢢䢣䢤䢥䢦䢧"
         ar_s<<"䢨䢩䢪䢫䢬䢭䢮䢯䢰䢱䢲䢳䢴䢵䢶䢷䢸䢹䢺䢻"
         ar_s<<"䢼䢽䢾䢿䣀䣁䣂䣃䣄䣅䣆䣇䣈䣉䣊䣋䣌䣍䣎䣏"
         ar_s<<"䣐䣑䣒䣓䣔䣕䣖䣗䣘䣙䣚䣛䣜䣝䣞䣟䣠䣡䣢䣣"
         ar_s<<"䣤䣥䣦䣧䣨䣩䣪䣫䣬䣭䣮䣯䣰䣱䣲䣳䣴䣵䣶䣷"
         ar_s<<"䣸䣹䣺䣻䣼䣽䣾䣿䤀䤁䤂䤃䤄䤅䤆䤇䤈䤉䤊䤋"
         ar_s<<"䤌䤍䤎䤏䤐䤑䤒䤓䤔䤕䤖䤗䤘䤙䤚䤛䤜䤝䤞䤟"
         ar_s<<"䤠䤡䤢䤣䤤䤥䤦䤧䤨䤩䤪䤫䤬䤭䤮䤯䤰䤱䤲䤳"
         ar_s<<"䤴䤵䤶䤷䤸䤹䤺䤻䤼䤽䤾䤿䥀䥁䥂䥃䥄䥅䥆䥇"
         ar_s<<"䥈䥉䥊䥋䥌䥍䥎䥏䥐䥑䥒䥓䥔䥕䥖䥗䥘䥙䥚䥛"
         ar_s<<"䥜䥝䥞䥟䥠䥡䥢䥣䥤䥥䥦䥧䥨䥩䥪䥫䥬䥭䥮䥯"
         ar_s<<"䥰䥱䥲䥳䥴䥵䥶䥷䥸䥹䥺䥻䥼䥽䥾䥿䦀䦁䦂䦃"
         ar_s<<"䦄䦅䦆䦇䦈䦉䦊䦋䦌䦍䦎䦏䦐䦑䦒䦓䦔䦕䦖䦗"
         ar_s<<"䦘䦙䦚䦛䦜䦝䦞䦟䦠䦡䦢䦣䦤䦥䦦䦧䦨䦩䦪䦫"
         ar_s<<"䦬䦭䦮䦯䦰䦱䦲䦳䦴䦵䦶䦷䦸䦹䦺䦻䦼䦽䦾䦿"
         ar_s<<"䧀䧁䧂䧃䧄䧅䧆䧇䧈䧉䧊䧋䧌䧍䧎䧏䧐䧑䧒䧓"
         ar_s<<"䧔䧕䧖䧗䧘䧙䧚䧛䧜䧝䧞䧟䧠䧡䧢䧣䧤䧥䧦䧧"
         ar_s<<"䧨䧩䧪䧫䧬䧭䧮䧯䧰䧱䧲䧳䧴䧵䧶䧷䧸䧹䧺䧻"
         ar_s<<"䧼䧽䧾䧿䨀䨁䨂䨃䨄䨅䨆䨇䨈䨉䨊䨋䨌䨍䨎䨏"
         ar_s<<"䨐䨑䨒䨓䨔䨕䨖䨗䨘䨙䨚䨛䨜䨝䨞䨟䨠䨡䨢䨣"
         ar_s<<"䨤䨥䨦䨧䨨䨩䨪䨫䨬䨭䨮䨯䨰䨱䨲䨳䨴䨵䨶䨷"
         ar_s<<"䨸䨹䨺䨻䨼䨽䨾䨿䩀䩁䩂䩃䩄䩅䩆䩇䩈䩉䩊䩋"
         ar_s<<"䩌䩍䩎䩏䩐䩑䩒䩓䩔䩕䩖䩗䩘䩙䩚䩛䩜䩝䩞䩟"
         ar_s<<"䩠䩡䩢䩣䩤䩥䩦䩧䩨䩩䩪䩫䩬䩭䩮䩯䩰䩱䩲䩳"
         ar_s<<"䩴䩵䩶䩷䩸䩹䩺䩻䩼䩽䩾䩿䪀䪁䪂䪃䪄䪅䪆䪇"
         ar_s<<"䪈䪉䪊䪋䪌䪍䪎䪏䪐䪑䪒䪓䪔䪕䪖䪗䪘䪙䪚䪛"
         ar_s<<"䪜䪝䪞䪟䪠䪡䪢䪣䪤䪥䪦䪧䪨䪩䪪䪫䪬䪭䪮䪯"
         ar_s<<"䪰䪱䪲䪳䪴䪵䪶䪷䪸䪹䪺䪻䪼䪽䪾䪿䫀䫁䫂䫃"
         ar_s<<"䫄䫅䫆䫇䫈䫉䫊䫋䫌䫍䫎䫏䫐䫑䫒䫓䫔䫕䫖䫗"
         ar_s<<"䫘䫙䫚䫛䫜䫝䫞䫟䫠䫡䫢䫣䫤䫥䫦䫧䫨䫩䫪䫫"
         ar_s<<"䫬䫭䫮䫯䫰䫱䫲䫳䫴䫵䫶䫷䫸䫹䫺䫻䫼䫽䫾䫿"
         ar_s<<"䬀䬁䬂䬃䬄䬅䬆䬇䬈䬉䬊䬋䬌䬍䬎䬏䬐䬑䬒䬓"
         ar_s<<"䬔䬕䬖䬗䬘䬙䬚䬛䬜䬝䬞䬟䬠䬡䬢䬣䬤䬥䬦䬧"
         ar_s<<"䬨䬩䬪䬫䬬䬭䬮䬯䬰䬱䬲䬳䬴䬵䬶䬷䬸䬹䬺䬻"
         ar_s<<"䬼䬽䬾䬿䭀䭁䭂䭃䭄䭅䭆䭇䭈䭉䭊䭋䭌䭍䭎䭏"
         ar_s<<"䭐䭑䭒䭓䭔䭕䭖䭗䭘䭙䭚䭛䭜䭝䭞䭟䭠䭡䭢䭣"
         ar_s<<"䭤䭥䭦䭧䭨䭩䭪䭫䭬䭭䭮䭯䭰䭱䭲䭳䭴䭵䭶䭷"
         ar_s<<"䭸䭹䭺䭻䭼䭽䭾䭿䮀䮁䮂䮃䮄䮅䮆䮇䮈䮉䮊䮋"
         ar_s<<"䮌䮍䮎䮏䮐䮑䮒䮓䮔䮕䮖䮗䮘䮙䮚䮛䮜䮝䮞䮟"
         ar_s<<"䮠䮡䮢䮣䮤䮥䮦䮧䮨䮩䮪䮫䮬䮭䮮䮯䮰䮱䮲䮳"
         ar_s<<"䮴䮵䮶䮷䮸䮹䮺䮻䮼䮽䮾䮿䯀䯁䯂䯃䯄䯅䯆䯇"
         ar_s<<"䯈䯉䯊䯋䯌䯍䯎䯏䯐䯑䯒䯓䯔䯕䯖䯗䯘䯙䯚䯛"
         ar_s<<"䯜䯝䯞䯟䯠䯡䯢䯣䯤䯥䯦䯧䯨䯩䯪䯫䯬䯭䯮䯯"
         ar_s<<"䯰䯱䯲䯳䯴䯵䯶䯷䯸䯹䯺䯻䯼䯽䯾䯿䰀䰁䰂䰃"
         ar_s<<"䰄䰅䰆䰇䰈䰉䰊䰋䰌䰍䰎䰏䰐䰑䰒䰓䰔䰕䰖䰗"
         ar_s<<"䰘䰙䰚䰛䰜䰝䰞䰟䰠䰡䰢䰣䰤䰥䰦䰧䰨䰩䰪䰫"
         ar_s<<"䰬䰭䰮䰯䰰䰱䰲䰳䰴䰵䰶䰷䰸䰹䰺䰻䰼䰽䰾䰿"
         ar_s<<"䱀䱁䱂䱃䱄䱅䱆䱇䱈䱉䱊䱋䱌䱍䱎䱏䱐䱑䱒䱓"
         ar_s<<"䱔䱕䱖䱗䱘䱙䱚䱛䱜䱝䱞䱟䱠䱡䱢䱣䱤䱥䱦䱧"
         ar_s<<"䱨䱩䱪䱫䱬䱭䱮䱯䱰䱱䱲䱳䱴䱵䱶䱷䱸䱹䱺䱻"
         ar_s<<"䱼䱽䱾䱿䲀䲁䲂䲃䲄䲅䲆䲇䲈䲉䲊䲋䲌䲍䲎䲏"
         ar_s<<"䲐䲑䲒䲓䲔䲕䲖䲗䲘䲙䲚䲛䲜䲝䲞䲟䲠䲡䲢䲣"
         ar_s<<"䲤䲥䲦䲧䲨䲩䲪䲫䲬䲭䲮䲯䲰䲱䲲䲳䲴䲵䲶䲷"
         ar_s<<"䲸䲹䲺䲻䲼䲽䲾䲿䳀䳁䳂䳃䳄䳅䳆䳇䳈䳉䳊䳋"
         ar_s<<"䳌䳍䳎䳏䳐䳑䳒䳓䳔䳕䳖䳗䳘䳙䳚䳛䳜䳝䳞䳟"
         ar_s<<"䳠䳡䳢䳣䳤䳥䳦䳧䳨䳩䳪䳫䳬䳭䳮䳯䳰䳱䳲䳳"
         ar_s<<"䳴䳵䳶䳷䳸䳹䳺䳻䳼䳽䳾䳿䴀䴁䴂䴃䴄䴅䴆䴇"
         ar_s<<"䴈䴉䴊䴋䴌䴍䴎䴏䴐䴑䴒䴓䴔䴕䴖䴗䴘䴙䴚䴛"
         ar_s<<"䴜䴝䴞䴟䴠䴡䴢䴣䴤䴥䴦䴧䴨䴩䴪䴫䴬䴭䴮䴯"
         ar_s<<"䴰䴱䴲䴳䴴䴵䴶䴷䴸䴹䴺䴻䴼䴽䴾䴿䵀䵁䵂䵃"
         ar_s<<"䵄䵅䵆䵇䵈䵉䵊䵋䵌䵍䵎䵏䵐䵑䵒䵓䵔䵕䵖䵗"
         ar_s<<"䵘䵙䵚䵛䵜䵝䵞䵟䵠䵡䵢䵣䵤䵥䵦䵧䵨䵩䵪䵫"
         ar_s<<"䵬䵭䵮䵯䵰䵱䵲䵳䵴䵵䵶䵷䵸䵹䵺䵻䵼䵽䵾䵿"
         ar_s<<"䶀䶁䶂䶃䶄䶅䶆䶇䶈䶉䶊䶋䶌䶍䶎䶏䶐䶑䶒䶓"
         ar_s<<"䶔䶕䶖䶗䶘䶙䶚䶛䶜䶝䶞䶟䶠䶡䶢䶣䶤䶥䶦䶧"
         ar_s<<"䶨䶩䶪䶫䶬䶭䶮䶯䶰䶱䶲䶳䶴䶵䶶䶷䶸䶹䶺䶻"
         ar_s<<"䶼䶽䶾䶿゠ァアィイゥウェエォオカガキギク"
         ar_s<<"グケゲコゴサザシジスズセゼソゾタダチヂッ"
         ar_s<<"ツヅテデトドナニヌネノハバパヒビピフブプ"
         ar_s<<"ヘベペホボポマミムメモャヤュユョヨラリル"
         ar_s<<"レロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿ"
         ar_s<<"぀ぁあぃいぅうぇえぉおかがきぎくぐけげこ"
         ar_s<<"ごさざしじすずせぜそぞただちぢっつづてで"
         ar_s<<"とどなにぬねのはばぱひびぴふぶぷへべぺほ"
         ar_s<<"ぼぽまみむめもゃやゅゆょよらりるれろゎわ"
         ar_s<<"ゐゑをんゔゕゖ゗゘゙゚゛゜ゝゞゟ　、。〃"
         ar_s<<"〄々〆〇〈〉《》「」『』【】〒〓〔〕〖〗"
         ar_s<<"〘〙〚〛〜〝〞〟〠〡〢〣〤〥〦〧〨〩〪〫"
         ar_s<<"〭〮〯〬〰〱〲〳〴〵〶〷〸〹〺〻〼〽〾〿"
         #-----semiautomatically--formatted-block--end
         s_0=kibuvits_s_concat_array_of_strings(ar_s).upcase
         s_1=s_0.downcase
         ar_chars_raw=ar_chars_raw+(s_0+s_1).scan(rgx)
         #------------------------
         ar_chars_raw.uniq! # expensive due to data set size
         #---------------------------
         # The freezing of characters in the alphabet avoids
         # memory allocation at random charstream generation.
         # The next loop will probably allocate more memory
         # than would usually be done at random charstream generation,
         # but it makes applications more robust, fault proof.
         # The freezing targets methods String.upcase, String.downcase, etc.
         i_ar_chars_raw_len=ar_chars_raw.size
         ar_chars_raw_frozen=Array.new(i_ar_chars_raw_len,$kibuvits_lc_emptystring)
         i_ar_chars_raw_len.times do |ix|
            ar_chars_raw_frozen[ix]=ar_chars_raw[ix].freeze
         end # loop
         ar_chars_raw.clear
         #---------------------------
         @ar_s_set_of_alphabets_t1_ar_chars=ar_chars_raw_frozen.freeze
      end # synchronize
      ar_out=@ar_s_set_of_alphabets_t1_ar_chars
      return ar_out
   end # ar_s_set_of_alphabets_t1

   def Kibuvits_security_core.ar_s_set_of_alphabets_t1
      ar_out=Kibuvits_security_core.instance.ar_s_set_of_alphabets_t1
      return ar_out
   end # Kibuvits_security_core.ar_s_set_of_alphabets_t1

   #-----------------------------------------------------------------------

   # If string of random characters is needed, then it is
   # recommended to concatenate the characters like that:
   #
   #     s_charstream=kibuvits_s_concat_array_of_strings(ar_array_of_characters)
   #
   def ar_random_charstream_t1(i_lenght_or_output_array=1,b_fast_in_stead_of_thorough=true)
      cl=i_lenght_or_output_array.class
      if KIBUVITS_b_DEBUG
         bn=binding()
         kibuvits_typecheck bn, [Fixnum,Array,Bignum], i_lenght_or_output_array
         kibuvits_typecheck bn, [TrueClass,FalseClass], b_fast_in_stead_of_thorough
         if cl==Array
            i_ar_lenght=i_lenght_or_output_array.size
            kibuvits_assert_is_smaller_than_or_equal_to(bn,
            0, i_ar_lenght,"\n GUID='4606bf59-39f2-409d-944b-60d01021ced7'\n\n")
         else
            kibuvits_assert_is_smaller_than_or_equal_to(bn,
            0, i_lenght_or_output_array,
            "\n GUID='58b71b74-5e7c-4b42-8c2b-60d01021ced7'\n\n")
         end # if
      end # if
      #----------
      ar_out=nil
      i_len=nil
      if cl==Array
         ar_out=i_lenght_or_output_array
         i_len=ar_out.size
         return ar_out if i_len==0
      else
         i_len=i_lenght_or_output_array
         return [] if i_len==0
         ar_out=Array.new(i_len,42)
      end # if
      #----------
      ar_alphabet=ar_s_set_of_alphabets_t1()
      i_max_index_in_ar_alphabet=ar_alphabet.size-1
      ix_char=nil
      if (b_fast_in_stead_of_thorough)
         i_len.times do |ix|
            ix_char=Kibuvits_rng.i_random_fast_t1(i_max_index_in_ar_alphabet)
            ar_out[ix]=ar_alphabet[ix_char]
         end # loop
      else
         i_len.times do |ix|
            ix_char=Kibuvits_rng.i_random_t1(i_max_index_in_ar_alphabet)
            ar_out[ix]=ar_alphabet[ix_char]
         end # loop
      end # if
      return ar_out
   end # ar_random_charstream_t1


   def Kibuvits_security_core.ar_random_charstream_t1(
      i_lenght_or_output_array=1,b_fast_in_stead_of_thorough=true)
      ar_out=Kibuvits_security_core.instance.ar_random_charstream_t1(
      i_lenght_or_output_array,b_fast_in_stead_of_thorough)
   end  # Kibuvits_security_core.ar_random_charstream_t1


   #-----------------------------------------------------------------------

   # Returns a frozen hashtable, where keys are integers and
   # values are integers. The lowest index of the characters in the
   # alphabet is considered to be 0.
   # For any kind of substitution to make sense,
   # the alphabet must consist of at least 2 characters, e.g.
   # the minimum value of the i_alphabet_length is 2.
   #
   # The func_gen receives 1 parameter: an alphabet character index.
   # The func_gen will called with all values between
   # [0,(i_alphabet_length-1)]. The func_gen is expected to
   # return nil or an empty array or an array of arrays, were
   # each of the the element-arrays has exactly 2 elements:
   # 2 integers, of which  the first one is used as
   # a key in the output hashtable and the second one is used as the
   # value that corresponds to the key.
   #
   # If func_gen.call(ix) returns nil or an empty array,
   # then that iteration does not edit
   # the output hashtable and
   # the loop moves on to the next iteration.
   # The  nil and <empty array> allow the assembly of
   # an output hashtable that mimics a sparse table.
   #
   # Any of the integers within the the key-value pairs
   # that the func_gen returns is allowed to be greater
   # than the maximum index of the alphabet or smaller than
   # zero, because they are placed to the output
   # hashtable according to the following formula:
   #
   #     i_normalized=((i_in mod i_alphabet_length)+
   #                  + i_alphabet_length) mod i_alphabet_length)
   #
   def ht_gen_substitution_box_t1(func_gen,i_alphabet_length)
      if KIBUVITS_b_DEBUG
         bn=binding()
         kibuvits_typecheck bn, Proc, func_gen
         kibuvits_typecheck bn, Fixnum, i_alphabet_length
         #-----------
         ar_params=func_gen.parameters
         i_ar_params_len=ar_params.size
         if i_ar_params_len!=1
            kibuvits_throw("i_ar_params_len == "+
            i_ar_params_len.to_s+" != 1\n"+
            "GUID='49046758-c92e-4b18-b41b-60d01021ced7'\n")
         end # if
         ar_paramdesc=ar_params[0]
         if ar_paramdesc[0]!=:req
            kibuvits_throw("ar_paramdesc[0]=="+ar_paramdesc[0].to_s+
            "GUID='3a5d7548-6723-4a5a-92fa-60d01021ced7'\n")
         end # if
         #-----------
         i_alphabet_max_index=i_alphabet_length-1
         kibuvits_assert_is_smaller_than_or_equal_to(bn,1,i_alphabet_max_index,
         "GUID='9bacf720-64f7-4f8e-a3ea-60d01021ced7'\n")
         #-----------
         i_0=20
         i_0=i_alphabet_length if i_alphabet_length<i_0
         func_test=lambda do |ix|
            bn_1=binding()
            x_func_gen=func_gen.call(ix)
            kibuvits_typecheck bn_1, [Array,NilClass], x_func_gen
            if x_func_gen.class==Array # zero or more key-value pairs
               return if x_func_gen.size==0
               ar_keyvalue_pair=x_func_gen[0]
               i_ar_keyvalue_pair_len=ar_keyvalue_pair.size
               if i_ar_keyvalue_pair_len!=2
                  kibuvits_throw("i_ar_keyvalue_pair_len == "+
                  i_ar_keyvalue_pair_len.to_s+" != 2 \n"+
                  "GUID='b0d1075a-216d-42d3-83ca-60d01021ced7'\n")
               end # if
               i_key=ar_keyvalue_pair[0]
               i_value=ar_keyvalue_pair[1]
               kibuvits_typecheck bn_1, Fixnum, i_key
               kibuvits_typecheck bn_1, Fixnum, i_value
            end # if
         end # func_test
         i_0.times{|ix| func_test.call(ix)}
         func_test.call(i_alphabet_length-1)
      end # if
      ht=Hash.new
      x_by_func_gen=nil
      ar_keyvaluepairs=nil
      i_ar_keyvaluepairs_len=nil
      i_key=nil
      i_value=nil
      func_normalize=lambda do |ix|
         # The Ruby implementation makes sure that
         # the reminder is always a positive number, e.g.
         # in Ruby (-1)%3 == 2
         i_normalized=ix%i_alphabet_length
         return i_normalized
      end # func_normalize
      i_alphabet_length.times do |ix_origin|
         x_by_func_gen=func_gen.call(ix_origin)
         next if x_by_func_gen==nil
         ar_keyvaluepairs=x_by_func_gen
         i_ar_keyvaluepairs_len=ar_keyvaluepairs.size
         next if i_ar_keyvaluepairs_len==0
         ar_keyvaluepairs.each do |ar_keyvaluepair|
            i_key=func_normalize.call(ar_keyvaluepair[0])
            i_value=func_normalize.call(ar_keyvaluepair[1])
            ht[i_key]=i_value
         end # loop
      end # loop
      ht_out=ht.freeze
      return ht_out
   end # ht_gen_substitution_box_t1

   def Kibuvits_security_core.ht_gen_substitution_box_t1(
      func_gen,i_alphabet_length)
      ht_out=Kibuvits_security_core.instance.ht_gen_substitution_box_t1(
      func_gen,i_alphabet_length)
      return ht_out
   end # Kibuvits_security_core.ht_gen_substitution_box_t1

   #-----------------------------------------------------------------------

   # Offers a rough estimate. 2010<=i_year
   def i_nsa_cpu_cycles_per_second_t1(i_year=2150)
      bn=binding()
      kibuvits_typecheck bn, [Fixnum,Bignum], i_year if KIBUVITS_b_DEBUG
      kibuvits_assert_is_smaller_than_or_equal_to(bn,2014,i_year,
      "GUID='5f22014c-3fe4-4ebf-92ba-60d01021ced7'\n")
      #------------------
      # According to
      # http://www.theguardian.com/world/2014/feb/12/utah-lawmaker-nsa-data-centre-water-supply
      # The main data-center requires 1,7*10^6*gallons of water daily
      # to cool the data-center down.
      # i_litres_per_gallon=3.7854118 # U.S.
      i_litres_per_gallon=4.546 # UK
      fd_water_gallons_per_day=(1.7).to_r*(10**6)
      fd_water_gallons_per_second=fd_water_gallons_per_day/(24*3600)
      fd_water_litres_per_second=fd_water_gallons_per_second*i_litres_per_gallon
      fd_water_kg_per_second=fd_water_litres_per_second*1
      # They probably will not import the water in ice form
      # and should they use standard materials for
      # building steam infrastructure, then the best that they can
      # get their hands on is probably equipment that is used for
      # nuclear submarines. The temperature of
      # steam in nuclear reactors is about 315C.
      #
      #i_chem_water_molar_mass=2+16 # H2O
      #fd_water_mol_per_second=(fd_water_kg_per_second*1000)/i_chem_water_molar_mass
      #
      # According to
      # http://www.engineeringtoolbox.com/water-thermal-properties-d_162.html
      #
      #
      fd_water_jouls_per_kg_liquid_per_1c=4.2*(10**3) # roughly
      fd_water_jouls_per_kg_from_0c_liquid_to_100c=fd_water_jouls_per_kg_liquid_per_1c*100
      fd_water_jouls_per_kg_evaporation=2270*(10**3) # roughly
      fd_water_jouls_per_kg_vapour_per_1c=2.0*(10**3) # roughly
      #------
      fd_water_jouls_per_kg_0c_liquid_to_315c=fd_water_jouls_per_kg_from_0c_liquid_to_100c+
      fd_water_jouls_per_kg_evaporation+
      (315-100)*fd_water_jouls_per_kg_vapour_per_1c
      #------------------
      fd_jouls_per_second_2014=fd_water_jouls_per_kg_0c_liquid_to_315c*
      fd_water_kg_per_second
      # According to the http://www.adapteva.com/introduction/
      # The 2014 best technology gives roughly
      # 2W per 64 cores that are 1GHz each
      i_cpu_operations_per_second_per_watt_2014=(1*(10**9)*64.to_r/2).floor # 2W
      i_nsa_cpu_operations_per_second_2014=fd_jouls_per_second_2014/
      i_cpu_operations_per_second_per_watt_2014
      #------------------
      # Applying the "worst" case scenario of the Moore's law,
      # the doubling in every 2 years:
      i_2n=2**(((i_year-2014).to_r/2).floor+1)
      i_nsa_cpu_operations_per_second_i_year=i_nsa_cpu_operations_per_second_2014+
      i_nsa_cpu_operations_per_second_2014*i_2n
      # There are probably more than one data centers and
      # some computing resource is rented from Amazon, etc.
      i_out=i_nsa_cpu_operations_per_second_i_year.floor*2
      return i_out
   end # i_nsa_cpu_cycles_per_second_t1

   def Kibuvits_security_core.i_nsa_cpu_cycles_per_second_t1(i_year=2150)
      i_out=Kibuvits_security_core.instance.i_nsa_cpu_cycles_per_second_t1(i_year)
      return i_out
   end # Kibuvits_security_core.i_nsa_cpu_cycles_per_second_t1(i_year)

   #-----------------------------------------------------------------------

   # http://longterm.softf1.com/specifications/txor/
   #
   # TXOR(aa,bb,m)=((bb-aa+m) mod m)
   # Prerequisites:
   #     2≤m
   #     0≤aa<m
   #     0≤bb<m
   #
   # The bb must always be in the role of a key
   #     ciphertext = TXOR(cleartext,key,m)
   #     cleartext = TXOR(ciphertext,key,m)
   #
   def txor(i_cleartext_or_chiphertext,i_key,i_m)
      aa=i_cleartext_or_chiphertext
      bb=i_key
      m=i_m
      if KIBUVITS_b_DEBUG
         bn=binding()
         kibuvits_typecheck(bn, [Fixnum,Bignum], i_cleartext_or_chiphertext,
         "GUID='531c75f1-d7b7-4eb2-a39a-60d01021ced7'")
         kibuvits_typecheck(bn, [Fixnum,Bignum], i_key,
         "GUID='bd54d3a7-c69c-4f9c-928a-60d01021ced7'")
         kibuvits_typecheck(bn, [Fixnum,Bignum], i_m,
         "GUID='9793c021-a4b9-4395-b58a-60d01021ced7'")
         kibuvits_assert_is_smaller_than_or_equal_to(bn,2,m)
         kibuvits_assert_is_smaller_than_or_equal_to(bn,0,aa)
         kibuvits_assert_is_smaller_than_or_equal_to(bn,0,bb)
         kibuvits_assert_is_smaller_than_or_equal_to(bn,(aa+1),m)
         kibuvits_assert_is_smaller_than_or_equal_to(bn,(bb+1),m)
      end # if
      i_out=((bb-aa+m)%m)
      return i_out
   end # txor

   def Kibuvits_security_core.txor(i_cleartext_or_chiphertext,i_key,i_m)
      i_out=Kibuvits_security_core.instance.txor(
      i_cleartext_or_chiphertext,i_key,i_m)
      return i_out
   end # Kibuvits_security_core.txor

   #-----------------------------------------------------------------------

   include Singleton

end # class Kibuvits_security_core

#=========================================================================
